Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/experimental.po
Languages: de

source: Experimental Features
de: Experimentelle Features

source: This is a list of experimental features in CouchDB. They are included in a release because the development team is requesting feedback from the larger developer community. As such, please play around with these features and send us feedback, thanks!
de: Dies is eine Liste experimenteller Features in CouchDB. Sie sind bereits in den Releases integriert, damit das Entwickler-Team Feedback von einem größeren Kreis an Entwicklern aus der Community erhalten kann. Aus diesem Grund bitten wir Euch die Features auszuprobieren und uns Feedback zu senden. Danke!

source: Use at your own risk! Do not rely on these features for critical applications.
de: Nutzung auf eigene Gefahr. Diese Features sollten nicht in business-kritischen Applikationen eingesetzt werden.

source: The NodeJS Query Server is an alternative runtime environment for the default JavaScript Query Server that runs on top of Node.JS and not SpiderMonkey like the default Query Server.
de: Der NodeJS Query Server ist eine alternative Laufzeitumgebung zum standard JavaScript Query Server. Er läuft auf Grundlage von NodeJS und nicht SpiderMonkey.

source: You will need to install Node.JS version 0.10.0 or later. See `Node.JS Downloads <http://nodejs.org/download/>`_ for options.
de: Du musst NodeJS in der Version 0.10.0 oder neuer installieren. Siehe auch `Node.JS Downloads <http://nodejs.org/download/>`_ für weitere Optionen.

source: Install the `couchjs-node` binary. Either from the CouchDB sources::
de: Installiere das `couchjs-node` binary. Entweder vom CouchDB Quellcode::

source: Or via NPM::
de: oder über NPM::

source: **NPM in non-standard locations**
de: **NPM Installation in nicht-standard Ort**

source: If your Node.JS installation doesn’t store binaries in `/usr/local/bin` you will need to adjust CouchDB’s configuration. Add this to your `local.ini` file:
de: Wenn die Binaries von NodeJS nicht in `/usr/local/bin` installiert sind, musst Du die CouchDB Konfiguration anpassen. Füge dies der `local.ini` Datei hinzu:

source: And then restart your CouchDB instance.
de: Starte danach deine CouchDB-Instanz neu.

source: 2. Done. Now you can create design documents with the `language` parameter set to `nodejs` and all JavaScript functions in this design document will be processed by the Node.JS query server.
de: 2. Erledigt. Jetzt kannst Du in Design-Dokumenten dem Attribut `language` den Wert `nodejs`gewbewn und alle JavaScript Funktionen in diesem Design-Dokument werden mit dem NodeJS Query-Server ausgeführt.

source: Enjoy!
de: Viel Spass!

source: Differences from the SpiderMonkey Query Server
de: Unterschiede zum SpiderMonkey Query-Server

source: V8 and SpiderMonkey roughly behave similar, but there might be engine- specific differences that make or break a JavaScript function in one or the other server.
de: V8 und SpiderMonkey verhalten sich im Großen und Ganzen gleich, aber es kann Engine-spezifische Unterschiede geben die dazu führen, dass im einen oder anderen Server JavaScript Funktionalitäten funktionieren oder zu Fehlern führen.

source: See `src/couch_plugins/README.md`.
de: Bitte lese `src/couch_plugins/README.md`.
