Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/install/freebsd.po
Languages: de

source: Installation on FreeBSD
de: Installieren auf FreeBSD

source: Installation from ports
de: Installation von ports

source: This will install CouchDB from the ports collection.
de: So installieren wir CouchDB aus ports.

source: Start script
de: CouchDB beim booten starten

source: The following options for ``/etc/rc.conf`` or ``/etc/rc.conf.local`` are supported by the start script (defaults shown)::
de: Für die ``/etc/rc.conf`` oder ``/etc/rc.conf.local`` können folgende Optionen verwendet werden::

source: After enabling couchdb rc service use the following to start CouchDB::
de: Sobald man den CouchDB rc-Dienst eingerichtet hat, kann man CouchDB so starten:

source: This script responds to the arguments `start`, `stop`, `status`, `rcvar` etc..
de: Man kann mit diesem Script Parameter wie `start`, `stop`, `status`, `rcvar` usw. nutzen.

source: The start script will also use settings from the following config files:
de: Das Script zum Starten von CouchDB benutzt folgende Konfigurationsdateien:

source: Administrators should use ``default.ini`` as reference and only modify the ``local.ini`` file.
de: Man sollte die ``default.ini`` als Referenz benutzen und nur die ``local.ini`` auf seine eigenen Bedürfnisse anpassen.

source: Post install
de: Nach der Installation

source: In case the install script fails to install a noninteractive user "couchdb" to be used for the database, the user needs to be created manually:
de: Wenn das Installationsscript keinen Benutzer "couchdb" für die Datenbank anlegen konnte, müssen wir ihn manuell anlegen:

source: I used the ``pw`` command to add a user "couchdb" in group "couchdb":
de: Ich habe hier den Befehl ``pw`` benutzt, um den Benutzer "couchdb" der Gruppe "couchdb" hinzuzufügen:

source: The user is added to ``/etc/passwd`` and should look similar to the following:
de: Der Benutzer wird zur ``/etc/passwd`` hinzugefügt. Das Ganze sollte dann so aussehen:

source: To change any of these settings, please refrain from editing `/etc/passwd` and instead use ``pw user mod ...`` or ``vipw``. Make sure that the user has no shell, but instead uses ``/usr/sbin/nologin``. The '*' in the second field means that this user can not login via password authorization. For details use `man 5 passwd`_.
de: Bitte editiere nie direkt die `/etc/passwd`, sondern benutze Befehle wie ``pw user mod ...`` or ``vipw``. Der Benutzer "couchdb" sollte keine Shell bekommen, sondern ``/usr/sbin/nologin`` nutzen. Wenn sich im zweiten Feld ein '*' befindet, kann der Benutzer sich nicht mit der passwortbasierten Autorisierung anmelden, mehr Details dazu gibt es mit `man 5 passwd`_.
