Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/install/mac.po
Languages: de

source: Installation on Mac OS X
de: Installation auf Mac OSX

source: Installation using the Apache CouchDB native application
de: CouchDB mit der nativen Apache CouchDB App installieren

source: The easiest way to run CouchDB on Mac OS X is through his native Mac OS X application. Just follow the below instructions:
de: In Mac OS X kann man CouchDB am leichtesten mit der nativen Mac OS X Anwendung installieren:

source: `Download Apache CouchDB for Mac OS X`_. Old releases are available at `archive`_.
de: `Download Apache CouchDB for Mac OS X`_. Alte Releases erhält man im `archive`_.

source: Double click on the Zip file
de: Mache einen Doppelklick auf die Zip-Datei

source: Drag and drop the Apache CouchDB.app into Applications folder
de: Ziehe die Apache CouchDB.app in den Ordner Programme

source: That's all, now CouchDB is installed on your Mac:
de: Das wars, die CouchDB ist jetzt auf deinem Mac installiert:

source: Run Apache CouchDB application
de: Die Apache CouchDB starten

source: `Open up Futon`_, the CouchDB admin interface
de: `Open up Futon`_, die CouchDB Adminstrationsoberfläche

source: Installation with HomeBrew
de: Mit Homebrew installieren

source: You can install the build tools by running::
de: Installiere die Build-Tools, um CouchDB zu kompilieren::

source: You will need `Homebrew`_ installed to use the `brew` command. To install the other :ref:`dependencies <install/unix/dependencies>` run next commands::
de: Um den `brew` Befehl nutzen zu können muss `Homebrew`_ installiert sein. Um die anderen :ref:`Abhängigkeiten <install/unix/dependencies>` zu installieren gibt man folgende Befehle ein::

source: You may want to link ICU so that CouchDB can find the header files automatically::
de: Damit CouchDB die Headerfiles automatisch findet, kannst du ICU linken::

source: The same is true for recent versions of Erlang::
de: Das gilt auch für die neueste Erlang Version::

source: Now it's time to brew CouchDB::
de: Nun können wir CouchDB installieren::

source: The above Erlang install will use the bottled (pre-compiled) version if you are: using `/usr/local` for `homebrew`, and on 10.6 or 10.7. If you're not on one of these, `homebrew` will build from source, so consider doing::
de: Die vorkompilierte Version wird installiert, wenn man auf 10.6 und 10.7 ist und `/usr/local` für `homebrew` nutzt. Falls dies nicht der Fall ist, benutze folgendes::

source: to trim down compilation time.
de: um die Zeit für das kompilieren etwas abzukürzen.

source: If you're hacking on CouchDB, and we hope you will, you may try the current git-based master (head) branch, or the next development release using this ``couchdb`` recipe, using either ``--head`` or ``--devel`` options respectively. This will allow quick installation of the future release branch when it becomes active. If you're not sure if you need this, then you probably don't. In both cases we assume you are comfortable identifying bugs, and handling any potential upgrades between commits to the codebase.
de: Falls du an CouchDB hackst, worüber wir uns freuen würden, kannst du dir den derzeitigen git master Branch auschecken oder das nächste development Release mit dem ``couchdb`` Rezept und den Parametern ``--head`` oder ``--devel`` installieren. So kannst du neue, zukünftige Release Branches schnell installieren. Wenn du nicht sicher bist, ob du das benötigst, wirst du diese Installation wahrscheinlich nicht brauchen. Du solltest mit Bugs leben können und die Codebase nach ein paar Commits updaten.

source: OS X Lion might hang on the final brew. See the thread at https://github.com/mxcl/homebrew/issues/7024 it seems in most cases to be resolved by breaking out with ``CTRL-C`` and then repeating with ``brew install -v couchdb``.
de: Es kann passieren dass OS X Lion bei der Installation via Homebrew nicht mehr reagiert. Es gibt einen Thread unter https://github.com/mxcl/homebrew/issues/7024 und das Problem scheint in den meisten Fällen durch ein ``CTRL-C`` mit anschließendem ``brew install -v couchdb`` behoben zu werden.

source: If you wish to have CouchDB run as a daemon then, set up the account, using the "User & Groups" preference pane:
de: Wenn du CouchDB als einen Daemon aufsetzen willst, klicke auf "Benutzer & Gruppen" in den Einstellungen:

source: Create a standard user `couchdb` with home directory as `/usr/local/var/lib/couchdb`
de: Erstelle einen normalen Benutzer `couchdb` mit dem Homeverzeichnis `/usr/local/var/lib/couchdb`

source: Create a group called `couchdb` and add yourself, the `couchdb` user, and any others you want to be able to edit config or db files directly to it. Use the `advanced` group options to ensure the internal name is also correctly called `couchdb`.
de: Erstelle eine Gruppe `couchdb` und füge dich selbst, alle anderen Benutzer die Konfigurationsdateien oder Datenbankdateien editieren können sollen und den Benutzer `couchdb` hinzu. In dem Screen `Erweiterte Optionen` sollte der interne Name auch für den Benutzer `couchdb` auch `couchdb` lauten.

source: Some versions of Mac OS X ship a problematic OpenSSL library. If you're experiencing troubles with CouchDB crashing intermittently with a segmentation fault or a bus error, you will need to install your own version of OpenSSL.
de: Einige Versionen von Mac OS X kommen mit OpenSSL Bibliotheken, die Probleme verursachen. Wenn deine CouchDB zwischendurch mit Segmentation Faults oder einem Bus-Error abstürzt solltest du deine eigene OpenSSL Version installieren.

source: Running as a Daemon
de: Als Daemon betreiben

source: You can use the `launchctl` command to control the CouchDB daemon.
de: Um den CouchDB Daemon zu steuern kannst du den `launchctl` Befehl benutzen.

source: You can load the configuration by running::
de: Du kannst die Konfiguration so laden::

source: You can stop the CouchDB daemon by running::
de: Du kannst den CouchDB Daemon so stoppen::

source: You can start CouchDB by running::
de: So kannst du CouchDB starten::

source: You can restart CouchDB by running::
de: Du kannst CouchDB so neustarten::

source: You can edit the launchd configuration by running::
de: Du kannst die launchd Konfiguration so editieren::

source: To start the daemon on boot, copy the configuration file to::
de: Um den Daemon beim booten zu starten, kopiere die Konfigurationsdatei hierhin::

source: Consult your system documentation for more information.
de: In deiner Systemdokumentation findest du nähere Details.

source: Installation from MacPorts
de: Von MacPorts installieren

source: To install CouchDB using MacPorts you have 2 package choices:
de: Es gibt zwei Pakete um CouchDB mit Hilfe von MacPorts zu installieren:

source: ``couchdb`` - the latest release version
de: ``couchdb`` - das neueste Stable Release

source: ``couchdb-devel`` - updated every few weeks with the latest from the master branch
de: ``couchdb-devel`` - wird alle paar Wochen mit den letzten Änderungen aus dem Masterbranch aktualisiert

source: should be enough. MacPorts takes care of installing all necessary dependencies. If you have already installed some of the CouchDB dependencies via MacPorts, run this command to check and upgrade any outdated ones, after installing CouchDB::
de: sollte ausreichen. MacPorts wird alle benötigten Abhängigkeiten installieren. Falls du schon einige Abhängigkeiten per MacPorts installiert hast, führe folgenden Befehl nach der Installation von CouchDB aus um sie zu überprüfen und ggf. zu aktualisieren::

source: This will upgrade dependencies recursively, if there are more recent versions available. If you want to run CouchDB as a service controlled by the OS, load the launchd configuration which comes with the project, with this command::
de: Damit updatest du alle Abhängigkeiten. Wenn du CouchDB als Beriebssystem-Service starten willst, lade einfach die mitgelieferte launchd Konfiguration::

source: and it should be up and accessible via Futon at http://127.0.0.1:5984/_utils. It should also be restarted automatically after reboot.
de: und CouchDB sollte starten und Futon unter http://127.0.0.1:5984/_utils erreichbar sein. CouchDB sollte nun auch nach einem Neustart des Betriebsystems automatisch starten.

source: Updating the ports collection. The collection of port files has to be updated to reflect the latest versions of available packages. In order to do that run::
de: Damit man die neuesten Version von einem Paket bekommt, sollte man seine ports-Dateien regelmäßig aktualisieren. Führe einfach folgendes aus::

source: to update the port tree, and then install just as explained.
de: Damit wird der Baum von Abhängigkeiten in ports aktualisiert und du kannst wie beschrieben installieren.
