Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/install/unix.po
Languages: de

source: Installation on Unix-like systems
de: Installation auf Unix-artigen Systemen

source: A high-level guide to Unix-like systems, inc. Mac OS X and Ubuntu.
de: Ein High-Level-Leitfaden für Unix-artige Systeme, inklusive Mac OS X und Ubuntu.

source: This document is the canonical source of installation information. However, many systems have gotchas that you need to be aware of. In addition, dependencies frequently change as distributions update their archives. If you're running into trouble, be sure to check out the wiki. If you have any tips to share, please also update the wiki so that others can benefit from your experience.
de: Dieses Dokument stellt die Grundlage für den allgemein gängigen Weg zur Installation dar. Trotz allem haben viel Systeme Fallstricke derer du dir bewusst sein solltest. Ausserdem kommt es vor, dass sich Abhängigkeiten zeitweise ändern, weil die Distributionen ihre Archive aktualisieren. Wenn du über Probleme stolperst, schau bitte unbedingt im Wiki nach. Und wenn du Tipps hast aktualisiere bitte das Wiki, so dass andere von deinen Erfahrungen profitieren können.

source: `Community installation guides`_
de: `Community Installations-Leitfaden`_

source: Troubleshooting
de: Problemlösungen

source: There is a `troubleshooting guide`_.
de: Es gibt einen `Problemlösungs-Leitfaden`_.

source: There is a `wiki`_ for general documentation.
de: Es gibt ein `Wiki`_ die allgemeine Dokumentation.

source: There are collection of `friendly mailing lists`_.
de: Es gibt eine Sammlung von `Mailing-Listen`_.

source: Please work through these in order if you experience any problems.
de: Bitte arbeite dich durch diese der Reihe nach wenn du auf Probleme stößt.

source: Dependencies
de: Abhängigkeiten

source: You should have the following installed:
de: Dies sollte installiert sein:

source: `GNU Compiler Collection <http://gcc.gnu.org/>`_
de: `Compilador GNU <http://gcc.gnu.org/>`_

source: `Python (>=2.7) for docs <http://python.org/>`_
de: `Python (>=2.7) para documentos <http://python.org/>`_

source: It is recommended that you install Erlang OTP R13B-4 or above where possible. You will only need libcurl if you plan to run the JavaScript test suite. And help2man is only need if you plan on installing the CouchDB man pages. Python and Sphinx are only required for building the online documentation.
de: Es wird empfohlen, dass du, wenn möglich, Erlang OTP R13B-4 oder neuer installierst. Du brauchst nur libcurl wenn die JavaScript test-Suite laufen lassen willst. Und help2man wird nur benötigt wenn du vor hast die CouchDB "man pages" zu installieren. Python und Sphinx werden nur benötigt, wenn du die online Dokumentation erstellen willst.

source: Debian-based Systems
de: Debian-gestützte Systeme

source: You can install the dependencies by running::
de: Du kannst die Abhängigkeiten installieren, wenn du dies ausführst::

source: There are lots of Erlang packages. If there is a problem with your install, try a different mix. There is more information on the wiki. Additionally, you might want to install some of the optional Erlang tools which may also be useful.
de: Es gibt viele Erlang Pakete. Wenn es bei deiner Installation zu Problemen kommt, probiere ein anderes aus. Dazu gibt es weitere Informationen im Wiki. Ausserdem ist es ev. eine gute Idee einige der optionalen Erlang Tools zu installieren. Diese können sehr hilfreich sein.

source: Be sure to update the version numbers to match your system's available packages.
de: Achte darauf die Versions-Nummer, die zu deinen auf deinem System verfügbaren Paketen passt, anzupassen.

source: Unfortunately, it seems that installing dependencies on Ubuntu is troublesome.
de: Leider sieht es so aus, dass die Installation von Abhängigkeiten auf Ubuntu fehlerhaft sein kann.

source: `Installing on Debian <http://wiki.apache.org/couchdb/Installing_on_Debian>`_
de: `Installation auf Debian <http://wiki.apache.org/couchdb/Installing_on_Debian>`_

source: `Installing on Ubuntu <http://wiki.apache.org/couchdb/Installing_on_Ubuntu>`_
de: `Installation auf Ubuntu <http://wiki.apache.org/couchdb/Installing_on_Ubuntu>`_

source: RedHat-based (Fedora, Centos, RHEL) Systems
de: RedHat-basierte (Fedora, Centos, RHEL) Systeme

source: While CouchDB builds against the default js-devel-1.7.0 included in some distributions, it's recommended to use a more recent js-devel-1.8.5.
de: Obwohl CouchDB gegen das standard Pakete js-devel-1.7.0, welches in einigen Distributionen vorhanden ist, gebaut wird, wird empfohlen das aktuellere Paket js-devel-1.8.5 zu nutzen.

source: Follow :ref:`install/mac/homebrew` reference till `brew install couchdb` step.
de: Folge der :ref:`install/mac/homebrew` Referenz bis zum Schritt `brew install couchdb`.

source: Installing
de: Installieren

source: Once you have satisfied the dependencies you should run::
de: Sobald du alle Abhängigkeiten erfüllt hast, solltest du dies ausführen::

source: This script will configure CouchDB to be installed into `/usr/local` by default.
de: Das Skript konfiguriert CouchDB um nach `/usr/local` installiert zu werden.

source: If you wish to customise the installation, pass `--help` to this script.
de: Wenn du die Installation individualisieren möchtest, füge dem Script `--help` an.

source: If everything was successful you should see the following message::
de: Wenn alles erfolgreich von Statten ging, solltest du folgende Mitteilung sehen::

source: To install CouchDB you should run::
de: Um CouchDB zu installieren solltest du dies ausführen::

source: You only need to use `sudo` if you're installing into a system directory.
de: `sudo` brauchst du nur, wenn du in ein System-Verzeichnis installieren willst.

source: Try `gmake` if `make` is giving you any problems.
de: Probiere `gmake` aus wenn es bei der Nutzung von `make` zu Problemen kommt.

source: First Run
de: Der erste Lauf

source: You can start the CouchDB server by running::
de: Du kannst den CouchDB Server starten indem du folgenden Befehl ausführst::

source: This uses the `sudo` command to run the `couchdb` command as the `couchdb` user.
de: Dabei wird das `sudo` Kommando genutzt um das `couchdb` Programm als Benutzer `couchdb` auszuführen.

source: When CouchDB starts it should eventually display the following message::
de: Wenn CouchDB startet sollte schließlich die folgende Meldung angezeigt werden:

source: To check that everything has worked, point your web browser to::
de: Um zu überprüfen, dass alles funktioniert hat, öffne die folgende URL in deinem Browser:

source: From here you should run the test suite in Firefox.
de: Im nächsten Schritt solltest du die Testsuite in Firefox ausführen.

source: Security Considerations
de: Überlegungen zu Sicherheits-Aspekten

source: You should create a special `couchdb` user for CouchDB.
de: Du solltest einen speziellen `couchdb` Benutzer für CouchDB erstellen.

source: On many Unix-like systems you can run::
de: Auf vielen Unix-artigen Systemen kannst du dies so bewerkstelligen::

source: On Mac OS X you can use the `Workgroup Manager`_ to create users.
de: Auf Mac OS X kannst du den `Workgroup Manager`_ nutzen um Benutzer zu erstellen.

source: You must make sure that:
de: Du musst folgendes sicherstellen:

source: The user has a working POSIX shell
de: Der Benutzer muss eine funktionierende POSIX shell haben

source: The user's home directory is `/usr/local/var/lib/couchdb`
de: Das Home-Verzeichnis ist `/usr/local/var/lib/couchdb`

source: You can test this by:
de: Testen kannst Du dies folgendermaßen:

source: Trying to log in as the `couchdb` user
de: Versuche dich als Benutzer `couchdb` einzuloggen

source: Running `pwd` and checking the present working directory
de: Führe den Befehl `pwd` aus und prüfe das aktuelle Verzeichnis

source: Change the ownership of the CouchDB directories by running::
de: Ändere den Besitzer des CouchDB Verzeichnis indem du dies ausführst::

source: Change the permission of the CouchDB directories by running::
de: Ändere die Rechte der CouchDB Verzeichnisse indem du dies ausführst::

source: Running as a Daemon
de: Als Daemon ausführen

source: SysV/BSD-style Systems
de: SysV/BSD-artige Systeme

source: You can use the `couchdb` init script to control the CouchDB daemon.
de: Du kannst das `couchdb` init Script nutzen um den CouchDB daemon zu kontrollieren.

source: On SysV-style systems, the init script will be installed into::
de: Auf SysV-artigen Systemen wird das init Script hier hin installiert::

source: On BSD-style systems, the init script will be installed into::
de: Auf BSD-artigen Systemen wird das init Script hier hin installiert::

source: We use the `[init.d|rc.d]` notation to refer to both of these directories.
de: Wir nutzen die `[init.d|rc.d]` Schreibweise um auf diese beiden Verzeichnisse zu verweisen.

source: You can control the CouchDB daemon by running::
de: Du kannst den CouchDB Daemon kontrollieren, indem du dies ausführst::

source: If you wish to configure how the init script works, you can edit::
de: Wenn Du das verhalten des init Script ändern möchtest, kannst Du folgende Datei ändern::

source: Comment out the `COUCHDB_USER` setting if you're running as a non-superuser.
de: Kommentiere die `COUCHDB_USER` Einstellung aus wenn du als Nicht-Superuser arbeitest.

source: To start the daemon on boot, copy the init script to::
de: Um den Daemon während des Bootvorgangs zu starten kopierst du das Script nach::

source: You should then configure your system to run the init script automatically.
de: Du solltest dein System dann so konfigurieren, dass das init Script automatisch ausgeführt wird.

source: You may be able to run::
de: Eine Möglichkeit dies zu tun ist::

source: If this fails, consult your system documentation for more information.
de: Sollte dies nicht funktionieren sieh bitte in der Dokumentation für dein System für weitere Informationen nach.

source: A `logrotate` configuration is installed into::
de: Eine `logrotate` Konfiguration wird hier hin installiert::

source: Consult your `logrotate` documentation for more information.
de: Sieh in der `logrotate` Dokumentation für weitere Informationen nach.

source: It is critical that the CouchDB logs are rotated so as not to fill your disk.
de: Es ist entscheidend, dass die CouchDB logs rotiert werden damit die Festplatte nicht voll läuft.
