Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/install/windows.po
Languages: de

source: Installation on Windows
de: Auf Windows installieren

source: There are two ways to install CouchDB on Windows.
de: Es gibt zwei Wege CouchDB auf Windows zu installieren.

source: Installation from binaries
de: Installation mit Hilfe von Binaries

source: This is the simplest way to go.
de: Das ist der leichteste Weg.

source: Get `the latest Windows binaries`_ from `CouchDB web site`_. Old releases are available at `archive`_.
de: Hole dir `the latest Windows binaries`_ von der `CouchDB web site`_. Alte Releases findest du im `archive`_.

source: Follow the installation wizard steps:
de: Folge den Schritten im Installationswizard:

source: Next on "Welcome" screen
de: Weiter auf dem "Willkommen" Bildschirm

source: Accept the License agreement
de: Akzeptiere die Lizenz

source: Select the installation directory
de: Wähle das Installationsverzeichnis

source: Specify "Start Menu" group name
de: Lege den Gruppennamen fürs "Startmenü" fest

source: Approve that you'd like to install CouchDB as service and let him been started automatically after installation (probably, you'd like so)
de: Bestätige, dass du CouchDB als Dienst installieren möchtest. Wenn du möchtest, kann du einstellen, das CouchDB direkt nach der Installation startet.

source: Verify installation settings
de: Überprüfe die Einstellungen für die Installation

source: Install CouchDB
de: Installiere CouchDB

source: `Open up Futon`_ (if you hadn't selected autostart CouchDB after installation, you have to start it first manually)
de: `Open up Futon`_ (wenn du CouchDB nach der Installation nicht automatisch gestartet hast, musst du CouchDB erst manuell starten)

source: It's time to Relax!
de: Time to Relax!

source: In some cases you might been asked to reboot Windows to complete installation process, because of using on different Microsoft Visual C++ runtimes by CouchDB.
de: Es kann vorkommen, dass du gefragt wirst, Windows neuzustarten um die Installation abzuschließen, da eine andere Microsoft Visual C++ von CouchDB benutzt wird.

source: **Upgrading note**
de: **Anmerkung zum Upgrade**

source: It's recommended to uninstall previous CouchDB version before upgrading, especially if the new one is built against different Erlang release. The reason is simple: there may be leftover libraries with alternative or incompatible versions from old Erlang release that may create conflicts, errors and weird crashes.
de: Wir empfehlen beim Upgrade einer CouchDB Version die Deinstallation von älteren CouchDB Versionen, besonders wenn die neue Version mit einer neuen Erlang-Version gebaut wurde. Der Grund dafür: es könnten Fehler, Konflikte oder Abstürze durch übrig gebliebene Libraries mit inkompatiblen Versionen aus älteren Erlang Releases verursacht werden.

source: In this case, make sure you backup of your `local.ini` config and CouchDB database/index files.
de: Stelle in diesem Fall sicher dass du ein Backup deiner `local.ini` Konfiguration und den CouchDB Datenbank- und Indexdateien hast.

source: Installation from sources
de: Kompilieren aus dem Sourcecode

source: If you're Windows geek, this section is for you!
de: Wenn du ein Windows-Geek bist, ist das hier die richtige Abteilung für dich!

source: Troubleshooting
de: Probleme & Lösungen

source: There is a `troubleshooting guide`_.
de: Es gibt einen `troubleshooting guide`_.

source: There is a `wiki`_ for general documentation.
de: Es gibt einen `wiki`_ für allgemeine Dokumentation.

source: And some `Windows-specific tips`_.
de: Und ein paar `Windows-specific tips`_.

source: There are collection of `friendly mailing lists`_.
de: Es gibt auch eine Sammlung von `friendly mailing lists`_.

source: Please work through these in order if you experience any problems.
de: Bitte gehe diese Links durch, falls du auf Probleme stößt.

source: Dependencies
de: Abhängigkeiten

source: You should have the following installed:
de: Du solltest folgendes installiert haben:

source: You will only need libcurl if you plan to run the JavaScript test suite. And help2man is only need if you plan on installing the CouchDB man pages. Python and Sphinx are only required for building the online documentation.
de: Libcurl brauchst du nur zu installieren, wenn du die JavaScript test suite laufen lassen möchtest. Die Abhängigkeit help2man brauchst du nur, falls du planst die CouchDB man pages zu installieren. Python und Sphinx werden nur für das generieren der Onlinedokumentation benötigt.

source: General Notes
de: Allgemeine Hinweise

source: When installing Cygwin, be sure to select all the `development` tools.
de: Achte darauf Cygwin mit allen `development ` tools zu installieren.

source: When installing Erlang, you must build it from source.
de: Erlang muss aus dem Quellcode gebaut werden.

source: The CouchDB build requires a number of the Erlang build scripts.
de: Der Build von CouchDB benötigt einige Erlang Build Skripte.

source: All dependent libraries should be built with the same version of Microsoft SDK.
de: Alle Libraries sollten mit dem selben Microsoft SDK gebaut werden.

source: Do not try to link against libraries built with, or included in, Cygwin or MingW. They are not compatible with the Erlang/OTP or CouchDB build scripts.
de: Linke nicht gegen Libraries die mit Cygwin oder MingW gebaut wurden oder dort enthalten sind. Sie sind nicht kompatible mit den Erlang/OTP und CouchDB Build Skripten.

source: ICU version 4.6 and later will build cleanly using MSBuild.
de: ICU in der Version 4.6 und älter können problemlos mit MSBuild gebaut werden.

source: Python and Sphinx are optional for building the online documentation. Use cygwin-provided Python and install Sphinx via easy_install or pip. Further information is here http://pypi.python.org/pypi/setuptools#id4
de: Python und Sphinx sind optional und werden für die Generierung der Onlinedokumentation benötigt. Benutze das Python aus Cygwin und installiere Sphinx mit easy_install oder pip. Weitere Informationen findet man hier: http://pypi.python.org/pypi/setuptools#id4

source: Setting Up Cygwin
de: Cygwin konfigurieren

source: Before starting any Cygwin terminals, run::
de: Before du einen Cygwin Terminal startest, führe folgendes aus::

source: To set up your environment, run::
de: Um die Umgebung einzurichten, führe folgendes aus::

source: Replace ``[VS_BIN]`` with the path to your Visual Studio `bin` directory.
de: Ersetze ``[VS_BIN]`` mit dem Pfad zu deinem Visual Studio `bin`-Verzeichnis

source: You must check that:
de: Überprüfe dass:

source: The ``which link`` command points to the Microsoft linker.
de: Der ``which link`` Befehl auf den Microsoft Linker zeigt.

source: The ``which cl`` command points to the Microsoft compiler.
de: Der ``wich cl`` Befehl auf den Microsoft compiler zeigt.

source: The ``which mc`` command points to the Microsoft message compiler.
de: Der ``which mc`` Befehl auf den Microsoft message compiler zeigt.

source: The ``which mt`` command points to the Microsoft manifest tool.
de: Der ``which mt`` Befehl auf das Microsoft manifest Werkzeug zeigt.

source: The ``which nmake`` command points to the Microsoft make tool.
de: Der Befehl ``which nmake`` auf das Microsoft make Werkzeug zeigt.

source: If you do not do this, the build may fail due to Cygwin ones found in `/usr/bin` being used instead.
de: Wenn du nicht darauf achtest, wird der Build fehlschlagen, weil die Cygwin-Versionen in `/usr/bin` stattdessen benutzt werden.

source: Building Erlang
de: Erlang bauen

source: You must include Win32 OpenSSL, built statically from source. Use exactly the same version as required by the Erlang/OTP build process.
de: Du musst die statisch vom Sourcecode gebaute Win32 OpenSSL benutzen. Benutze genau die selbe Version die vom Erlang/OTP Build Prozess benötigt wird.

source: However, you can skip the GUI tools by running::
de: Du kannst die GUI-Tools überspringen::

source: Follow the rest of the Erlang instructions as described.
de: Folge einfach der restlichen Anleitung für Erlang.

source: After running::
de: Nachdem du folgendes ausgeführt hast::

source: You should run::
de: Solltest du diesen Befehl ausführen::

source: This will set up the release/win32/bin directory correctly. The CouchDB installation scripts currently write their data directly into this location.
de: Dadurch wird das release/win32/bin Verzeichnis eingerichtet. Die CouchDB Installationsskripte schreiben ihre Daten in dieses Verzeichnis.

source: To set up your environment for building CouchDB, run::
de: Um die Umgebung einzurichten um CouchDB zu bauen, gebe folgendes ein::

source: To set up the `ERL_TOP` environment variable, run::
de: Um die `ERL_TOP` Umgebungsvariable zu setzten, führe folgenden Befehl aus::

source: Replace ``[ERL_TOP]`` with the Erlang source directory name.
de: Ersetze ``[ERL_TOP]`` mit dem Verzeichnis in dem der Erlang liegt.

source: Remember to use `/cygdrive/c/` instead of `c:/` as the directory prefix.
de: Denk dran `/cygdrive/c/` anstatt von `c:/` als Prefix für das Verzeichnis zu nutzen.

source: To set up your path, run::
de: Um deinen Path zu setzen, gebe ein::

source: If everything was successful, you should be ready to build CouchDB.
de: Wenn alles erfolgreich war, können wir CouchDB installieren.

source: Building CouchDB
de: CouchDB bauen

source: Note that `win32-curl` is only required if you wish to run the developer tests.
de: Nur wenn du die Tests für Entwickler laufen lassen möchtest, benötigst du `win32-curl`.

source: The documentation step may be skipped using ``--disable-docs`` if you wish.
de: Mit ``--disable-docs`` kannst du das Bauen der Dokumentation auslassen.

source: Once you have satisfied the dependencies you should run::
de: Sobald du alle Dependencies hast, gebe ein::

source: This command could take a while to complete.
de: Der Vorgang nachdem der Befehl eingegeben wurde dauert ein wenig.

source: If everything was successful you should see the following message::
de: Wenn alles erfolgreich war solltest du folgende Nachricht sehen::

source: To install CouchDB you should run::
de: Um CouchDB zu installieren gebe ein::

source: To build the .exe installer package, you should run::
de: Um das .exe-Installationspaket zu bauen, gebe ein::

source: Alternatively, you may run CouchDB directly from the build tree, but to avoid any contamination do not run `make dist` after this.
de: Du kannst CouchDB auch direkt aus dem Buildverzeichnis starten, aber vermeide es noch einmal `make dist` einzugeben.

source: First Run
de: Erster Start

source: You can start the CouchDB server by running::
de: Du kannst den CouchDB Server so starten::

source: When CouchDB starts it should eventually display the following message::
de: Sobald CouchDB startet solltest du folgende Nachricht sehen::

source: To check that everything has worked, point your web browser to::
de: Um zu prüfen, ob alles funktioniert hat, navigiere mit deinem Browser zu::

source: From here you should run the verification tests in Firefox.
de: Hier kannst du die Tests in Firefox ausführen.
