Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/intro/api.po
Languages: de

source: The curl command appears complex, but let's break it down. First, ``-X PUT`` tells curl to make a :method:`PUT` request. It is followed by the URL that specifies your CouchDB IP address and port. The resource part of the URL ``/albums/6e1295ed6c29495e54cc05947f18c8af`` specifies the location of a document inside our albums database. The wild collection of numbers and characters is a UUID. This UUID is your document's ID. Finally, the ``-d`` flag tells curl to use the following string as the body for the :method:`PUT` request. The string is a simple JSON structure including ``title`` and ``artist`` attributes with their respective values.
de: Das curl Kommando sieht komplex aus, weshalb wir es Schritt für Schritt durchgehen. Durch ``-X PUT`` wird curl angewiesen, einen PUT Request zu machen. Anschließend folgt die URL, welche den Hostnamen oder die IP Adresse und den Port von CouchDB enthält. Die URI ``/albums/6e1295ed6c29495e54cc05947f18c8af`` beschreibt die Position des Dokuments innerhalb der albums Datenbank. Die wilde Folge von Zahlen und Buchstaben ist eine UUID, welche die ID des Dokuments ist. Zum Schluß übegeben wir mit dem ``-d`` Parameter den Body des :method:`PUT` Requests. Der Body ist ein String, der eine einfache JSON Struktur inklusive der Attribute ``title`` und ``artist`` mit ihren jeweiligen Werten enthält.

source: If you don't have a UUID handy, you can ask CouchDB to give you one (in fact, that is what we did just now without showing you). Simply send a :get:`/_uuids` request::
de: Wenn du gerade keine UUID zur Hand hast, kannst du einfach CouchDB nach einer UUID fragen (de facto haben wir das gerade getan, ohne darauf hinzuweisen). Um eine UUID zu erzeugen sende einfach einen :get:`/_uuids` Request::

source: Voilà, a UUID. If you need more than one, you can pass in the ``?count=10`` HTTP parameter to request 10 UUIDs, or really, any number you need.
de: Voilà, eine UUID. Brauchen wir mehr als eine, so können wir zum Beispiel ``?count=10`` mit angeben, um 10 UUIDs zu erzeugen.

source: To double-check that CouchDB isn't lying about having saved your document (it usually doesn't), try to retrieve it by sending a GET request::
de: Um sicher zu gehen das CouchDB das Dokument auch wirklich gespeichert hat, versuchen wir es mit einem GET Request wieder zu laden::

source: We hope you see a pattern here. Everything in CouchDB has an address, a URI, and you use the different HTTP methods to operate on these URIs.
de: Wir hoffen, dass du ein Muster erkennst: alles in CouchDB hat eine Adresse, eine sogenannte URI und man benutzt verschiedene HTTP Methoden um auf diesen URIs Operationen auszuführen.

source: This looks a lot like the document you asked CouchDB to save, which is good. But you should notice that CouchDB added two fields to your JSON structure. The first is ``_id``, which holds the UUID we asked CouchDB to save our document under. We always know the ID of a document if it is included, which is very convenient.
de: Das sieht wie das Dokument aus, das wir zuvor gespeichert haben, allerdings mit zwei zusätzlichen Feldern, die CouchDB zu unserer JSON Struktur hinzugefügt hat. Das erste Feld ist ``_id``, welches die UUID des Dokuments enthält. Das CouchDB Dokumente ihre ID als eigenes Attribut enthalten ist sehr praktisch.

source: The second field is ``_rev``. It stands for *revision*.
de: Das zweite Feld ist ``_rev``. Es bedeutet Revision oder auf Deutsch *Version*.

source: Revisions
de: Versionen

source: If you want to change a document in CouchDB, you don't tell it to go and find a field in a specific document and insert a new value. Instead, you load the full document out of CouchDB, make your changes in the JSON structure (or object, when you are doing actual programming), and save the entire new revision (or version) of that document back into CouchDB. Each revision is identified by a new ``_rev`` value.
de: Wenn man in CouchDB ein Dokument ändern möchte, so schickt man keinen Request um ein bestimmtes Feld in einem Dokument zu finden und dessen Wert zu ändern. Stattdessen lädt man das komplette Dokument, ändert die JSON Struktur (oder das Objekt, je nachdem in welcher Umgebung man gerade arbeitet) und speichert das Dokument als neue Version wieder in CouchDB. Jede Version hat einen eigenen neuen Wert für das ``_rev`` Attribut.

source: If you want to update or delete a document, CouchDB expects you to include the ``_rev`` field of the revision you wish to change. When CouchDB accepts the change, it will generate a new revision number. This mechanism ensures that, in case somebody else made a change without you knowing before you got to request the document update, CouchDB will not accept your update because you are likely to overwrite data you didn't know existed. Or simplified: whoever saves a change to a document first, wins. Let's see what happens if we don't provide a ``_rev`` field (which is equivalent to providing a outdated value)::
de: Um ein Dokument zu aktualisieren oder zu löschen muss man das ``_rev`` Attribut mit übergeben. Damit stellt CouchDB sicher, dass sich das Dokument in der Zwischenzeit nicht geändert hat. Stimmen die Versionsnummern nicht überein, wird CouchDB die Änderung oder das Löschen des Dokuments ablehnen. Wenn CouchDB die Änderung des Dokuments akzeptiert, dann weist es ihm eine neue Versionsnummer zu. Kurz gesagt, wer zuerst speichert gewinnt. Schauen wir was passiert, wenn wir kein ``_rev`` Attribut übergeben (was das Gleiche ist wie ein veralteter Wert)::

source: If you see this, add the latest revision number of your document to the JSON structure::
de: Wenn dieser Fehler erscheint, dann muss die aktuelle Versionsnummer mit in die JSON Struktur::

source: Now you see why it was handy that CouchDB returned that ``_rev`` when we made the initial request. CouchDB replies:
de: Jetzt wird auch klar, warum CouchDB das ``_rev`` Attribut beim Anlegen des Dokuments zurückgegeben hat. CouchDB antwortet mit::

source: CouchDB accepted your write and also generated a new revision number. The revision number is the *MD5 hash* of the transport representation of a document with an ``N-`` prefix denoting the number of times a document got updated. This is useful for replication. See :ref:`replication/conflicts` for more information.
de: CouchDB hat die Änderung akzeptiert und zugleich eine neue Versionsnummer erstellt. Die Versionsnummer ist der *MD5 Hashwert* der Transport Repräsentation(bessere Übersetzung) des Dokuments und einem ``N-`` Präfix, der angibt, wie oft das Dokument bereits aktualisiert wurde. Das wird uns bei der Replikation noch helfen. Mehr Infos gibt es in :ref:`replication/conflicts`.

source: There are multiple reasons why CouchDB uses this revision system, which is also called Multi-Version Concurrency Control (`MVCC`_). They all work hand-in-hand, and this is a good opportunity to explain some of them.
de: Es gibt verschiedene Gründe, warum CouchDB dieses Versionierungsschema nutzt, dass man auch Multi-Version Concurrency Control (`MVCC`_) nennt. Sie greifen alle ineinander und jetzt ist ein guter Zeitpunkt, einige davon etwas genauer zu erklären.

source: One of the aspects of the HTTP protocol that CouchDB uses is that it is stateless. What does that mean? When talking to CouchDB you need to make requests. Making a request includes opening a network connection to CouchDB, exchanging bytes, and closing the connection. This is done every time you make a request. Other protocols allow you to open a connection, exchange bytes, keep the connection open, exchange more bytes later -- maybe depending on the bytes you exchanged at the beginning -- and eventually close the connection. Holding a connection open for later use requires the server to do extra work. One common pattern is that for the lifetime of a connection, the client has a consistent and static view of the data on the server. Managing huge amounts of parallel connections is a significant amount of work. HTTP connections are usually short-lived, and making the same guarantees is a lot easier. As a result, CouchDB can handle many more concurrent connections.
de: Einer der wichtigsten Aspekte des HTTP Protokolls, das CouchDB benutzt, ist, dass es zustandslos (stateless) ist. Was bedeutet das? Wenn man mit CouchDB spricht, so verschickt man Requests. Dazu muss man eine Netzwerkverbindung öffnen, Daten in eine oder beide Richtungen übertragen und die Verbindung wieder schließen. Jeder Request ist in sich abgeschlossen und trifft keine Annahmen darüber, in welchem Zustand sich der Server gerade befindet. Sämtliche Daten, die zur Bearbeitung des Requests benötigt werden, sind in dem Request enthalten und der Server vergisst den Request sofort nachdem er geschlossen wurde. Andere Protokolle dagegen erlauben es eine Verbindung über einen längeren Zeitraum offen zu halten, um immer mal wieder Daten auszutauschen und nicht ständig eine Verbindung auf- und abzubauen. Dabei merken sich Client und Server, welche Daten bereits über diese Verbindung verschicht wurden -- sie merken sich den Zustand der Verbindung (stateful). Wenn der Client den Zustand kennt, kann er sich anders verhalten, als wenn er das nicht weiß. Er kann zum Beispiel immer nur die Unterschiede zwischen Dokumenten verschicken oder den Modus auf dem Server ändern (z.B. "Beginne das Bearbeiten von Dokument", "Bearbeite Dokument", "Beende das Bearbeiten von Dokument"). Das bedeutet jedoch für den Server sehr viel Mehrarbeit, da er sich für jede offene Verbindung den Zustand merken muss. Zusätzlich dazu ist die Verwaltung der offenen Verbindungen zu vielen verschiedenen Clients eine signifikante Last für den Server. HTTP Verbindungen sind dagegen meist von kurzer Dauer und erlauben CouchDB so mehr parallele Requests von vielen verschiedenen Clients zu beantworten.

source: Another reason CouchDB uses MVCC is that this model is simpler conceptually and, as a consequence, easier to program. CouchDB uses less code to make this work, and less code is always good because the ratio of defects per lines of code is static.
de: Ein anderer Grund für die Benutzung von MVCC ist, dass diese Modell vom Konzept her einfacher ist und somit auch leichter zu programmieren ist. CouchDB benötigt weniger Code um das umzusetzen und weniger Code ist immer gut, da das Verhältnis von Fehlern zu Codezeilen konstant ist.

source: The revision system also has positive effects on replication and storage mechanisms, but we'll explore these later in the documents.
de: Die Versionierung von Dokumenten erleichtert auch die Replikation und die Speicherung der Dokumente in der Datenbank, doch dazu später mehr.

source: The terms *version* and *revision* might sound familiar (if you are programming without version control, stop reading this guide right now and start learning one of the popular systems). Using new versions for document changes works a lot like version control, but there's an important difference: **CouchDB does not guarantee that older versions are kept around**.
de: Der Begriff *Version* und *Revision* sollte dir bekannt vorkommen (wenn du bisher ohne Versionsverwaltung entwickelst, lege diese Anleitung sofort beiseite und lerne mit einem der gängigen Versionskontrollsysteme umzugehen). Neue Versionen von Dokumenten anzulegen ist sehr ähnlich zu Versionskontrollsystemen, doch es gibt einen entscheidenden Unterschied: **CouchDB garantiert nicht, dass alte Versionen immer verfügbar sind**.

source: Documents in Detail
de: Dokumente im Detail

source: Now let's have a closer look at our document creation requests with the curl ``-v`` flag that was helpful when we explored the database API earlier. This is also a good opportunity to create more documents that we can use in later examples.
de: Schauen wir uns den Request zum Anlegen eines Dokuments mit curl und der ``-v`` Option noch einmal genauer an. Dabei können wir auch gleich noch ein paar weitere Dokumente anlegen, die wir in späteren Beispielen benötigen werden.

source: We'll add some more of our favorite music albums. Get a fresh UUID from the ``/_uuids`` resource. If you don't remember how that works, you can look it up a few pages back.
de: Wir fügen ein paar mehr unserer Lieblingsalben in die Datenbank ein. Dazu holen wir uns eine neue UUID von der ``/_uuids`` Ressource. Falls du nicht mehr weißt, wie das geht, blättere einfach ein paar Seiten zurück.

source: By the way, if you happen to know more information about your favorite albums, don't hesitate to add more properties. And don't worry about not knowing all the information for all the albums. CouchDB's schema-less documents can contain whatever you know. After all, you should relax and not worry about data.
de: Falls du mehr Details zu deinen Lieblingsalben kennst, füge einfach weitere Attribute hinzu. Mache dir auch keine Sorgen darum, wenn du im Moment noch nicht alle Informationen über die Alben hast. Die schema-freien Dokumente von CouchDB können enthalten was auch immer man möchte. Schließlich sollst du dich entspannen und keine Sorgen um Daten machen.

source: Now with the ``-v`` option, CouchDB's reply (with only the important bits shown) looks like this::
de: Mit der ``-v`` Option sieht die Antwort von CouchDB wie folgt aus (unwichtige Details haben wir dabei ausgeblendet)::

source: We're getting back the :statuscode:`201` HTTP status code in the response headers, as we saw earlier when we created a database. The :header:`Location` header gives us a full URL to our newly created document. And there's a new header. An :header:`ETag` in HTTP-speak identifies a specific version of a resource. In this case, it identifies a specific version (the first one) of our new document. Sound familiar? Yes, conceptually, an :header:`ETag` is the same as a CouchDB document revision number, and it shouldn't come as a surprise that CouchDB uses revision numbers for ETags. ETags are useful for caching infrastructures.
de: CouchDB antwortet mit dem HTTP Status Code :statuscode:`201` Created, genauso als wenn wir eine Datenbank anlegen. Der :header:`Location` Header enthält die komplette URL zu unserem Dokument -- und dann ist da noch ein neuer Etag Header: Im HTTP Kauderwelsch ist ein :header:`ETag` eine bestimmte Version einer Ressource. In diesem Fall ist es eine bestimmte Version (die erste) unseres Dokuments. Das kommt einem irgendwie bekannt vor, oder? Ein :header:`ETag` ist vom Konzept her das Gleiche wie die Versionsnummer für CouchDB Dokumente und es ist daher auch nicht überraschend, dass CouchDB die Revisionsnummern für den Etag Header benutzt. Etags sind sinnvoll für Caching Systeme.

source: Attachments
de: Anhänge

source: CouchDB documents can have attachments just like an email message can have attachments. An attachment is identified by a name and includes its MIME type (or :header:`Content-Type`) and the number of bytes the attachment contains. Attachments can be any data. It is easiest to think about attachments as files attached to a document. These files can be text, images, Word documents, music, or movie files. Let's make one.
de: CouchDB Dokumente können Anhänge haben genau wie eine E-Mail Anhänge haben kann. Ein Anhang wird durch einen Namen und einen MIME Type (oder :header:`Content-Type`) sowie die Größe des Anhangs in Bytes beschrieben. Anhänge können beliebige Daten enthalten. Am einfachsten stellt man sich Anhänge als Dateien vor, die zu dem Dokument gehören. Das können Texte oder Bilder sein, Word Dokumente, Musik, Filme, etc. Legen wir mal einen an.

source: Attachments get their own URL where you can upload data. Say we want to add the album artwork to the ``6e1295ed6c29495e54cc05947f18c8af`` document (*"There is Nothing Left to Lose"*), and let's also say the artwork is in a file artwork `.jpg` in the current directory::
de: Anhänge bekommen eine eigene URL wenn man sie hochlädt. Angenommen wir möchten das Album Cover zu dem Dokument mit der ID ``6e1295ed6c29495e54cc05947f18c8af`` (*"There is Nothing Left to Lose"*) hinzufügen und das Cover Bild ist in der Datei `artwork.jpg` in dem aktuellen Verzeichnis, in dem wir uns befinden::

source: The ``--data-binary`` ``@`` option tells curl to read a file's contents into the HTTP request body. We're using the ``-H`` option to tell CouchDB that we're uploading a JPEG file. CouchDB will keep this information around and will send the appropriate header when requesting this attachment; in case of an image like this, a browser will render the image instead of offering you the data for download. This will come in handy later. Note that you need to provide the current revision number of the document you're attaching the artwork to, just as if you would update the document. Because, after all, attaching some data is changing the document.
de: Mit der ``--data-binary`` ``@`` Option sagen wir curl den Inhalt einer Datei im HTTP Request Body zu verschicken. Mit der ``-H`` Option sagen wir CouchDB, dass wir ein JPEG hochladen. CouchDB merkt sich das und wird entsprechende Header in die Antwort schreiben, wenn der Anhang wieder gelesen wird. Im Falle dieses Bildes wird der Browser das Bild anzeigen anstatt anzubieten, die Datei zu speichern. Das wird später noch nützlich sein. Achte darauf, dass wir die aktuelle Versionsnummer zum Request hinzugefügt haben, genauso als wenn wir das Dokument selber aktualisieren würden. Letztendlich ändert das Hinzufügen eines Anhangs das Dokument.

source: You should now see your artwork image if you point your browser to http://127.0.0.1:5984/albums/6e1295ed6c29495e54cc05947f18c8af/artwork.jpg
de: Wenn du mit deinem Browser auf http://127.0.0.1:5984/albums/6e1295ed6c29495e54cc05947f18c8af/artwork.jpg gehst, sollte das Bild angezeigt werden.

source: If you request the document again, you'll see a new member::
de: Wenn man das Dokument wieder abruft, enthält es ein neues Attribut::

source: ``_attachments`` is a list of keys and values where the values are JSON objects containing the attachment metadata. ``stub=true`` tells us that this entry is just the metadata. If we use the ``?attachments=true`` HTTP option when requesting this document, we'd get a `Base64`_ encoded string containing the attachment data.
de: Das ``_attachments`` Attribut ist eine Liste von Key/Value Paaren, deren Werte JSON Objekte mit den Metadaten der Anhänge sind. ``stub=true`` sagt uns, dass der Eintrag nur aus Metadaten besteht. Fügen wir dem HTTP Request ``?attachments=true`` hinzu, so bekommen wir einen `Base64`_ kodierten String mit den Daten des Anhangs.

source: We'll have a look at more document request options later as we explore more features of CouchDB, such as replication, which is the next topic.
de: Wir werden später noch weitere Requests für Dokumente sehen, wenn wir uns weitere Funktionen von CouchDB näher ansehen. Wie beispielsweise die Replikation, die unser nächstes Thema ist.

source: Replication
de: Replikation

source: CouchDB replication is a mechanism to synchronize databases. Much like `rsync`_ synchronizes two directories locally or over a network, replication synchronizes two databases locally or remotely.
de: Die Replikation in CouchDB ist ein Mechanismus, um Datenbanken zu synchronisieren. Ähnlich wie mit `rsync`_ zwei Verzeichnisse lokal oder über ein Netzwerk synchronisiert werden können, synchronisiert die Replikation in CouchDB zwei Datenbanken entweder lokal oder über ein Netzwerk.

source: In a simple :method:`POST` request, you tell CouchDB the *source* and the *target* of a replication and CouchDB will figure out which documents and new document revisions are on *source* that are not yet on *target*, and will proceed to move the missing documents and revisions over.
de: Mit einem einfachen :method:`POST` Request teilt man CouchDB die *Quelle* (source) und das *Ziel* (target) der Replikation mit. CouchDB findet anschließend heraus, welche Dokumente und neue Versionen von Dokumenten in der Quelldatenbank existieren, aber nicht in der Zieldatenbank vorhanden sind und wird beginnen, die fehlenden Dokumente und Versionen zu kopieren.

source: We'll take an in-depth look at replication in the document :ref:`replication/intro`; in this document, we'll just show you how to use it.
de: Wir gehen auf die Replikation in :ref:`replication/intro` noch genauer ein. In diesem Kapitel zeigen wir lediglich, wie man sie benutzt.

source: First, we'll create a target database. Note that CouchDB won't automatically create a target database for you, and will return a replication failure if the target doesn't exist (likewise for the source, but that mistake isn't as easy to make)::
de: Zunächst erzeugt man eine Zieldatenbank. Beachte, dass CouchDB nicht automatisch eine Zieldatenbank für uns anlegt und einen Fehler meldet, wenn das Ziel nicht existiert. (Das gleiche gilt auch für die Quelle, aber diesen Fehler zu machen ist nicht ganz so einfach)::

source: Now we can use the database `albums-replica` as a replication target::
de: Ab jetzt können wir die Datenbank `albums-replica` als Ziel einer Replikation benutzen::

source: CouchDB supports the option ``"create_target":true`` placed in the JSON POSTed to the :ref:`_replicate <api/server/replicate>` URL. It implicitly creates the target database if it doesn't exist.
de: Wenn wir ``"create_target":true`` im JSON von unserem POST Request an :ref:`_replicate <api/server/replicate>` mitsenden wird CouchDB die Zieldatenbank erzeugen, falls sie noch nicht existiert.

source: CouchDB replies (this time we formatted the output so you can read it more easily):
de: CouchDB antwortet mit (diesmal haben wir die Ausgabe formatiert, sodass man sie besser lesen kann):

source: CouchDB maintains a *session history* of replications. The response for a replication request contains the history entry for this *replication session*. It is also worth noting that the request for replication will stay open until replication closes. If you have a lot of documents, it'll take a while until they are all replicated and you won't get back the replication response until all documents are replicated. It is important to note that replication replicates the database only as it was at the point in time when replication was started. So, any additions, modifications, or deletions subsequent to the start of replication will not be replicated.
de: CouchDB verwaltet eine *Session Historie* der Replikationen. Die Antwort auf einen Replication Request enthält die Historie dieser *Replikationssession*. Zu beachten ist, dass der Request für die Replikation erst beantwortet wird, wenn die Replikation abgeschlossen ist. Bis dahin bleibt die Verbindung offen. Wenn Ihre Datenbank viele Dokumente hat, wird es eine Weile dauern, bis alle kopiert wurden und du erhälst keine Antwort, bis dieser Vorgang vollständig abgeschlossen ist. Des weiteren ist es wichtig zu wissen, dass die Datenbank nur bis zu dem Punkt repliziert wird, an dem sie zu Beginn der Replikation war. Alle Veränderungen, die nach Beginn der Replikation erfolgen, werden nicht mit repliziert.

source: We'll punt on the details again -- the ``"ok": true`` at the end tells us all went well. If you now have a look at the albums-replica database, you should see all the documents that you created in the albums database. Neat, eh?
de: Wir überspringen die Details noch einmal, denn ``"ok": true`` am Ende sagt uns, das die Replikation erfolgreich war. Wenn man anschließend auf die albums-replica Datenbank schaut, sollten alle Dokumente, die in der albums Datenbank vorhanden sind ebenfalls vorhanden sein. Nett, oder?
