Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/intro/api.po
Languages: de

source: What you just did is called local replication in CouchDB terms. You created a local copy of a database. This is useful for backups or to keep snapshots of a specific state of your data around for later. You might want to do this if you are developing your applications but want to be able to roll back to a stable version of your code and data.
de: Was wir gerade gemacht haben nennt man in CouchDB eine lokale Replikation. Wir haben eine lokale Kopie einer Datenbank angelegt. Das ist hilfreich für Backups oder um Snapshots von bestimmten Zuständen der Datenbank für später aufzuheben. Es kann auch während der Entwicklung von Anwendungen nützlich sein, um gegebenenfalls einen Rollback auf eine stabile Version von Code und Daten durchzuführen.

source: There are more types of replication useful in other situations. The source and target members of our replication request are actually links (like in HTML) and so far we've seen links relative to the server we're working on (hence local). You can also specify a remote database as the target::
de: Es gibt noch weitere Arten der Replikation, die in anderen Situationen sinnvoll sind. Die source und target Parameter in unserem Replikationsrequest sind Links (genau wie in HTML) und bis jetzt haben wir nur relative Links verwendet, die relativ zu dem Server sind, auf dem wir gerade arbeiten (deshalb auch lokale Replikation). Man kann aber auch eine entfernte Datenbank als Ziel angeben::

source: Using a *local source* and a *remote target* database is called *push replication*. We're pushing changes to a remote server.
de: Verwendet man eine lokale Datenbank als *source* und eine entfernte Datenbank als *target*, dann nennt man das *Push Replikation*, weil die Änderungen auf den entfernten Server geschoben werden.

source: Since we don't have a second CouchDB server around just yet, we'll just use the absolute address of our single server, but you should be able to infer from this that you can put any remote server in there.
de: Da wir im Moment keinen zweiten CouchDB Server zur Verfügung haben, nutzen wir für die Beispiele die absolute Adresse unseres Servers, aber es sollte klar sein, dass wir hier jeden beliebigen entfernten CouchDB Server nutzen könnten.

source: This is great for sharing local changes with remote servers or buddies next door.
de: Das ist sehr praktisch um lokale Änderungen mit entfernten Servern zu teilen -- und sei es auch nur mit dem des Kumpels von nebenan.

source: You can also use a *remote source* and a *local target* to do a *pull replication*. This is great for getting the latest changes from a server that is used by others::
de: Eine weitere Form der Replikation ist eine *entfernte source* und ein *lokales target*. In dem Fall führt man eine *Pull Replikation* durch. Damit lassen sich gut die Änderungen eines entfernten Server, der von anderen gepflegt wird, auf den eigenen Server kopieren::

source: Finally, you can run remote replication, which is mostly useful for management operations::
de: Letztendlich kann man auch noch eine Remote Replikation starten, die hauptsächlich für Management Aufgaben eingesetzt wird::

source: **CouchDB and REST**
de: **CouchDB und REST**

source: CouchDB prides itself on having a `RESTful`_ API, but these replication requests don't look very RESTy to the trained eye. What's up with that? While CouchDB's core database, document, and attachment API are RESTful, not all of CouchDB's API is. The replication API is one example. There are more, as we'll see later in the documents.
de: CouchDB ist stolz darauf, ein `RESTful`_ API zu haben, doch diese Replikations Requests sehen für REST Profis nicht sehr REST-mäßig aus. Warum ist das so? Obwohl das Core API für Datenbanken, Dokumente und Anhänge RESTful ist, so gilt das nicht für alle Bereiche des CouchDB APIs. Das API für die Replikation ist ein Beispiel und wir werden später noch weitere in den Dokumenten sehen.

source: Why are there RESTful and non-RESTful APIs mixed up here? Have the developers been too lazy to go REST all the way? Remember, REST is an architectural style that lends itself to certain architectures (such as the CouchDB document API). But it is not a one-size-fits-all. Triggering an event like replication does not make a whole lot of sense in the REST world. It is more like a traditional remote procedure call. And there is nothing wrong with this.
de: Warum existieren RESTful und nicht RESTful APIs nebeneinander? Waren die Entwickler zu faul REST wirklich konsequent umzusetzen? REST ist ein Architektur Stil, der zu bestimmten Architekturen führt, wie zum Beispiel dem CouchDB API für Dokumente. Doch es ist keine eierlegende Wollmilchsau. Das Auslösen eines Events ergibt unter REST wenig Sinn, denn es ist viel eher ein traditioneller Remote Procedure Call -- und ist nichts Schlimmes dran.

source: We very much believe in the "use the right tool for the job" philosophy, and REST does not fit every job. For support, we refer to Leonard Richardson and Sam Ruby who wrote `RESTful Web Services`_ (O'Reilly), as they share our view.
de: Wir glauben das es wichtig ist, das richtige Werkzeug für den Job einzusetzen und REST ist kein Werkzeug für jeden Job. Zur Unterstützung möchten wir an dieser Stelle Leonard Richardson und Sam Ruby zitieren, die `RESTful Web Services`_ (O'Reilly) geschrieben haben und unsere Ansichten teilen.

source: Wrapping Up
de: Zusammenfassung

source: This is still not the full CouchDB API, but we discussed the essentials in great detail. We're going to fill in the blanks as we go. For now, we believe you're ready to start building CouchDB applications.
de: Wir haben immer noch nicht das vollständige CouchDB API vorgestellt, sind jedoch einen Schritt weiter gekommen und tief in die Details eingestiegen. Die Lücken werden wir später füllen. Im Moment solltest Du soweit gerüstet sein, dass Du anfangen kannst, mit CouchDB Anwendungen zu schreiben.

source: :ref:`Complete HTTP API Reference <api>`:
de: :ref:`Vollständige HTTP API Reference <api>`:

source: :ref:`Document API Reference <api/document>`
de: :ref:`Document API Referenz <api/document>`

source: :ref:`Replication API <api/server/replicate>`
de: :ref:`Replikations API <api/server/replicate>`
