Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/intro/api.po
Languages: de

source: The Core API
de: Das Core API

source: This document explores the CouchDB in minute detail. It shows all the nitty-gritty and clever bits. We show you best practices and guide you around common pitfalls.
de: In diesem Kaptiel nehmen wir CouchDB genau unter die Lupe. Wir gehen richtig auf die Details ein und zeigen knifflige Sachen. Wir erklären die Best Practices und helfen die üblichen Stolperfallen zu umgehen.

source: We start out by revisiting the basic operations we ran in the previous document :ref:`intro/tour`, looking behind the scenes. We also show what Futon needs to do behind its user interface to give us the nice features we saw earlier.
de: Zu Beginn gehen wir noch einmal die Grundoperationen durch, die wir bereits im vorherigen Dokument :ref:`intro/tour` vorgestellt haben und schauen anschließend unter die Haube. Wir zeigen auch, was Futon hinter der Benutzerschnittstelle machen muss, um die vielen Funktionen zu haben, die wir zuvor gesehen haben.

source: This document is both an introduction to the core CouchDB API as well as a reference. If you can't remember how to run a particular request or why some parameters are needed, you can always come back here and look things up (we are probably the heaviest users of this document).
de: Dieses Kapitel ist zugleich eine Einführung in die Core API von CouchDB und eine Referenz. Wenn du dich nicht mehr erinnern kannst, wie ein bestimmter Request funktioniert oder warum bestimmte Parameter benötigt werden, kannst du jederzeit hierhin zurückkehren und nachschlagen. Von allen Kapiteln nutzen wir dieses wahrscheinlich am häufigsten.

source: While explaining the API bits and pieces, we sometimes need to take a larger detour to explain the reasoning for a particular request. This is a good opportunity for us to tell you why CouchDB works the way it does.
de: Während wir die API genauer erklären, müssen wir manchmal etwas weiter ausholen, um die Motivation hinter einem Request zu erklären. Dabei können wir gleich erklären, warum CouchDB so funktioniert wie es funktioniert.

source: The API can be subdivided into the following sections. We'll explore them individually:
de: Die API kann man in folgende Bereiche aufteilen, die wir nacheinander besprechen werden:

source: This one is basic and simple. It can serve as a sanity check to see if CouchDB is running at all. It can also act as a safety guard for libraries that require a certain version of CouchDB. We're using the `curl`_ utility again::
de: Der erste Request ist simpel. Man benutzt ihn um zu sehen ob CouchDB überhaupt läuft. Setzt eine externe Bibliothek eine bestimmte Version voraus, kann sie mit diesem Request prüfen, ob diese Bedingung erfüllt ist. Wir nutzen wieder `curl`_ um mit CouchDB zu sprechen::

source: CouchDB replies, all excited to get going:
de: Voller Erwartung antwortet CouchDB mit:

source: You get back a JSON string, that, if parsed into a native object or data structure of your programming language, gives you access to the welcome string and version information.
de: Zurück kommt ein JSON String, der einen Willkommensgruß und die Version von CouchDB enthält.

source: This is not terribly useful, but it illustrates nicely the way CouchDB behaves. You send an HTTP request and you receive a JSON string in the HTTP response as a result.
de: Damit kann man zwar nicht viel anfangen, allerdings zeigt es, wie sich CouchDB verhält. Man schickt einen HTTP Request und bekommt einen JSON String als HTTP Response.

source: Databases
de: Datenbanken

source: Now let's do something a little more useful: *create databases*. For the strict, CouchDB is a *database management system* (DMS). That means it can hold multiple databases. A database is a bucket that holds "related data". We'll explore later what that means exactly. In practice, the terminology is overlapping -- often people refer to a DMS as "a database" and also a database within the DMS as "a database." We might follow that slight oddity, so don't get confused by it. In general, it should be clear from the context if we are talking about the whole of CouchDB or a single database within CouchDB.
de: Machen wir etwas Sinnvolleres: Legen wir eine Datenbank an. Wenn man es genau nimmt, ist CouchDB ein *Datenbank Management System* (DBMS), weil es mehrere Datenbanken enthalten kann. Eine Datenbank ist ein Behälter, der "zusammenhängende Daten" enthält. Wir werden später sehen was das genau bedeutet. Meist verschwimmen die Begriffe etwas und "die Datenbank" sind dann zugleich das DBMS und die Datenbank darin. Wir nehmen es auch nicht so genau, denn aus dem Kontext geht meist hervor, ob CouchDB als Ganzes oder eine Datenbank darin gemeint ist.

source: Now let's make one! We want to store our favorite music albums, and we creatively give our database the name albums. Note that we're now using the ``-X`` option again to tell curl to send a :method:`PUT` request instead of the default :method:`GET` request::
de: Legen wir die Datenbank nun an - zum Beispiel um unsere Lieblingsalben zu speichern. Sinnigerweise nennen wir die Datenbank albums. Datenbanken werden in CouchDB mit einem :method:`PUT` Request angelegt. Deshalb nehmen wir bei curl die ``-X`` Option. Andernfalls würde curl einen :method:`GET` Request schicken::

source: CouchDB replies:
de: CouchDB antwortet mit:

source: That's it. You created a database and CouchDB told you that all went well. What happens if you try to create a database that already exists? Let's try to create that database again::
de: Das war's. Wir haben eine Datenbank angelegt und CouchDB sagt, das alles funktioniert hat. Was passiert, wenn man versucht eine Datenbank anzulegen, die bereits existiert sehen wir, wenn wir versuchen, die gleiche Datenbank noch einmal anzulegen::

source: We get back an error. This is pretty convenient. We also learn a little bit about how CouchDB works. CouchDB stores each database in a single file. Very simple.
de: CouchDB antwortet mit einem Fehler, was sehr praktisch ist. Zugleich lernen wir wieder ein wenig mehr darüber, wie CouchDB arbeitet. CouchDB speichert jede Datenbank in einer eigenen Datei. Ganz einfach.

source: Let's create another database, this time with curl's ``-v`` (for "verbose") option. The verbose option tells curl to show us not only the essentials -- the HTTP response body -- but all the underlying request and response details::
de: Legen wir noch eine Datenbank an - diesmal mit der ``-v`` Option (für „verbose“) von curl. Mit dieser Option zeigt curl nicht nur die wesentlichen Teile -- den HTTP Response Body -- sondern alle Bestandteile des Requests an.

source: curl elaborates::
de: curl zeigt::

source: What a mouthful. Let's step through this line by line to understand what's going on and find out what's important. Once you've seen this output a few times, you'll be able to spot the important bits more easily.
de: Wupps, das ist doch einiges mehr als ohne -v. Gehen wir der Reihe nach durch die einzelnen Zeilen, um zu verstehen, was genau passiert ist und was wichtig ist. Wenn man diese Ausgabe ein paarmal gesehen hat, weiß man worauf man achten muss und sieht die wichtigen Teile sofort.

source: This is curl telling us that it is going to establish a TCP connection to the CouchDB server we specified in our request URI. Not at all important, except when debugging networking issues.
de: Damit sagt curl uns, dass es eine TCP Verbindung zu dem CouchDB Server aufbauen wird, den wir in dem Request URL angegeben haben. Das ist meist nicht besonders wichtig, außer man sucht gerade einen Fehler im Netzwerk.

source: curl tells us it successfully connected to CouchDB. Again, not important if you aren't trying to find problems with your network.
de: curl sagt uns mit diesen Zeilen, dass es sich erfolgreich mit CouchDB verbunden hat. Wieder nicht besonders wichtig, außer man kämpft mit Netzwerkfehlern.

source: The following lines are prefixed with ``>`` and ``<`` characters. The ``>`` means the line was sent to CouchDB verbatim (without the actual ``>``). The ``<`` means the line was sent back to curl by CouchDB.
de: Die folgenden Zeilen beginnen jeweils mit den Zeichen ``>`` und ``<``. Steht am Anfang ein ``>`` bedeutet das, dass diese Zeile exakt so an CouchDB geschickt wurde (ohne das ``>``). Ein ``<`` am Anfang bedeutet, dass diese Zeile genau so von CouchDB zurück an curl geschickt wurde.

source: This initiates an HTTP request. Its *method* is :method:`PUT`, the *URI* is ``/albums-backup``, and the HTTP version is ``HTTP/1.1``. There is also ``HTTP/1.0``, which is simpler in some cases, but for all practical reasons you should be using ``HTTP/1.1``.
de: Dies initiiert einen HTTP-request. Die *Methode* ist :method:`PUT`, die *URI* ist ``/albums-backup`` und die HTTP Version ist ``HTTP/1.1``. Es gibt auch das ``HTTP/1.0`` Protokoll welches in einigen Fällen einfacher ist, aber für alle praktischen Fälle solltest Du das ``HTTP/1.1`` Protokoll nutzen.

source: Next, we see a number of *request headers*. These are used to provide additional details about the request to CouchDB.
de: Als nächstes betrachten wir einige *Request-header*. Diese werden genutzt um CouchDB zusätzliche Details des Requests zur Verfügung zu stellen.

source: The User-Agent header tells CouchDB which piece of client software is doing the HTTP request. We don't learn anything new: it's curl. This header is often useful in web development when there are known errors in client implementations that a server might want to prepare the response for. It also helps to determine which platform a user is on. This information can be used for technical and statistical reasons. For CouchDB, the :header:`User-Agent` header is irrelevant.
de: Der User-Agent Header teilt CouchDB mit, welche "Client-Software" den HTTP-Request ausführt. Hier erfahren wir nichts neues: es ist cUrl. Dieser Header ist in der Web-Entwicklung oft nützlich, wenn es bekannte Fehler in Client-Implementierungen gibt und der Server entsprechende Responses vorbereiten soll. Es hilft auch dabei herauszufinden, welche Platform ein Benutzer nutzt. Diese Information kann sowohl für technische als auch für statistische Zwecke genutzt werden. Für CouchDB ist der Header :header:`User-Agent` allerdings irrelevant.

source: The :header:`Host` header is required by ``HTTP 1.1``. It tells the server the hostname that came with the request.
de: Der Header :header:`Host` ist für ``HTTP 1.1`` erforderlich. Er teilt dem Server den Hostname mit, von welchem der Request gesendet wurde.

source: The :header:`Accept` header tells CouchDB that curl accepts any media type. We'll look into why this is useful a little later.
de: Der header :header:`Accept` teilt CouchDB mit, das cUrl jeglichen Medientyp akzeptiert. Warum dies nützlich ist, werden wir uns später ansehen.

source: An empty line denotes that the request headers are now finished and the rest of the request contains data we're sending to the server. In this case, we're not sending any data, so the rest of the curl output is dedicated to the HTTP response.
de: Eine Leerzeile dient zur Kennzeichnung, dass die Header nun beendet sind und der Rest des Request Daten enthält, die wir an den Server senden. In diesem Fall senden wir keine Daten, so dass sich die restliche Ausgabe von cUrl auf die HTTP-Response bezieht.

source: The first line of CouchDB's HTTP response includes the HTTP version information (again, to acknowledge that the requested version could be processed), an HTTP *status code*, and a *status code message*. Different requests trigger different response codes. There's a whole range of them telling the client (curl in our case) what effect the request had on the server. Or, if an error occurred, what kind of error. :rfc:`2616` (the HTTP 1.1 specification) defines clear behavior for response codes. CouchDB fully follows the RFC.
de: Die erste Zeile der HTTP-Response von CouchDB beinhaltet die HTTP-Versions-Information (nochmals um zu bestätigen, dass die angefragte Version verarbeitet werden konnte), einen *HTTP-Status-Code* und eine *Status-Code-Message*. Unterschiedliche Requests lösen unterschiedliche Response-Codes aus. Es gibt eine größere Anzahl dieser Codes um dem Client (in unserem Fall cUrl) mitzuteilen, welche Auswirkungen der Request auf dem Server hatte. Oder wenn ein Fehler aufgetreten ist, welche Art Fehler. :rfc:`2616` (die HTTP 1.1 Spezifikation) definiert eindeutige Verhaltensweisen für Response-Codes. CouchDB folgt dem RFC in Gänze.

source: The :statuscode:`201` status code tells the client that the resource the request was made against was successfully created. No surprise here, but if you remember that we got an error message when we tried to create this database twice, you now know that this response could include a different response code. Acting upon responses based on response codes is a common practice. For example, all response codes of :statuscode:`400` or larger tell you that some error occurred. If you want to shortcut your logic and immediately deal with the error, you could just check a >= ``400`` response code.
de: Der Status-Code :statuscode:`201` teilt dem Client mit, dass die Ressource für die der Request ausgeführt wurde erfolgreich erstellt wurde. Das ist hier keine Überraschung, aber wenn Du Dich daran erinnerst, dass wir eine Fehlermeldung erhalten haben, als wir versucht haben diese Datenbank zweimal zu erstellen, weisst Du jetzt, dass diese Antwort einen anderen Response-Code enthalten könnte. Das Verhalten auf Grundlage von Response-Codes zu steuern ist gängige Praxis. Z.B. sagen Dir alle Response-Codes ab :statuscode:`400` oder höher, dass ein Fehler aufgetreten ist. Wenn Deine Logik verkürzen willst und sofort einen auftretenden Fehler behandeln willst, könntest Du einfach nach einem Response-Code >= ``400`` prüfen.

source: The :header:`Server` header is good for diagnostics. It tells us which CouchDB version and which underlying Erlang version we are talking to. In general, you can ignore this header, but it is good to know it's there if you need it.
de: Der :header:`Server` Header eignet sich gut zur Diagnose. Er enthält die CouchDB Version und die Version des zugrundeliegenden Erlang Systems. Meist kann man diesen Header ignorieren, doch es ist gut zu wissen, dass er da ist, falls man ihn braucht.

source: The :header:`Date` header tells you the time of the server. Since client and server time are not necessarily synchronized, this header is purely informational. You shouldn't build any critical application logic on top of this!
de: In dem :header:`Datum` Header teilt uns CouchDB die Uhrzeit auf dem Server mit. Da die Zeit auf dem Client und Server nicht unbedingt synchronisiert sind, ist dieser Header eine reine Information. Unter keinen Umständen sollte man sich in einer Anwendung auf eine Wert dieses Header verlassen.

source: The :header:`Content-Type` header tells you which MIME type the HTTP response body is and its encoding. We already know CouchDB returns JSON strings. The appropriate :header:`Content-Type` header is :mimetype:`application/json`. Why do we see :mimetype:`text/plain`? This is where pragmatism wins over purity. Sending an :mimetype:`application/json` :header:`Content-Type` header will make a browser offer you the returned JSON for download instead of just displaying it. Since it is extremely useful to be able to test CouchDB from a browser, CouchDB sends a :mimetype:`text/plain` content type, so all browsers will display the JSON as text.
de: Der :header:`Content-Type` Header zeigt an, welche Art von Daten der HTTP Response Body enthält und wie diese codiert sind. Die Art der Daten steht im MIME Type und die Codierung im charset Parameter. Wir wissen bereits, das CouchDB JSON Strings zurückliefert. Der passende :header:`Content-Type` Header wäre also :mimetype:`application/json`. Warum schickt CouchDB dann :mimetype:`text/plain`? An dieser Stelle ist Pragmatismus wichtiger als Purismus. Schickt man :mimetype:`application/json` als :header:`Content-Type` Header, so wird jeder Browser versuchen den JSON String als Datei zu speichern anstatt ihn einfach anzuzeigen. Da es jedoch sehr praktisch ist CouchDB von einem Webbrowser aus zu testen, schickt CouchDB als Content Type :mimetype:`text/plain`, so dass alle Browser den JSON String einfach anzeigen.

source: There are some extensions that make your browser JSON-aware, but they are not installed by default. For more information, look at the popular `JSONView`_ extension, available for both Firefox and Chrome.
de: Es gibt Erweiterungen für Webbrowser, mit denen der Browser JSON korrekt erkennt und entsprechend behandelt. Allerdings werden diese standardmäßig nicht installiert. Eine bekannte Erweiterung ist die `JSONView`_ Erweiterung für Chrome und Firefox.

source: Do you remember the :header:`Accept` request header and how it is set to ``\*/\* -> */*`` to express interest in any MIME type? If you send ``Accept: application/json`` in your request, CouchDB knows that you can deal with a pure JSON response with the proper :header:`Content-Type` header and will use it instead of :mimetype:`text/plain`.
de: Erinnerst du dich noch an den :header:`Accept` Header im HTTP Request und wie er zu ``\*/\* -> */*`` gesetzt wurde, um damit zu zeigen, dass der Client jeden MIME Type akzeptiert? Schickt ein Client im Request Accept: ``Accept: application/json``, so weiß CouchDB, dass der Client korrekt mit JSON Strings und dem Content-Type: :mimetype:`application/json` Header umgehen kann und wird diesen verwenden anstelle von :mimetype:`text/plain`.

source: The :header:`Content-Length` header simply tells us how many bytes the response body has.
de: Der :header:`Content-Length` Header informiert uns darüber, wie viele Bytes der Response Body der Antwort hat.

source: This :header:`Cache-Control` header tells you, or any proxy server between CouchDB and you, not to cache this response.
de: Dieser :header:`Cache-Control` Header sorgt dafür, dass wir - oder Proxy-Server zwischen der CouchDB und uns - die Antwort nicht cachen.

source: This empty line tells us we're done with the response headers and what follows now is the response body.
de: Diese leere Zeile zeigt uns, dass keine weiteren Response Header folgen und dass der Rest der Response Body ist.

source: We've seen this before.
de: Das haben wir schon mal gesehen.

source: The last two lines are curl telling us that it kept the TCP connection it opened in the beginning open for a moment, but then closed it after it received the entire response.
de: Mit den letzen beiden Zeilen zeigt curl an, dass es die TCP Verbindung noch einen Moment offen gehalten hat, um sie dann nach Erhalt des vollständigen Response Bodys zu schließen.

source: Throughout the documents, we'll show more requests with the ``-v`` option, but we'll omit some of the headers we've seen here and include only those that are important for the particular request.
de: Wir werden später immer wieder Requests mit der ``-v`` Option zeigen, aber bestimmte Header, die wir hier gezeigt haben, weglassen und nur die wichtigen für den jeweiligen Request anzeigen.

source: Creating databases is all fine, but how do we get rid of one? Easy -- just change the HTTP method::
de: Datenbanken anzulegen ist schön und gut, aber wie löschen wir eine? Ganz einfach -- Man ändert einfach die HTTP Methode::

source: This deletes a CouchDB database. The request will remove the file that the database contents are stored in. There is no *"Are you sure?"* safety net or any *"Empty the trash"* magic you've got to do to delete a database. Use this command with care. Your data will be deleted without a chance to bring it back easily if you don't have a backup copy.
de: Damit löscht man eine CouchDB Datenbank. Der Request wird die Datei, in der die Datenbank gespeichert ist, sofort löschen. Es gibt keine *"Sind Sie sicher?"* Frage oder eine *"Papierkorb-Logik"* wenn wir eine Datenbank löschen. Das liegt in deiner Verantwortung und die Daten werden umgehend - und wenn du kein Backup hast - ohne eine Chance sie wieder zurück zu holen gelöscht.

source: This section went knee-deep into HTTP and set the stage for discussing the rest of the core CouchDB API. Next stop: documents.
de: In diesem Abschnitt sind wir tief in HTTP eingestiegen und haben damit die Grundlage geschaffen um den Rest des Core APIs von CouchDB zu erklären. Nächste Haltestelle: Dokumente.

source: Documents
de: Dokumente

source: Documents are CouchDB's central data structure. The idea behind a document is, unsurprisingly, that of a real-world document -- a sheet of paper such as an invoice, a recipe, or a business card. We already learned that CouchDB uses the JSON format to store documents. Let's see how this storing works at the lowest level.
de: Dokumente sind die zentrale Datenstruktur von CouchDB und die Idee dahinter ist die von realen Dokumenten auf Papier, wie eine Rechnung, ein Rezept oder eine Visitenkarte. Wir wissen bereits, dass CouchDB Dokumente im JSON Format speichert. Schauen wir wie die Speicherung auf der untersten Ebene funktioniert.

source: Each document in CouchDB has an *ID*. This ID is unique per database. You are free to choose any string to be the ID, but for best results we recommend a `UUID`_ (or `GUID`_), i.e., a Universally (or Globally) Unique IDentifier. UUIDs are random numbers that have such a low collision probability that everybody can make thousands of UUIDs a minute for millions of years without ever creating a duplicate. This is a great way to ensure two independent people cannot create two different documents with the same ID. Why should you care what somebody else is doing? For one, that somebody else could be you at a later time or on a different computer; secondly, CouchDB replication lets you share documents with others and using UUIDs ensures that it all works. But more on that later; let's make some documents::
de: In CouchDB hat jedes Dokument eine *ID*, die innerhalb der jeweiligen Datenbank eindeutig ist. Du kannst jeden beliebigen String als ID nehmen, wir empfehlen jedoch `UUID`_ (or `GUID`_) - Universally (bzw. Globally) Unique Identifiers. UUIDs sind Zufallszahlen, die so eine geringe Kollisionswahrscheinlichkeit haben, dass man Tausende UUIDs pro Minute für Millionen von Jahren erzeugen kann, ohne jemals eine doppelt anzulegen. Damit kann man sicherzustellen, dass zwei Menschen, die unabhängig voneinander arbeiten, nicht verschiedene Dokumente mit der gleichen ID anlegen können. Doch warum sollte es einen überhaupt kümmern was andere Leute tun? Zum einen könntest du selbst diese andere Person sein - zu einem späteren Zeitpunkt oder an einem anderen Computer. Zum anderen kann man mithilfe der Replikation Dokumente mit anderen teilen und mit UUIDs stellt man sicher, dass alles funktioniert. Wir gehen später noch einmal genauer darauf ein. Zuerst legen wir ein paar Dokumente an::
