Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/intro/consistency.po
Languages: de

source: Eventual Consistency
de: Eventual Consistency - Irgendwann konsistent

source: In the previous document :ref:`intro/why`, we saw that CouchDB's flexibility allows us to evolve our data as our applications grow and change. In this topic, we'll explore how working "with the grain" of CouchDB promotes simplicity in our applications and helps us naturally build scalable, distributed systems.
de: Im vorherigen Dokument :ref:`intro/why` haben wir gezeigt, dass die Flexibilität von CouchDB es erlaubt, die Daten weiter zu entwickeln, während Anwendungen wachsen und sich ändern. In diesem Abschnitt werden wir untersuchen, wie das Arbeiten mit CouchDB (anstatt gegen CouchDB) Einfachheit in den Anwendungen fördert und natürlich zu skalierbaren, verteilten Systemen führt.

source: Working with the Grain
de: Mit CouchDB arbeiten

source: A *distributed system* is a system that operates robustly over a wide network. A particular feature of network computing is that network links can potentially disappear, and there are plenty of strategies for managing this type of network segmentation. CouchDB differs from others by accepting eventual consistency, as opposed to putting absolute consistency ahead of raw availability, like `RDBMS`_ or `Paxos`_. What these systems have in common is an awareness that data acts differently when many people are accessing it simultaneously. Their approaches differ when it comes to which aspects of *consistency*, *availability*, or *partition* tolerance they prioritize.
de: Ein *verteiltes System* ist ein System, welches zuverlässig über ein großes Netzwerk funktioniert. Eine spezielle Eigenschaft von Netzwerken ist, das Verbindungen jederzeit abbrechen können und es gibt viele Strategien wie man mit dieser Situation umgehen kann. CouchDB unterscheidet sich von anderen Systemen dadurch, dass es Eventual Consistency (die Daten sind letztendlich irgendwann konsistent) akzeptiert — im Gegensatz zu `RDBMS`_ und `Paxos`_, die absolute Konsistenz über schlichte Verfügbarkeit stellen. All diesen Systeme ist gemein, dass sich Daten anders verhalten, wenn viele Leute gleichzeitig versuchen darauf zuzugreifen. Ihre Ansätze unterscheiden sich, wenn es um die Gewichtung von *Konsistenz*, *Verfügbarkeit* oder *Partitionstoleranz* geht.

source: Engineering distributed systems is tricky. Many of the caveats and "gotchas" you will face over time aren't immediately obvious. We don't have all the solutions, and CouchDB isn't a panacea, but when you work with CouchDB's grain rather than against it, the path of least resistance leads you to naturally scalable applications.
de: Verteilte Systeme zu entwerfen ist nicht einfach. Viele der "Stolperfallen", die mit der Zeit auftauchen, sind am Anfang nicht offensichtlich. CouchDB kennt nicht alle Antworten und es ist auch keine Allheilmittel. Wenn man jedoch mit CouchDB anstatt dagegen arbeitet, führen die so entwickelten Anwendungen automatisch zu skalierbaren Systemen.

source: Of course, building a distributed system is only the beginning. A website with a database that is available only half the time is next to worthless. Unfortunately, the traditional relational database approach to consistency makes it very easy for application programmers to rely on global state, global clocks, and other high availability no-nos, without even realizing that they're doing so. Before examining how CouchDB promotes scalability, we'll look at the constraints faced by a distributed system. After we've seen the problems that arise when parts of your application can't rely on being in constant contact with each other, we'll see that CouchDB provides an intuitive and useful way for modeling applications around high availability.
de: Sicher ist die Entwicklung eines verteilten Systems nur der Anfang. Eine Webseite mit einer Datenbank ist nahezu nutzlos, wenn sie nur die Hälfte der Zeit erreichbar ist. Leider macht es der traditionelle Ansatz, Konsistenz mit Hilfe eines RDBMS sicherzustellen, den Entwicklern sehr leicht, sich auf einen globalen Zustand, synchronisierte Uhren und andere Dinge zu verlassen, die in hochverfügbaren Systemen nicht sichergestellt werden können. Meist tun sie das ohne sich dessen bewusst zu sein. Bevor wir untersuchen, wie CouchDB Skalierbarkeit fördert, schauen wir auf die Rahmenbedingungen von verteilten Systemen. Nachdem die Probleme offensichtlich werden, wenn Teile einer Anwendung sich nicht mehr darauf verlassen können, auf andere Teile ständig zugreifen zu können, wird deutlich, wie CouchDB einen intuitiven und sinnvollen Weg weist, um hochverfügbare Anwendungen zu entwickeln.

source: The CAP Theorem
de: Das CAP Theorem

source: The CAP theorem describes a few different strategies for distributing application logic across networks. CouchDB's solution uses replication to propagate application changes across participating nodes. This is a fundamentally different approach from consensus algorithms and relational databases, which operate at different intersections of consistency, availability, and partition tolerance.
de: Das CAP-Theorem (CAP = Consistency, Avalability, Partition Tolerance) beschreibt einige Strategien um Anwendungslogik über ein Netzwerk zu verteilen. CouchDB verwendet Replikation um Änderungen zwischen den einzelnen Knoten zu synchronisieren. Das ist ein fundamental anderer Ansatz als der von Konsens-Algorithmen und relationalen Datenbanken, die an anderen Schnittpunkten von Konsistenz, Verfügbarkeit und Partitionstoleranz liegen.

source: The CAP theorem, shown in :ref:`intro/consistency-01`, identifies three distinct concerns:
de: Das CAP Theorem wie in :ref:`intro/consistency-01` gezeigt identifiziert drei separate Bereiche:

source: **Consistency**: All database clients see the same data, even with concurrent updates.
de: **Consistency**: Alle Datenbank Nutzer sehen die gleichen Daten — selbst bei konkurrierenden Updates.

source: **Availability**: All database clients are able to access some version of the data.
de: **Availability**: Alle Datenbank Nutzer können auf irgendeine Version der Daten zugreifen.

source: **Partition tolerance**: The database can be split over multiple servers.
de: Die Datenbank kann über mehrere Server verteilt sein.

source: Pick two.
de: Wähle zwei aus.

source: When a system grows large enough that a single database node is unable to handle the load placed on it, a sensible solution is to add more servers. When we add nodes, we have to start thinking about how to partition data between them. Do we have a few databases that share exactly the same data? Do we put different sets of data on different database servers? Do we let only certain database servers write data and let others handle the reads?
de: Wenn ein System groß genug wird und ein einzelner Datenbankknoten nicht mehr ausreicht, um der Last Herr zu werden bietet es sich an, mehr Server zu betreiben. Sobald wir Netzwerkknoten hinzufügen müssen wir uns Gedanken darüber machen, wie wir die Daten zwischen ihnen aufteilen. Haben wir Datenbanken die sich exakt die selben Daten teilen? Oder werden wir verschiedene Datensätze auf verschiedene Server verteilen? Lassen wir einige Datenbankserver Daten schreiben und wieder andere die Daten nur ausliefern?

source: Regardless of which approach we take, the one problem we'll keep bumping into is that of keeping all these database servers in sync. If you write some information to one node, how are you going to make sure that a read request to another database server reflects this newest information? These events might be milliseconds apart. Even with a modest collection of database servers, this problem can become extremely complex.
de: Egal welchen Ansatz wir wählen: wir werden immer dem Problem begegnen dass wir unsere Datenbankserver synchron halten müssen. Angenommen wir schreiben Daten auf einen Knoten, wie stellen wir dann sicher dass eine lesende Anfrage die einem anderen Datenbankserver gestellt wird, diese neuen Informationen enthält? Die Zeitspanne zwischen dem Schreiben und dem Lesen der Daten könnte nur Millisekunden voneinander getrennt sein, selbst mit einer geringen Anzahl Datenbankserver kann dieses Problem sehr komplex werden.

source: When it's absolutely critical that all clients see a consistent view of the database, the users of one node will have to wait for any other nodes to come into agreement before being able to read or write to the database. In this instance, we see that availability takes a backseat to consistency. However, there are situations where availability trumps consistency:
de: Wenn es darum geht, dass alle Clients der Anwendung ein konsistentes Bild der Datenbank haben, werden die Nutzer des jeweiligen Knotens darauf warten müssen bis alle anderen Netzknoten sich synchronisiert haben, bevor sie Daten lesen oder schreiben können. In diesem Fall wird die Konsistenz der Verfügbarkeit vorgezogen. Aber es gibt auch Situationen bei der die Verfügbarkeit die Konsistenz aussticht:

source: Each node in a system should be able to make decisions purely based on local state. If you need to do something under high load with failures occurring and you need to reach agreement, you're lost. If you're concerned about scalability, any algorithm that forces you to run agreement will eventually become your bottleneck. Take that as a given.
de: Jeder Knoten in einem System sollte dazu in der Lage sein Entscheidungen basierend allein auf seinem lokalen Zustand zu treffen. Wenn du etwas unter hoher Last tun willst, dann Fehler auftreten und du aus Synchronisierung warten musst, hast du verloren. Wenn du dir Gedanken über Skalierbarkeit machst, könnte sich jeder Algorithmus um diese Synchronisierung zu erreichen als ein Flaschenhals entpuppen. Nehme dies als gegeben an.

source: If availability is a priority, we can let clients write data to one node of the database without waiting for other nodes to come into agreement. If the database knows how to take care of reconciling these operations between nodes, we achieve a sort of "eventual consistency" in exchange for high availability. This is a surprisingly applicable trade-off for many applications.
de: Wenn Verfügbarkeit Priorität hat, können wir Clients die Daten zunächst auf einen Knoten schreiben lassen, ohne darauf zu warten, dass die anderen Knoten synchronisiert werden. Wenn die Datenbank weiß, wie sie mit dieser Situation umzugehen hat, sind die Daten irgendwann "letztendlich konsistent" - allerdings unter Aufgabe der Hochverfügbarkeit der Daten. Für viele Anwendungen ist das ein erstaunlich guter Kompromiss.

source: Unlike traditional relational databases, where each action performed is necessarily subject to database-wide consistency checks, CouchDB makes it really simple to build applications that sacrifice immediate consistency for the huge performance improvements that come with simple distribution.
de: Im Gegensatz zu traditionellen, relationalen Datenbanken, bei denen jede Aktion notwendigerweise Konsistenzprüfungen über die ganze Datenbank nach sich ziehen, macht es CouchDB sehr einfach Anwendungen zu bauen, die sofortige Konsistenz gegen eine große Steigerung der Performanz eintauschen, welche durch einfache Verteilung zustande kommt.

source: Local Consistency
de: Lokale Konsistenz

source: Before we attempt to understand how CouchDB operates in a cluster, it's important that we understand the inner workings of a single CouchDB node. The CouchDB API is designed to provide a convenient but thin wrapper around the database core. By taking a closer look at the structure of the database core, we'll have a better understanding of the API that surrounds it.
de: Bevor wir versuchen zu erklären, wie CouchDB in einem Cluster funktioniert, ist es wichtig zu verstehen, wie ein einzelner CouchDB Knoten arbeitet. Das CouchDB API wurde so entworfen, dass es nur eine dünne Schicht über dem eigentlichen Datenbankkern ist. Indem man genauer auf die Struktur dieses Kerns schaut, versteht man das API, das ihn umgibt, besser.

source: The Key to Your Data
de: Der Schlüssel zu deinen Daten

source: At the heart of CouchDB is a powerful *B-tree* storage engine. A B-tree is a sorted data structure that allows for searches, insertions, and deletions in logarithmic time. As :ref:`intro/consistency-02` illustrates, CouchDB uses this B-tree storage engine for all internal data, documents, and views. If we understand one, we will understand them all.
de: Das Herz von CouchDB ist eine mächtige *B-Tree* Storage Engine. Ein B-Tree ist eine sortierte Datenstruktur, welche Suchen, Einfügen und Löschen von Knoten in logarithmischer Zeit erlaubt. Wie :ref:`intro/consistency-02` zeigt, benutzt CouchDB die B-Tree Storage Engine für sämtliche internen Daten, Dokumente und Views. Hat man einen verstanden, versteht man alle.

source: CouchDB uses MapReduce to compute the results of a view. MapReduce makes use of two functions, "map" and "reduce", which are applied to each document in isolation. Being able to isolate these operations means that view computation lends itself to parallel and incremental computation. More important, because these functions produce key/value pairs, CouchDB is able to insert them into the B-tree storage engine, sorted by key. Lookups by key, or key range, are extremely efficient operations with a B-tree, described in `big O` notation as ``O(log N)`` and ``O(log N + K)``, respectively.
de: CouchDB verwendet MapReduce um die Ergebnisse einer View zu berechnen. MapReduce benutzt dazu zwei Funktionen "map" und "reduce", welche auf jedes Dokument separat angewendet werden. Die Möglichkeit diese Operationen zu isolieren führt dazu, dass man sie parallel und inkrementell ausführen kann. Wichtiger noch, weil diese Funktionen Key/Value Paare erzeugen, kann CouchDB sie nach Schlüssel sortiert in die B-Tree Storage Engine einfügen. Suchen mit Hilfe eines Schlüssels (Key) oder eines Schlüsselwertbereichs (Key Range) sind sehr effizient mit einem B-Tree, beschrieben als `O Notation` in ``O(log N)`` beziehungsweise ``O(log N + K)``.

source: In CouchDB, we access documents and view results by key or key range. This is a direct mapping to the underlying operations performed on CouchDB's B-tree storage engine. Along with document inserts and updates, this direct mapping is the reason we describe CouchDB's API as being a thin wrapper around the database core.
de: In CouchDB greift man auf Dokumente und Views über Schlüssel oder Schlüsselbereiche zu. Das ist eine direkte Abbildung der Operationen, die von CouchDBs B-Tree Storage Engine ausgeführt werden. Zusammen mit den Operationen für das Einfügen und Aktualisieren von Dokumenten sind es diese Funktionen, die uns das CouchDB API als eine dünne Schicht um den Datenbankkern beschreiben lassen.

source: Being able to access results by key alone is a very important restriction because it allows us to make huge performance gains. As well as the massive speed improvements, we can partition our data over multiple nodes, without affecting our ability to query each node in isolation. `BigTable`_, `Hadoop`_, `SimpleDB`_, and `memcached`_ restrict object lookups by key for exactly these reasons.
de: Allein schon die Beschränkung, dass auf Ergebnisse ausschließlich per Schlüssel zugegriffen werden kann, führt zu massiven Steigerungen der Zugriffsgeschwindigkeit. Neben diesen Geschwindigkeitsvorteilen können die Daten noch über verschiedene Knoten partitioniert werden, ohne die Möglichkeit zu verlieren, jeden Knoten isoliert zu verwenden. BigTable, Hadoop, SimpleDB und memcached erlauben ausschließlich eine Suche nach Schlüssel aus genau diesen Gründen.

source: No Locking
de: Kein Locking

source: A table in a relational database is a single data structure. If you want to modify a table -- say, update a row -- the database system must ensure that nobody else is trying to update that row and that nobody can read from that row while it is being updated. The common way to handle this uses what's known as a lock. If multiple clients want to access a table, the first client gets the lock, making everybody else wait. When the first client's request is processed, the next client is given access while everybody else waits, and so on. This serial execution of requests, even when they arrived in parallel, wastes a significant amount of your server's processing power. Under high load, a relational database can spend more time figuring out who is allowed to do what, and in which order, than it does doing any actual work.
de: Eine Tabelle in einer relationalen Datenbank ist eine große einzelne Datenstruktur. Wenn man eine Tabelle ändern möchte, um beispielsweise eine Zeile zu aktualisieren, muss sichergestellt sein, dass niemand versucht, die selbe Zeile zur gleichen Zeit zu ändern. Des weiteren müssen Lesezugriffe für diese Zeile unterbunden werden. Üblicherweise wird das durch ein Lock erreicht. Wenn mehrere Clients gleichzeitig auf die Tabelle zugreifen, erhält der erste Client das Lock und sorgt so dafür, dass alle anderen warten müssen. Wenn der erste Client seine Anfrage beendet hat, erhält der nächste Client das Lock usw. Diese Serialisierung der Anfragen, selbst wenn sie gleichzeitig ankommen, benötigt eine erhebliche Menge an Rechenzeit. Unter großer Last kann es vorkommen, dass eine relationale Datenbank mehr damit beschäftigt ist herauszufinden, was in welcher Reihenfolge zu tun ist, als die Anfragen zu beantworten.

source: Modern relational databases avoid locks by implementing MVCC under the hood, but hide it from the end user, requiring them to coordinate concurrent changes of single rows or fields.
de: Moderne relationale Datenbanken vermeiden Locks. Sie implementieren MVCC, aber verstecken es vor dem Benutzer. Dadurch müssen die relationalen Datenbanken die parallelen Anfragen auf die einzelnen Spalten oder Felder koordinieren.

source: Instead of locks, CouchDB uses `Multi-Version Concurrency Control` (MVCC) to manage concurrent access to the database. :ref:`intro/consistency-03` illustrates the differences between MVCC and traditional locking mechanisms. MVCC means that CouchDB can run at full speed, all the time, even under high load. Requests are run in parallel, making excellent use of every last drop of processing power your server has to offer.
de: Anstelle von Locks verwendet CouchDB `Multi-Version Concurrency Control` (MVCC) um den konkurrierenden Zugriff auf die Datenbank zu verwalten. :ref:`intro/consistency-03` veranschaulicht die Unterschiede zwischen MVCC und traditionellen Locking Mechanismen. MVCC bedeutet, dass CouchDB mit voller Geschwindigkeit arbeiten kann -- selbst unter hoher Last. Anfragen werden parallel beantwortet und nutzen so jedes Quäntchen Rechenleistung aus, das Server zu bieten hat.

source: Documents in CouchDB are versioned, much like they would be in a regular version control system such as `Subversion`_. If you want to change a value in a document, you create an entire new version of that document and save it over the old one. After doing this, you end up with two versions of the same document, one old and one new.
de: Dokumente in CouchDB werden versioniert, ähnlich zu Versionskontrollsystemen wie `Subversion`_. Wenn man einen Wert in einem Dokument ändern möchte, erzeugt man eine neue Version des Dokuments und speichert es neben dem alten. Anschließend hat man zwei Versionen des Dokuments -- eine alte und eine neue.

source: How does this offer an improvement over locks? Consider a set of requests wanting to access a document. The first request reads the document. While this is being processed, a second request changes the document. Since the second request includes a completely new version of the document, CouchDB can simply append it to the database without having to wait for the read request to finish.
de: Warum sollte das besser sein als Locking? Nehmen wir eine Gruppe von Anfragen für ein bestimmtes Dokument. Die erste Anfrage liest das Dokument. Während diese Anfrage bearbeitet wird, ändert die zweite Anfrage das Dokument. Da die zweite Anfrage eine komplett neue Version des Dokuments anlegt, kann CouchDB diese Version einfach an die Datenbank anhängen, ohne darauf zu warten, dass die erste Anfrage beendet wurde.

source: When a third request wants to read the same document, CouchDB will point it to the new version that has just been written. During this whole process, the first request could still be reading the original version.
de: Wenn eine dritte Anfrage das gleiche Dokument lesen möchte, wird CouchDB auf die neue Version verweisen, die gerade eben erzeugt wurde. Während der ganzen Zeit könnte die erste Anfrage immer noch damit beschäftigt sein, die ursprüngliche Version zu lesen.

source: A read request will always see the most recent snapshot of your database at the time of the beginning of the request.
de: Während eines Lesezugriffs wird immer der zu dem Zeitpunkt aktuellste Zustand der Datenbank verwendet.

source: Validation
de: Validierung

source: As application developers, we have to think about what sort of input we should accept and what we should reject. The expressive power to do this type of validation over complex data within a traditional relational database leaves a lot to be desired. Fortunately, CouchDB provides a powerful way to perform per-document validation from within the database.
de: Anwendungsentwickler müssen berücksichtigen, welche Eingaben akzeptabel sind und welche nicht. Die Möglichkeiten von relationalen Datenbanken, komplexe Daten innerhalb der Datenbank zu überprüfen, sind beschränkt. CouchDB bietet dagegen mächtige Funktionen um Dokumente innerhalb der Datenbank zu validieren.

source: CouchDB can validate documents using JavaScript functions similar to those used for MapReduce. Each time you try to modify a document, CouchDB will pass the validation function a copy of the existing document, a copy of the new document, and a collection of additional information, such as user authentication details. The validation function now has the opportunity to approve or deny the update.
de: CouchDB kann Dokumente mithilfe von JavaScript validieren. Diese Funktionen sind ganz ähnlich zu den MapReduce Funktionen. Jedesmal wenn ein Dokument verändert werden soll, wird CouchDB eine Kopie des aktuellen und eine Kopie des neuen Dokuments zusammen mit einigen zusätzlichen Informationen wie Benutzer und Authentifizierungsdetails an die Validierungsfunktion übergeben. Diese hat nun die Möglichkeit die Änderung zu erlauben oder abzulehnen.

source: By working with the grain and letting CouchDB do this for us, we save ourselves a tremendous amount of CPU cycles that would otherwise have been spent serializing object graphs from SQL, converting them into domain objects, and using those objects to do application-level validation.
de: In dem man CouchDB für sich arbeiten und diese Überprüfungen durchführen lässt, spart man unglaublich viel Aufwand und Rechenzeit, die sonst für die Serialisierung von Objektgraphen via SQL und die Umwandlung in Domainobjekte benutzt würde, um die Validierung schließlich in der Anwendung durchzuführen.

source: Distributed Consistency
de: Verteilte Konsistenz
