Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/intro/curl.po
Languages: de

source: cURL: Your Command Line Friend
de: cURL: Der freundliche Helfer für die Kommandozeile

source: The ``curl`` utility is a command line tool available on Unix, Linux, Mac OS X and Windows and many other platforms. ``curl`` provides easy access to the HTTP protocol (among others) directly from the command-line and is therefore an ideal way of interacting with CouchDB over the HTTP REST API.
de: Das ``curl`` Programm ist ein Kommandozeilenprogramm, dass es für Unix, Linux, Mac OS X, Windows und viele weitere Plattformen gibt. ``curl`` bietet einen einfachen Zugriff auf das HTTP Protokoll (neben anderen) von der Kommandozeile aus und ist optimal dafür geeignet mit CouchDB über die HTTP REST API zu interagieren.

source: For simple ``GET`` requests you can supply the URL of the request. For example, to get the database information:
de: Um einen einfachen ``GET`` Requests durchzuführen gibt man einfach die URL für den Request an. Zum Beispiel bekommt man so Informationen zur Datenbank:

source: This returns the database information (formatted in the output below for clarity):
de: Damit bekommen wir die Informationen zur Datenbank zurück (in der Ausgabe unten zur besseren Übersicht formatiert):

source: For some URLs, especially those that include special characters such as ampersand, exclamation mark, or question mark, you should quote the URL you are specifying on the command line. For example:
de: URLs die Sonderzeichen enthalten wie das Und-Zeichen (&), Ausrufezeichen (!), Fragezeichen (?) sollten bei der Eingabe mit Anführungszeichen versehen werden. Zum Beispiel:

source: You can explicitly set the HTTP command using the ``-X`` command line option. For example, when creating a database, you set the name of the database in the URL you send using a PUT request:
de: Mit der Option ``-X`` kann das HTTP-Kommando geändert werden. Zum Beispiel sendet man beim Anlegen einer Datenbank den Namen der Datenbank im PUT Request mit.

source: But to obtain the database information you use a ``GET`` request (with the return information formatted for clarity):
de: Aber um Informationen über die Datenbank abzurufen, würde man einen ``GET`` Request benutzen (die Antwort ist der Übersicht wegen von uns umformatiert worden):

source: For certain operations, you must specify the content type of request, which you do by specifying the ``Content-Type`` header using the ``-H`` command-line option:
de: Manche Operationen erfordern die Angabe einen Content-Types. Den ``Content-Type`` Header setzt man mit der ``-H`` Option:

source: You can also submit 'payload' data, that is, data in the body of the HTTP request using the ``-d`` option. This is useful if you need to submit JSON structures, for example document data, as part of the request. For example, to submit a simple document to the ``demo`` database:
de: Es ist zudem möglich mit der ``-d`` Option Daten mit dem Body des HTTP Requests zu senden. Das ist sehr nützlich wenn man JSON Strukturen, zum Beispiel Dokumentdaten, senden möchte. Hier ein Beispiel wie man ein einfaches Dokument an die ``demo`` Datenbank sendet:

source: In the above example, the argument after the ``-d`` option is the JSON of the document we want to submit.
de: Im obigen Beispiel enthält das Argument nach der ``-d`` Option das JSON Dokument, das wir senden wollen.

source: The document can be accessed by using the automatically generated document ID that was returned:
de: Auf das Dokument kann dann mit der Dokument ID die zurückgegeben wurde zugegriffen werden.

source: The API samples in the :ref:`api/basics` show the HTTP command, URL and any payload information that needs to be submitted (and the expected return value). All of these examples can be reproduced using ``curl`` with the command-line examples shown above.
de: Die API Beispiele in :ref:`api/basics` zeigen das HTTP Kommando, die URL und jeden Wert der abgeschickt werden muss (und den erwarteten Rückgabewert). Jedes dieser Beispiele kann mit ``curl`` und den oben gezeigten Beispielen reproduziert werden.
