Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/intro/futon.po
Languages: de

source: Futon: Web GUI Administration Panel
de: Futon: Das Webinterface zur Administration von CouchDB

source: Futon is a native web-based interface built into CouchDB. It provides a basic interface to the majority of the functionality, including the ability to create, update, delete and view documents and views, provides access to the configuration parameters, and an interface for initiating replication.
de: Futon ist die webbasierte Oberfläche in CouchDB. Mit Futon können wir den Großteil der Funktionen von CouchDB nutzen: Dokumente und Views erstellen, aktualisieren und löschen sowie Konfigurationen bearbeiten und auch Replikationen steuern.

source: The default view is the Overview page which provides you with a list of the databases. The basic structure of the page is consistent regardless of the section you are in. The main panel on the left provides the main interface to the databases, configuration or replication systems. The side panel on the right provides navigation to the main areas of Futon interface:
de: Die Standardansicht ist die Übersichtsseite die eine Liste der Datenbanken anzeigt. Die Strukturen der Seiten ist unabhängig von dem jeweilig ausgewählten Punkt konsistent gehalten. Im großen Fenster auf der linken Seite bearbeitet man Datenbanken, Konfigurationen oder Replikationen. Der Abschnitt auf der rechten Seite beinhaltet das Hauptmenü mit dem man die verschiedenen Hauptbereiche in Futon erreichen kann:

source: The main sections are:
de: Die Hauptbereiche sind:

source: Overview
de: Übersicht

source: The main overview page, which provides a list of the databases and provides the interface for querying the database and creating and updating documents. See :ref:`futon-management`.
de: Die Hauptübersicht. Hier werden die Datenbanken aufgelistet, es können auch Abfragen an die Datenbank gestellt werden und Dokumente erzeugt oder aktualisiert werden. Siehe: :ref:`futon-management`.

source: Configuration
de: Konfiguration

source: An interface into the configuration of your CouchDB installation. The interface allows you to edit the different configurable parameters. For more details on configuration, see :ref:`config` section.
de: Hier bearbeitet man die Konfiguration der CouchDB Installation. Die Oberfläche erlaubt uns verschiedene Konfigurationen anzupassen. Mehr Details zur Konfiguration findest du im Abschnitt :ref:`config`.

source: Replicator
de: Replikator

source: An interface to the replication system, enabling you to initiate replication between local and remote databases. See :ref:`futon-replication`.
de: Eine Oberfläche für die Replikationen, mit dem man die Replikation zwischen lokalen und entfernten Datenbanken starten kann. Siehe auch :ref:`futon-replication`.

source: Displays a list of the running background tasks on the server. Background tasks include view index building, compaction and replication. The Status page is an interface to the :ref:`Active Tasks <api/server/active_tasks>` API call.
de: Zeigt eine Liste der laufenden Hintergrundjobs auf dem Server. Hintergrundjobs beinhaltet die Indexerstellung für Views, Kompaktierung und Replikation. Die Statusseite ist die grafische Oberfläche für den :ref:`Active Tasks <api/server/active_tasks>` API Aufruf.

source: Verify Installation
de: Installation überprüfen

source: The Verify Installation allows you to check whether all of the components of your CouchDB installation are correctly installed.
de: Mit Installation überprüfen kann man prüfen, on alle Komponenten der CouchDB Installation ordnungsgemäß installiert wurden.

source: The Test Suite section allows you to run the built-in test suite. This executes a number of test routines entirely within your browser to test the API and functionality of your CouchDB installation. If you select this page, you can run the tests by using the Run All button. This will execute all the tests, which may take some time.
de: Im Abschnitt Test Suite kann man die eingebaute Test Suite starten. Es werden dann eine Reihe von Testroutinen innerhalb des Browser ausgeführt, die das API und die Funktionalität der CouchDB Installation testen. Man startet die Tests mit dem Run All Button, es werden dann alle Tests ausgeführt, was ein wenig dauern kann.

source: Managing Databases and Documents
de: Datenbanken und Dokumente verwalten

source: You can manage databases and documents within Futon using the main Overview section of the Futon interface.
de: Du kannst Datenbanken und Dokumente innerhalb von Futon in der Übersicht verwalten.

source: To create a new database, click the Create Database ELLIPSIS button. You will be prompted for the database name, as shown in the figure below.
de: Um eine neue Datenbank anzulegen, drücke den Knopf Datenbank anlegen. Man wird dich nach einem Datenbanknamen fragen, wie in der Abbildung unten.

source: Once you have created the database (or selected an existing one), you will be shown a list of the current documents. If you create a new document, or select an existing document, you will be presented with the edit document display.
de: Wenn du die Datenbank angelegt hast (oder eine bestehende ausgewählt hast) wird dir eine Liste der Dokumente angezeigt. Wenn du ein neues Dokument anlegst oder ein bestehendes selektierst, wird dir die Oberfläche für das Editieren von Dokumenten angezeigt.

source: Editing documents within Futon requires selecting the document and then editing (and setting) the fields for the document individually before saving the document back into the database.
de: Um Dokumente in Futon zu editieren muss man das Dokument auswählen und dann die einzelnen Felder editieren oder hinzufügen, bevor man das Dokument dann speichert.

source: For example, the figure below shows the editor for a single document, a newly created document with a single ID, the document ``_id`` field.
de: Die Abbild unten zeigt zum Beispiel den Editor für ein einzelnen Dokument, ein neu erzeugtes Dokument mit einer ID, dem Dokumentenfeld ``_id``.

source: To add a field to the document:
de: Um dem Dokument ein Feld hinzuzufügen:

source: Click Add Field.
de: Drücke Feld Hinzufügen.

source: In the fieldname box, enter the name of the field you want to create. For example, “company”.
de: In der kleinen Box für den Namen des Feldes kannst du einen Namen für das Feld festlegen. Zum Beispiel: “company”.

source: Click the green tick next to the field name to confirm the field name change.
de: Klicke auf den grünen Haken neben dem Feld um die Änderung zu Bestätigen.

source: Double-click the corresponding Value cell.
de: Mache einen Doppelklick auf die dazugehörige Zelle für den Wert.

source: Enter a company name, for example “Example”.
de: Gib einen Firmennamen ein, zum Beispiel “Example”.

source: Click the green tick next to the field value to confirm the field value.
de: Drücke den grünen Haken neben dem Feldwert um den Wert zu bestätigen.

source: The document is still not saved as this point. You must explicitly save the document by clicking the Save Document button at the top of the page. This will save the document, and then display the new document with the saved revision information (the ``_rev`` field).
de: Das Dokument ist jetzt noch nicht gespeichert. Man muss das Dokument explizit speichern indem man den Knopf mit Dokument Speichern oben auf der Seite drückt. Das Dokument wird dann gespeichert und es wird dann das neue Dokument mit der gespeicherten Revision (das ``_rev`` Feld) angezeigt.

source: The same basic interface is used for all editing operations within Futon. You *must* remember to save the individual element (fieldname, value) using the green tick button, before then saving the document.
de: Die Selbe Oberfläche wird für das Editieren in Futon benutzt. Du *musst* daran denken, das Element (Feldname, Wert) mit dem Grünen Haken zu bestätigen, bevor du das Dokument speicherst.

source: Configuring Replication
de: Replikation konfigurieren

source: When you click the Replicator option within the Tools menu you are presented with the Replicator screen. This allows you to start replication between two databases by filling in or select the appropriate options within the form provided.
de: Nach Auswahl der Option Replikator im Menü wird der Abschnitt Replikation angezeigt. Hier kann die Replikation zwischen zwei Datenbanken durch Auswahl oder Ausfüllen der passenden Optionen gestartet werden.

source: To start a replication process, either the select the local database or enter a remote database name into the corresponding areas of the form. Replication occurs from the database on the left to the database on the right.
de: Um einen Replikationsprozess zu starten, muss entweder die lokale Datenbank gewählt werden, oder der Name einer entfernten Datenbank in das Formular eingegeben werden. Die Replikation wird von der Datenbank auf der linken Seite zur Datenbank auf der rechten Seiten gestartet.

source: If you are specifying a remote database name, you must specify the full URL of the remote database (including the host, port number and database name). If the remote instance requires authentication, you can specify the username and password as part of the URL, for example ``http://username:pass@remotehost:5984/demo``.
de: Wenn man eine entfernte Datenbank angibt, muss die volle URL der Datenbank (inklusive Hostnamen, Port, und Datenbankname) angegeben werden. Wenn die entfernte Datenbankinstanz Authentifizierung benötigt, kann man den Benutzernamen und das Passwort als Teil der URL angeben, zum Beispiel: ``http://username:pass@remotehost:5984/demo``.

source: To enable continuous replication, click the Continuous checkbox.
de: Setzen einen Haken an die Checkbox Kontinuierlich, um kontinuierliche Replikation zu aktivieren.

source: To start the replication process, click the Replicate button. The replication process should start and will continue in the background. If the replication process will take a long time, you can monitor the status of the replication using the Status option under the Tools menu.
de: Um die Replikation zu starten, drückt man den Knopf Replizieren. Der Prozess sollte starten und im Hintergrund weiterlaufen. Falls die Replikation lange dauert, kann man den Status jederzeit mit einem Klick auf Status im Tools-Menü einsehen.

source: Once replication has been completed, the page will show the information returned when the replication process completes by the API.
de: Nachdem die Replikation abgeschlossen ist, zeigt die Seite Informationen zum Replikationsprozess von dem API an.

source: The Replicator tool is an interface to the underlying replication API. For more information, see :ref:`api/server/replicate`. For more information on replication, see :ref:`replication`.
de: Das Replikationswerkzeug ist die grafische Oberfläche zu dem Replikations-API. Mehr Informationen dazu unter :ref:`api/server/replicate`. Für mehr Informationen zum Thema Replikation, siehe: :ref:`replication`.
