Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/intro/overview.po
Languages: de

source: Technical Overview
de: Technischer Überblick

source: Document Storage
de: Dokumentenspeicher

source: A CouchDB server hosts named databases, which store **documents**. Each document is uniquely named in the database, and CouchDB provides a `RESTful`_ :ref:`HTTP API <api/basics>` for reading and updating (add, edit, delete) database documents.
de: Ein CouchDB Server stellt Datenbanken mit einem Namen bereit, die **Dokumente** speichern. Jedes Dokument hat einen eindeutigen Namen in der Datenbank und CouchDB stellt ein `RESTful`_ :ref:`HTTP API <api/basics>` für das Lesen und Aktualisieren (hinzufügen, editieren, löschen) von Datenbankdokumenten zur Verfügung.

source: Documents are the primary unit of data in CouchDB and consist of any number of fields and attachments. Documents also include metadata that’s maintained by the database system. Document fields are uniquely named and contain values of :ref:`varying types <json>` (text, number, boolean, lists, etc), and there is no set limit to text size or element count.
de: Dokumente sind die primäre Dateneinheit in CouchDB und bestehen aus einer Anzahl von Feldern und Attachments. Dokumente beinhalten auch Metadaten, die von der Datenbank verwaltet werden. Die Attribute oder auch Felder des Dokuments haben einen eindeutigen Namen und können die Werte :ref:`varying types <json>` (Text, Zahl, Boolean, Liste, usw.) enthalten. Es gibt keine Grenzen für die Textgröße oder die Anzahl der Elemente.

source: The CouchDB document update model is lockless and optimistic. Document edits are made by client applications loading documents, applying changes, and saving them back to the database. If another client editing the same document saves their changes first, the client gets an edit conflict error on save. To resolve the update conflict, the latest document version can be opened, the edits reapplied and the update tried again.
de: Das Modell mit dem CouchDB Dokumente aktualisiert ist optimistisch und lockfrei. Das heißt, dass die Clientapplikation Dokumente läd, Änderungen vornimmt und die Dokumente danach wieder in der Datenbank speichert. Sollte eine andere Clientapplikation das selbe Dokument mit ihren Änderungen zuerst speichern, so wird es einen Konflikt beim Speichern des Dokuments geben. Um den Konflikt aufzulösen, kann die letzte Dokumentversion geöffnet werden, die Änderungen neu angewendet werden und danach noch einmal probiert werden, das Dokument zu speichern.

source: Document updates (add, edit, delete) are all or nothing, either succeeding entirely or failing completely. The database never contains partially saved or edited documents.
de: Die Aktualisierung eines Dokuments (Hinzufügen, Editieren, Löschen) schlägt entweder komplett fehl, oder ist erfolgreich. Die Datenbank wird niemals halb gespeicherte oder editierte Dokumente enthalten.

source: ACID Properties
de: ACID Eigenschaften

source: The CouchDB file layout and commitment system features all `Atomic Consistent Isolated Durable` (`ACID`_) properties. On-disk, CouchDB never overwrites committed data or associated structures, ensuring the database file is always in a consistent state. This is a "crash-only" design where the CouchDB server does not go through a shut down process, it's simply terminated.
de: Der Aufbau der CouchDB Dateien und das System für Einträge und Änderungen unterstützt alle `Atomic Consistent Isolated Durable` (`ACID`_) Eigenschaften. CouchDB achtet darauf die Datenbank-Dateien auf der Festplatte konsistent zu halten und wird niemals eingetragene Daten und ihre Strukturen einfach überschreiben. Um dies zu erreichen wird sich der CouchDB Server nie herunterfahren, sondern den Prozess einfach beenden - das nennt man auch Crash-Only Design.

source: Document updates (add, edit, delete) are serialized, except for binary blobs which are written concurrently. Database readers are never locked out and never have to wait on writers or other readers. Any number of clients can be reading documents without being locked out or interrupted by concurrent updates, even on the same document. CouchDB read operations use a `Multi-Version Concurrency Control` (`MVCC`_) model where each client sees a consistent snapshot of the database from the beginning to the end of the read operation.
de: Updates von Dokumenten (Hinzufügen, Editieren, Löschen) werden seriell bearbeitet, außer Binär-Blobs die nebenläufig geschrieben werden. Es kann immer von der Datenbank gelesen werden, es muss nicht auf Schreibprozesse oder andere Leseprozesse gewartet werden. Jede beliebe Anzahl von Clients kann Dokumente lesen ohne sich gegenseitig zu blockieren oder von nebenläufigen Updates unterbrochen zu werden, das funktioniert sogar wenn all dies mit dem selben Dokument passiert. Leseoperationen in CouchDB benutzten das sogenannte `Multi-Version Concurrency Control` (`MVCC`_) Modell, bei dem jeder Client mit einem konsistenten Auszug der Datenbank vom Anfang bis zum Ende der Leseoperation arbeitet.

source: Documents are indexed in `B-trees`_ by their name (DocID) and a Sequence ID. Each update to a database instance generates a new sequential number. Sequence IDs are used later for incrementally finding changes in a database. These B-tree indexes are updated simultaneously when documents are saved or deleted. The index updates always occur at the end of the file (append-only updates).
de: Die Dokumente werden in `B-trees`_ nach ihrem Namen (DocID) und einer Sequenz ID indexiert. Jedes Update auf einer Instanz der Datebank generiert eine neue sequenzielle Nummer. Sequenz IDs werden später benutzt um inkrementell Änderungen in der Datenbank festzustellen. Die B-tree Indizes werden mit dem Speichern oder Löschen eines Dokuments gleichzeitig mitaktualisiert. Das Update des Index wird an das Ende der Datenbankdatei geschrieben (Append-only updates).

source: Documents have the advantage of data being already conveniently packaged for storage rather than split out across numerous tables and rows in most database systems. When documents are committed to disk, the document fields and metadata are packed into buffers, sequentially one document after another (helpful later for efficient building of views).
de: Der Vorteil von Dokumenten liegt darin, dass Daten bereits bequem für die Aufbewahrung verpackt sind anstatt über eine Vielzahl von Tabellen und Spalten verteilt sind. Wenn ein Dokument auf die Festplatte geschrieben wird, werden die Dokumentenfelder und Metadaten sequenziell in Buffer geschrieben, ein Dokument nach dem Anderen. Dies wird später nützlich für das anlegen von effizienten Views.

source: When CouchDB documents are updated, all data and associated indexes are flushed to disk and the transactional commit always leaves the database in a completely consistent state. Commits occur in two steps:
de: Sobald CouchDB Dokumente aktualisiert werden, werden die gesamten Daten sowie dazugehörigen Indizes sofort auf die Festplatte geschrieben und die Transaktion hinterlässt die Datenbank immer in einem komplett konsistenten Zustand. Transaktionen passiert in zwei Schritten:

source: All document data and associated index updates are synchronously flushed to disk.
de: Die gesamten Dokumentdaten und dazugehörige Indexupdates werden synchron auf die Fetsplatte geschrieben.

source: The updated database header is written in two consecutive, identical chunks to make up the first 4k of the file, and then synchronously flushed to disk.
de: Der aktualisierte Datenbank-Header wird in zwei nacheinanderfolgenden, indentischen Teilen erzeugt, die die ersten 4k der Datei ausmachen und danach synchron auf die Festplatte geschrieben

source: In the event of an OS crash or power failure during step 1, the partially flushed updates are simply forgotten on restart. If such a crash happens during step 2 (committing the header), a surviving copy of the previous identical headers will remain, ensuring coherency of all previously committed data. Excepting the header area, consistency checks or fix-ups after a crash or a power failure are never necessary.
de: Falls während Schritt 1 das Betriebssystem abstürzt oder es einen Stromausfall gibt, so sind die halb geschriebenen Aktualisierungen nach dem Neustart verschwunden. Sollte der Ausfall während Schritt 2 (den Header schreiben) passieren, so wird eine Kopie der Header übrig bleiben sodass die geschriebenen Daten in ihrem Kontext erhalten bleiben. Konsistenzprüfungen oder Reparaturen sind nach einem Ausfall nie notwendig, außer für die Header.

source: Compaction
de: Kompaktierung

source: Wasted space is recovered by occasional compaction. On schedule, or when the database file exceeds a certain amount of wasted space, the compaction process clones all the active data to a new file and then discards the old file. The database remains completely online the entire time and all updates and reads are allowed to complete successfully. The old database file is deleted only when all the data has been copied and all users transitioned to the new file.
de: Verschwendeter Festplattenspeicher kann durch die Kompaktierung der Datenbank wieder hergestellt werden. Wenn die Datenbankdatei eine bestimmte Menge Platz verschwendet, klont der Kompaktierungsprozess die gesamten aktiven Daten in eine neue Datei und entfernt die alte Datei. Dies kann auch nach einem fetsgelegten Zeitplan passieren. Die Datenbank bleibt während des Kompatkierens komplett online und alle Datenupdates sowie Leseprozesse werden erfolgreich abgearbeitet. Die alte Datenbankdatei wird nur gelöscht nachdem alle Daten kopiert und alle Datenbankbenutzer auf die neue Datei umgelenkt wurden.

source: ACID properties only deal with storage and updates, but we also need the ability to show our data in interesting and useful ways. Unlike SQL databases where data must be carefully decomposed into tables, data in CouchDB is stored in semi-structured documents. CouchDB documents are flexible and each has its own implicit structure, which alleviates the most difficult problems and pitfalls of bi-directionally replicating table schemas and their contained data.
de: ACID Eigenschaften behandeln Speicherung und Aktualisierung, aber wir benötigen auch die Möglichkeit, unsere Daten interessant und nützlich darzustellen. Im Gegensatz zu SQL-Datenbanken, bei denen Daten zerlegt in Tabellen gespeichert werden, werden Daten bei CouchDB in semi-strukturierten Dokumenten gespeichert. Diese CouchDB Dokumente sind flexibel und jedes hat seine eigene implizierte Struktur. Diese Struktur erleichtert die meisten der schwierigen Probleme und Fallstricke von bidirektional replizierenden Tabellenschemata und ihrer enthaltenen Daten.

source: But beyond acting as a fancy file server, a simple document model for data storage and sharing is too simple to build real applications on -- it simply doesn't do enough of the things we want and expect. We want to slice and dice and see our data in many different ways. What is needed is a way to filter, organize and report on data that hasn't been decomposed into tables.
de: Aber wenn es komplizierter wird als ein Dateiserver, ist ein simples Dokumentenmodell um Daten zu teilen und zu speichern einfach zu schlicht um damit reale Applikation zu bauen -- es macht dafür zu wenig, was wir wollen und erwarten. Wir möchten unsere Daten auf viele verschiedenen Wege sehen. Wir benötigen Werkzeuge um die Daten, die nicht in Tabellen zerlegt wurden, zu filtern, zu organisieren und zu messen.

source: View Model
de: View Modell

source: To address this problem of adding structure back to unstructured and semi-structured data, CouchDB integrates a view model. Views are the method of aggregating and reporting on the documents in a database, and are built on-demand to aggregate, join and report on database documents. Because views are built dynamically and don’t affect the underlying document, you can have as many different view representations of the same data as you like.
de: Um dem Problem zu begegnen unstrukturierten und semi-strukturierten Daten wieder Struktur zu verleihen, integriert CouchDB ein View Modell. Views sind eine Methode um Dokumente in einer Datenbank zu aggregieren und über diese zu informieren. Sie werden auf Anfrage erstellt um Dokumente zu aggregieren, zusammenzufügen und über diese zu informieren. Da Views dynamisch erstellt werden und die zu Grunde liegenden Dokumente nicht beeinflussen, kannst du so viele unterschiedliche View-Repräsentationen der gleichen Daten haben wie du möchtest.

source: View definitions are strictly virtual and only display the documents from the current database instance, making them separate from the data they display and compatible with replication. CouchDB views are defined inside special **design documents** and can replicate across database instances like regular documents, so that not only data replicates in CouchDB, but entire application designs replicate too.
de: View Definitionen sind strikt virtuell und zeigen nur die Dokumente der aktuellen Datenbank-Instanz. Dies macht Views unabhängig von den Daten die dieser darstellt und ausserdem kompatibel mit dem Replikations-Mechanismus. CouchDB views werden innnerhalb spezielle **Design Dokumente** definiert und können wie gewöhnliche Dokumente zwischen Datenbank-Instanzen repliziert werden. Somit werden nicht nur Daten repliziert, sondern komplette Applikations-Designs in CouchDB repliziert.

source: Javascript View Functions
de: JavaScript View-Funktionen

source: Views are defined using Javascript functions acting as the map part in a `map-reduce system`_. A :ref:`view function <viewfun>` takes a CouchDB document as an argument and then does whatever computation it needs to do to determine the data that is to be made available through the view, if any. It can add multiple rows to the view based on a single document, or it can add no rows at all.
de: Views werden mit Hilfe von JavaScript Funktionen definiert, die den Map-Part in einem `Map-Reduce System` darstellen. Eine :ref:`view function <viewfun>` nimmt ein CouchDB Dokument als Argument entgegen und berechnet die Daten, die durch den View zugänglich gemacht werden sollen, sofern vorhanden. Sie kann dem View mehrere oder garkeine Zeilen auf Grundlage eines Dokumentes hinzufügen.

source: View Indexes
de: View Indizes

source: Views are a dynamic representation of the actual document contents of a database, and CouchDB makes it easy to create useful views of data. But generating a view of a database with hundreds of thousands or millions of documents is time and resource consuming, it's not something the system should do from scratch each time.
de: Views sind die dynamische Repräsentation der aktuellen Dokumentinhalte einer Datenbank. CouchDB macht es einem leicht nützliche Views der Daten zu erstellen. Allerdings wird beträchtliche Zeit und Ressourcen in Anspruch genommen wenn ein View auf Grundlage hunderter, tausender oder Millionen von Dokumenten generiert werden soll. Das sollte das System nicht jedes mal von Neuem tun.

source: To keep view querying fast, the view engine maintains indexes of its views, and incrementally updates them to reflect changes in the database. CouchDB’s core design is largely optimized around the need for efficient, incremental creation of views and their indexes.
de: Um das Abfragen von Views schnell zu ermöglichen, verwaltet die View-Engine Indizes der Views und aktualisiert diese inkrementell um die Aktualisierungen in der Datenbank widerzuspiegeln. Das Grundlegende Design von CouchDB ist auf den Bedarf der Erstellung effizienter und inkrementeller Views und deren Indizes ausgerichtet.

source: Views and their functions are defined inside special "design" documents, and a design document may contain any number of uniquely named view functions. When a user opens a view and its index is automatically updated, all the views in the same design document are indexed as a single group.
de: Views und Ihre Funktionen werden innerhalb spezieller "design" Dokumente definiert und dabei kann ein Design-Dokument eine beliebige Anzahl eindeutig benannter View-Funktionen beinhalten. Wenn Benutzer einen View öffnet und dessen Index wird automatisch aktualisiert werden alle VIews im gleichen Design Dokument als einzelnen Gruppen indiziert.

source: The view builder uses the database sequence ID to determine if the view group is fully up-to-date with the database. If not, the view engine examines the all database documents (in packed sequential order) changed since the last refresh. Documents are read in the order they occur in the disk file, reducing the frequency and cost of disk head seeks.
de: Der View-Builder nutzt die Sequenz-ID der Datenbank um festzustellen, ob die View-Gruppe komplett aktuell im Vergleich zur Datenbank ist. Wenn nicht untersucht die View-Engine alle Datenbank Dokumente (in gepackter sequentieller Reihenfolge) die seit der letzten Aktualisierung geändert wurden. Dokumente werden in der Reihenfolge wie sie in der Datei auf der Festplatte auftreten gelesen um die Frequenz und Lesekopfvorgänge zu reduzieren.

source: The views can be read and queried simultaneously while also being refreshed. If a client is slowly streaming out the contents of a large view, the same view can be concurrently opened and refreshed for another client without blocking the first client. This is true for any number of simultaneous client readers, who can read and query the view while the index is concurrently being refreshed for other clients without causing problems for the readers.
de: Während die Views aktualisiert werden, können sie gleichzeitig gelesen und auch Abfragen auf sie gemacht werden. Wenn ein Client langsam den Inhalt einer großen View empfängt, kann der selbe View von anderen Clients geöffnet aktualisiert werden, ohne dass der erste Client geblockt wird. Dies gilt für jede beliebige Anzahl von gleichzeitigen Lesezugriffen, die alle den View lesen und abfragen können, ohne zu einem Problem für andere lesende Clients zu werden.

source: As documents are examined, their previous row values are removed from the view indexes, if they exist. If the document is selected by a view function, the function results are inserted into the view as a new row.
de: Wenn Dokumente durch die 'map' und 'reduce' Funktionen verarbeitet werden, werden ihre vorherigen Werte von den Viewindizes entfernt, sofern vorhanden. Wenn ein Dokument von einer Viewfunktion selektiert wird, werden die Resultate der Funktion in den View als neue Spalte eingefügt.

source: When view index changes are written to disk, the updates are always appended at the end of the file, serving to both reduce disk head seek times during disk commits and to ensure crashes and power failures can not cause corruption of indexes. If a crash occurs while updating a view index, the incomplete index updates are simply lost and rebuilt incrementally from its previously committed state.
de: Wenn Änderungen am Viewindex auf die Festplatte geschrieben werden, werden die Updates immer an das Ende der Datei angehängt, um die Suchzeit für neue Daten auf der Festplatte zu verringern und um Sicherzustellen, dass ein Serverabsturz oder Stromausfall den Index nicht beschädigt. Falls es zu einem Absturz kommt während ein View aktualisiert wird, sind die nicht fertig geschriebenen Updates einfach verloren und der vorherige Zustand kann inkrementell von den vorher erfolgreich geschriebenen Daten am Ende der Datei wiederhergestellt werden.

source: Security and Validation
de: Sicherheit und Validierung

source: To protect who can read and update documents, CouchDB has a simple reader access and update validation model that can be extended to implement custom security models.
de: Um zu definieren wer Dokumente lesen und aktualisieren darf, bietet CouchDB ein simples Modell für die Validierung von Zugriffen und Aktualisierungen an. Dieses Modell kann um weitere eigene Sicherheitsmodelle erweitert werden.

source: Administrator Access
de: Adminstrationszugriff

source: CouchDB database instances have administrator accounts. Administrator accounts can create other administrator accounts and update design documents. Design documents are special documents containing view definitions and other special formulas, as well as regular fields and blobs.
de: Jede CouchDB Instanz hat Administratoraccounts. Ein Administrator kann andere Administratoraccounts anlegen und Designdokumente aktualisieren. Ein Designdokument ist ein spezielles Dokument, das zur Definition von Views genutzt wird, aber auch normale Felder und Blobs enthält.

source: Update Validation
de: Validierung von Aktualisierungen

source: As documents written to disk, they can be validated dynamically by javascript functions for both security and data validation. When the document passes all the formula validation criteria, the update is allowed to continue. If the validation fails, the update is aborted and the user client gets an error response.
de: Man kann Dokumente, während sie geschrieben werden dynamisch mit JavaScript validieren - zur Validierung der Daten und zur Sicherheit. Wenn das Dokument alle Validierungskriterien erfüllt, wird das Update weiter ausgeführt. Sollte die Validierung jedoch fehlschlagen, wird das Update abgebrochen und eine Fehlermeldung an den Client gesendet.

source: Both the user's credentials and the updated document are given as inputs to the validation formula, and can be used to implement custom security models by validating a user's permissions to update a document.
de: Die Anmeldedaten des Benutzers und das aktualisierte Dokument werden beide als Eingabe an die Validierungsfunktion gegeben. Auf diese Weise können eigene Sicherheitsmodelle für die Aktualisierung eines Dokuments implementiert werden.

source: A basic "author only" update document model is trivial to implement, where document updates are validated to check if the user is listed in an "author" field in the existing document. More dynamic models are also possible, like checking a separate user account profile for permission settings.
de: Ein simples "nur der Autor"-Aktualisierungsmodell ist trivial zu implementieren: es wird einfach geprüft, ob der Benutzer in dem "Author"-Feld des existierenden Dokuments aufgeführt ist. Aber es sind auch dynamischere Modelle möglich, z.B. die Prüfung von separaten Benutzerprofilen um den Zugriff zu erlauben.

source: The update validations are enforced for both live usage and replicated updates, ensuring security and data validation in a shared, distributed system.
de: Die Aktualisierungsvalidierungen werden für die "live"-Benutzung, als auch für replizierte Aktualisierungen erzwungen und sorgen so für Sicherheit und Datenvalidierung in einem verteiltem System.

source: Distributed Updates and Replication
de: Replikation und verteilte Aktualisierungen

source: CouchDB is a peer-based distributed database system, it allows for users and servers to access and update the same shared data while disconnected and then bi-directionally replicate those changes later.
de: CouchDB ist ein gleichwertig verteiltes Datenbank-System. Es erlaubt Benutzern und Servern die nicht verbunden sind die gleichen geteilten Daten zu bearbeiten und die vorgenommenen Änderungen dann später bidirektional zu replizieren.
