Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/intro/overview.po
Languages: de

source: The CouchDB document storage, view and security models are designed to work together to make true bi-directional replication efficient and reliable. Both documents and designs can replicate, allowing full database applications (including application design, logic and data) to be replicated to laptops for offline use, or replicated to servers in remote offices where slow or unreliable connections make sharing data difficult.
de: Der Aufbau des Dokumentenspeichers, den Views und der Sicherheit von CouchDB wurde darauf ausgelegt, um echte bidirektionale Replikation effizient und verlässlich zu gestalten. Dokumente und Designs können repliziert werden und erlaubt es komplette Applikationen in der Datenbank (bestehend aus Applikationsdarstellung, Logik und Daten) zu speichern und zu replizieren. Zum Beispiel können sie auf einen Laptop für die Offlinenutzung repliziert werden, oder auf entfernte Server auf der anderen Seite der Erde. Denn gerade bei weiten Entfernungen können langsame oder unbeständige Netzwerkverbindungen es einem schwer machen, Daten zu teilen.

source: The replication process is incremental. At the database level, replication only examines documents updated since the last replication. Then for each updated document, only fields and blobs that have changed are replicated across the network. If replication fails at any step, due to network problems or crash for example, the next replication restarts at the same document where it left off.
de: Der Replikations-Prozess ist inkrementell. Auf der Datenbank-Ebene werden vom Replikator nur Dokumente betrachtet, die seit der letzten Replikation aktualisiert wurden. Im weiteren werden aus jedem aktualisiertem Dokument nur Felder und Blobs die sich geändert haben über das Netzwerk repliziert. Wenn die Replikation z.B. wegen Netzwerk-Problemen oder einem Crash fehlschlägt, beginnt die nächste Repliaktion wieder genau beim letzten Dokument.

source: Partial replicas can be created and maintained. Replication can be filtered by a javascript function, so that only particular documents or those meeting specific criteria are replicated. This can allow users to take subsets of a large shared database application offline for their own use, while maintaining normal interaction with the application and that subset of data.
de: Es können partielle Repliken erstellt und verwaltet werden. Die Replikation kann mit einer javaScript Funktion gefiltert werden, so dass nur solche Dokumente repliziert werden, die spezielle Kriterien erfüllen. Dies ermöglicht Benutzern nur eine Teilmenge der verteilten Datenbank für den offline Gebrauch zu nutzen.

source: Conflicts
de: Konflikte

source: Conflict detection and management are key issues for any distributed edit system. The CouchDB storage system treats edit conflicts as a common state, not an exceptional one. The conflict handling model is simple and "non-destructive" while preserving single document semantics and allowing for decentralized conflict resolution.
de: Konflikte festzustellen und zu behandeln sind Kernprobleme in jedem verteilten System. CouchDB behandelt Konflikte als einen normalen Zustand, nicht als Ausnahme. Das Prinzip, Konflikte zu behandeln ist einfach gehalten und "nicht-destruktiv", es erhält die einzelnen Dokumente und erlaubt dezentralisierte Konfliktbehandlung.

source: CouchDB allows for any number of conflicting documents to exist simultaneously in the database, with each database instance deterministically deciding which document is the "winner" and which are conflicts. Only the winning document can appear in views, while "losing" conflicts are still accessible and remain in the database until deleted or purged during database compaction. Because conflict documents are still regular documents, they replicate just like regular documents and are subject to the same security and validation rules.
de: In der CouchDB können beliebig viele Dokumente, die einen Konflikt haben in der Datenbank existieren, bei dem jedem jede Datenbankinstanz deterministisch entscheidet, welches Dokument der "Gewinner" ist und welche Dokumente Konflikte haben. Nur das gewinnende Dokument kann in Views auftauchen, während die verlierenden Konfliktdokumente bis sie manuell gelöscht werden, oder von der Kompaktierung gelöscht werden, immer noch in der Datenbank verfügbar und abrufbar sind. Da konfliktierende Dokumente weiterhin reguläre Dokumente sind, können sie wie andere Dokumente repliziert werden. Außerdem gelten für sie die selben Bedingungen für Sicherheit und Validierung wie für alle anderen Dokumente.

source: When distributed edit conflicts occur, every database replica sees the same winning revision and each has the opportunity to resolve the conflict. Resolving conflicts can be done manually or, depending on the nature of the data and the conflict, by automated agents. The system makes decentralized conflict resolution possible while maintaining single document database semantics.
de: Wenn ein Konflikt beim Editieren von verteilten Daten auftritt, sieht jede der Datenbanken die selbe Revision gewinnen und hat die Möglichkeit, den Konflikt aufzuheben. Konflikte können manuell oder automatisiert aufgelöst werden, je nach Art der Daten und des Konflikt. Das System ermöglicht dezentralisierte Konfliktauflösung während es die Semantik der Dokumentdatenbank erhält.

source: Conflict management continues to work even if multiple disconnected users or agents attempt to resolve the same conflicts. If resolved conflicts result in more conflicts, the system accommodates them in the same manner, determining the same winner on each machine and maintaining single document semantics.
de: Das Konfliktmanagement funktioniert auch weiter, wenn mehrere nicht verbundene Benutzer oder Dienste versuchen den selben Konflikt zu beheben. Falls ein aufgelöster Konflikt weitere Konflikte auslöst, werden die Konflikte vom System überall auf die gleiche Weise aufgelöst. Somit gewinnen auf jedem Rechner die selben Dokumente den Konflikt und die einzelne Dokumentsemantik bleibt erhalten.

source: Applications
de: Applikationen

source: Using just the basic replication model, many traditionally single server database applications can be made distributed with almost no extra work. CouchDB replication is designed to be immediately useful for basic database applications, while also being extendable for more elaborate and full-featured uses.
de: Mit Hilfe des einfachen Replikationsmodells können viele traditionelle Applikationen, die nur eine einzelne Datenbank nutzen, mit wenig Mehraufwand zu verteilten Systemen umgerüstet werden. Die Replikation von CouchDB wurde mit dem Zweck entwickelt, schnell einen Nutzen für einfache Datenbankapplikationen zu bringen, ist aber gleichzeitig so entwickelt worden, dass sie für aufwendigere Anwendungen erweitert werden kann.

source: With very little database work, it is possible to build a distributed document management application with granular security and full revision histories. Updates to documents can be implemented to exploit incremental field and blob replication, where replicated updates are nearly as efficient and incremental as the actual edit differences ("diffs").
de: Man kann mit sehr wenig Aufwand ein verteiltes Dokumentenverwaltungssystem mit granularer Sicherheit und voller Revisionshistorie erstellen. Die Aktualisierungen an Dokumenten können so implementiert werden, dass Updates mit Hilfe von inkrementeller Feld- und Blob Replikation fast so effizient und inkrementell wie die eigentlichen Änderungen sind, die an den Dokumenten vollzogen werden (sogenannte "diffs").

source: The CouchDB replication model can be modified for other distributed update models. If the storage engine is enhanced to allow multi-document update transactions, it is possible to perform Subversion-like "all or nothing" atomic commits when replicating with an upstream server, such that any single document conflict or validation failure will cause the entire update to fail. Like Subversion, conflicts would be resolved by doing a "pull" replication to force the conflicts locally, then merging and re-replicating to the upstream server.
de: Man kann das Replikationsmodell von CouchDB modifizieren, sodass andere Modelle für das verteilte Aktualisieren von Dokumenten genutzt werden. Wenn die Speicherung um Transaktionen für mehrere Dokumente erweitert wird, ist es möglich "alles-oder-nichts"-Commits wie bei Subversion zu nutzen, bei denen ein einzelner Dokumentkonflikt oder Validierungsfehler die Aktualisierung fehlschlagen lässt. Wie bei Subversion würden Konflikte durch eine "pull"-Replikation gelöst werden, um den Konflikt lokal hervorzurufen, dann aufzulösen und die Änderungen danach an den Upstream-Server zu senden.

source: Implementation
de: Implementierung

source: CouchDB is built on the `Erlang OTP platform`_, a functional, concurrent programming language and development platform. Erlang was developed for real-time telecom applications with an extreme emphasis on reliability and availability.
de: Die Grundlage für die Entwicklung von CouchDB bildet die `Erlang OTP platform`_, eine funktionale, nebenläufige Programmiersprache und Entwicklungsumgebung. Erlang wurde für Echtzeit-Telekommunikationsanwendungen mit dem Fokus auf Verfügbarkeit und Zuverlässigkeit entwickelt.

source: Both in syntax and semantics, Erlang is very different from conventional programming languages like C or Java. Erlang uses lightweight "processes" and message passing for concurrency, it has no shared state threading and all data is immutable. The robust, concurrent nature of Erlang is ideal for a database server.
de: In seiner Semantik und auch der Syntax unterscheidet sich Erlang grundlegend von konventionellen Programmiersprachen wie C oder auch Java. Erlang benutzt leichtgewichtige "Prozesse" und das Senden von Nachrichten für Nebenläufigkeit, statt geteiltem Threading. Alle Daten sind zudem unveränderbar. Durch den Fokus auf Robustheit und Nebenläufigkeit eignet sich Erlang ausgezeichnet um Datenbankserver zu schreiben.

source: CouchDB is designed for lock-free concurrency, in the conceptual model and the actual Erlang implementation. Reducing bottlenecks and avoiding locks keeps the entire system working predictably under heavy loads. CouchDB can accommodate many clients replicating changes, opening and updating documents, and querying views whose indexes are simultaneously being refreshed for other clients, without needing locks.
de: Das Konzept von CouchDB und die Implementierung in Erlang wurde für Nebenläufigkeit, die nicht blockiert, entwickelt. Durch die Vermeidung von Flaschenhälsen und durch das Vermeiden von Blockierungen arbeitet das System auch unter hoher Last vorhersehbar. Ohne Datenbank-Locks zu nutzen kann CouchDB an viele Clients Änderungen replizieren, Dokumente öffnen und aktualisieren, und Views abrufen, deren Indizes gleichzeitig für andere Clients erneuert werden.

source: For higher availability and more concurrent users, CouchDB is designed for "shared nothing" clustering. In a "shared nothing" cluster, each machine is independent and replicates data with its cluster mates, allowing individual server failures with zero downtime. And because consistency scans and fix-ups aren’t needed on restart, if the entire cluster fails -- due to a power outage in a datacenter, for example -- the entire CouchDB distributed system becomes immediately available after a restart.
de: Um höhere Erreichbarkeit zu erreichen und mehr gleichzeitige Nutzer zu erlauben wurde CouchDB für das "shared nothing"-Clustering entwickelt. In einem "shared nothing"-Cluster ist jede Maschine unabhängig und repliziert Daten mit seinen Cluster-Kollegen, dadurch können einzelne Server in dem Cluster ausfallen, ohne einen Ausfall der Applikation hervorzurufen. Dadurch dass keine Konsitenzüberprüfungen und Reparaturen für die Daten beim Neustart durchgeführt werden müssen, wenn der gesamte Cluster ausfällt -- z.B. durch einen Stromausfall im Rechenzentrum -- ist das gesamte verteilte CouchDB System sofort nach einem Neustart erreichbar.

source: CouchDB is built from the start with a consistent vision of a distributed document database system. Unlike cumbersome attempts to bolt distributed features on top of the same legacy models and databases, it is the result of careful ground-up design, engineering and integration. The document, view, security and replication models, the special purpose query language, the efficient and robust disk layout and the concurrent and reliable nature of the Erlang platform are all carefully integrated for a reliable and efficient system.
de: CouchDB wurde von Anfang an mit der Vision von einem verteilten Datenbanksystem entwickelt. Im Gegensatz zu den umständlichen Versuchen, die Features für das verteilte System "on-top" auf die bestehende Datenbank zu setzen, ist CouchDB das Ergebnis von einem von Anfang an durchdachten Konzept, Entwicklung und Integration für eine verteilte Datenbank. Das Dokument-, View-, Sicherheits- und Replikationsmodell, die spezielle Abfragesprache, das effiziente und robuste Speicherprinzip und die nebenläufige und verlässliche Art der Erlang Plattform ergeben in der Kombination ein verlässliches und effizientes System.
