Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/intro/security.po
Languages: de

source: Security
de: Sicherheit

source: In this document, we'll look at the basic security mechanisms in CouchDB: the `Admin Party`, `Basic Authentication`, `Cookie Authentication`; how CouchDB handles users and protects their credentials.
de: In diesem Teil wollen wir uns die grundlegenden Sicherheitsmechanismen in CouchDB ansehen: die `Admin Party`, `Basic Authentication`, `Cookie Authentication`.

source: Authentication
de: Authentifizierung

source: The Admin Party
de: Die Admin Party

source: When you start out fresh, CouchDB allows any request to be made by anyone. Create a database? No problem, here you go. Delete some documents? Same deal. CouchDB calls this the `Admin Party`. Everybody has privileges to do anything. Neat.
de: Wenn man CouchDB gerade installiert hat darf jeder Request von jedem ausgeführt werden. Eine Datenbank anlegen? Kein Problem. Ein paar Dokumente löschen? Schon weg. In CouchDB nennt man das die `Admin Party`. Jeder darf alles. Nette Sache.

source: While it is incredibly easy to get started with CouchDB that way, it should be obvious that putting a default installation into the wild is adventurous. Any rogue client could come along and delete a database.
de: Während es unglaublich einfach ist, so mit CouchDB zu starten, so sollte es ebenfalls klar sein, das eine solche Installation nicht ins Internet gehört. Jeder böswillige oder schlecht geschriebene Client kann vorbeikommen und mal eben eine Datenbank löschen.

source: A note of relief: by default, CouchDB will listen only on your loopback network interface (``127.0.0.1`` or ``localhost``) and thus only you will be able to make requests to CouchDB, nobody else. But when you start to open up your CouchDB to the public (that is, by telling it to bind to your machine's public IP address), you will want to think about restricting access so that the next bad guy doesn't ruin your admin party.
de: Immerhin nutzt CouchDB standardmäßig nur das Loopback Interface (``127.0.0.1`` oder ``localhost``). Somit kann man nur selber mit CouchDB sprechen und niemand sonst. Doch irgendwann wird die CouchDB Instanz an das offene Internet angeschlossen (z.B. indem CouchDB an der öffentlichen IP Adresse lauscht) und spätestens dann möchte man den Zugriff beschränken, damit die Admin Party nicht mutwillig zerstört wird.

source: In our previous discussions, we dropped some keywords about how things without the `Admin Party` work. First, there's *admin* itself, which implies some sort of super user. Then there are *privileges*. Let's explore these terms a little more.
de: In den vorangegangen Kapiteln haben wir immer mal wieder erwähnt, wie man CouchDB ohne `Admin Party` betreibt. Zunächst gibt es den *admin*, der eine Art von Superuser beschreibt. Dann gibt es Privilegien. Schauen wir uns das genauer an.

source: CouchDB has the idea of an *admin user* (e.g. an administrator, a super user, or root) that is allowed to do anything to a CouchDB installation. By default, everybody is an admin. If you don't like that, you can create specific admin users with a username and password as their credentials.
de: CouchDB kennt das Konzept eines *Administrators* (oder auch Admin User, Super User bzw. root), der innerhalb einer CouchDB Installation alles darf. In der Standardeinstellung ist jeder Benutzer ein Administrator. Falls das nicht gewünscht ist, kann man bestimmte Administratorkonten mit Benutzername und Passwort anlegen.

source: CouchDB also defines a set of requests that only admin users are allowed to do. If you have defined one or more specific admin users, CouchDB will ask for identification for certain requests:
de: Des weiteren gibt es eine Gruppe von Requests, die ausschließlich Administratoren vorbehalten sind. Wird ein solcher Request durchgeführt und Administrator Konten sind angelegt, so fragt CouchDB nach der Authentifizierung:

source: Creating a database (:put:`PUT /database </{db}>`)
de: Datenbank anlegen (:put:`PUT /database </{db}>`)

source: Deleting a database (:put:`DELETE /database </{db}>`)
de: Datenbank löschen (:put:`DELETE /database </{db}>`)

source: Setup a database security (:put:`PUT /database/_security </{db}/_security>`)
de: Sicherheitseinstellungen der Datenbank einrichten (:put:`PUT /database/_security </{db}/_security>`)

source: Creating a design document (:put:`PUT /database/_design/app </{db}/_design/{ddoc}>`)
de: Designdokument anlegen (:put:`PUT /database/_design/app </{db}/_design/{ddoc}>`)

source: Updating a design document (:put:`PUT /database/_design/app?rev=1-4E2 </{db}/_design/{ddoc}>`)
de: Designdokumente aktualisieren (:put:`PUT /database/_design/app?rev=1-4E2 </{db}/_design/{ddoc}>`)

source: Deleting a design document (:delete:`DELETE /database/_design/app?rev=2-6A7 </{db}/_design/{ddoc}>`)
de: Designdokumente löschen (:delete:`DELETE /database/_design/app?rev=2-6A7 </{db}/_design/{ddoc}>`)

source: Execute a temporary view (:post:`POST /database/_temp_view </{db}/_temp_view>`)
de: Temporären View ausführen (:post:`POST /database/_temp_view </{db}/_temp_view>`)

source: Triggering compaction (:post:`POST /database/_compact </{db}/_compact>`)
de: Compaction auslösen (:post:`POST /database/_compact </{db}/_compact>`)

source: Reading the task status list (:get:`GET /_active_tasks </_active_tasks>`)
de: Taskliste lesen (:get:`GET /_active_tasks </_active_tasks>`)

source: Restarting the server (:post:`POST /_restart </_restart>`)
de: Neustarten des Servers (:post:`POST /_restart </_restart>`)

source: Reading the active configuration (:get:`GET /_config </_config>`)
de: Lesen der aktiven Konfiguration (:get:`GET /_config </_config>`)

source: Updating the active configuration (:put:`PUT /_config/section/key </_config/{section}/{key}>`)
de: Aktualisierung der aktiven Konfiguration (:put:`PUT /_config/section/key </_config/{section}/{key}>`)

source: Creating New Admin User
de: Einen neuen Admin User anlegen

source: Let's do another walk through the API using `curl` to see how CouchDB behaves when you add admin users.
de: Wir schauen uns noch einmal das API an und benutzen `curl` um zu sehen wie CouchDB sich verhält, wenn wir Administratoren hinzufügen.

source: When starting out fresh, we can add a database. Nothing unexpected. Now let's create an admin user. We'll call her ``anna``, and her password is ``secret``. Note the double quotes in the following code; they are needed to denote a string value for the :ref:`configuration API <api/config>`::
de: Wenn wir mit einer neuen CouchDB Installation starten, können wir eine Datenbank hinzufügen, das ist nichts Neues. Wir legen nun eine Administratorin an, die wir ``anna`` nennen. Ihr Passwort ist: ``secret``. Achte auf die doppelten Anführungszeichen in dem nun folgenden Code, sie werden benötigt, um in :ref:`configuration API <api/config>` einen String zu kennzeichnen::

source: As per the :ref:`_config <api/config>` API's behavior, we're getting the previous value for the config item we just wrote. Since our admin user didn't exist, we get an empty string.
de: Gemäß dem Verhalten des :ref:`_config <api/config>` APIs erhalten wir den vorherigen Wert des geänderten Parameters als Ergebnis zurück. Da unser Administrator noch nicht existiert hat, bekommen wir einen leeren String zurück.

source: Hashing Passwords
de: Passwort Hashing

source: Seeing the plain-text password is scary, isn't it? No worries, CouchDB doesn't show up the plain-text password anywhere. It gets hashed right away. The hash is that big, ugly, long string that starts out with ``-hashed-``. How does that work?
de: Das Passwort im Klartext zu sehen macht ein wenig nervös, oder? Doch keine Sorge. Wenn der Log Level nicht auf debug steht, tauchen Passwörter nirgendwo im Klartext auf, sondern werden gleich gehasht. Der Hash ist die lange unhandliche Zeichenkette, die mit ``-hashed-`` beginnt. Doch wie wird die angelegt?

source: Creates a new 128-bit UUID. This is our *salt*.
de: Erzeuge eine neue 128-bit UUID. Das ist unser *salt*.

source: Creates a sha1 hash of the concatenation of the bytes of the plain-text password and the salt ``(sha1(password + salt))``.
de: Erzeuge einen SHA-1 Hash vom Klartext-Passwort und dem Salt ``(sha1(password + salt))``.

source: Prefixes the result with ``-hashed-`` and appends ``,salt``.
de: Stelle dem Ergebnis ``-hashed-`` voran und hänge ``,salt`` hinten an.

source: To compare a plain-text password during authentication with the stored hash, the same procedure is run and the resulting hash is compared to the stored hash. The probability of two identical hashes for different passwords is too insignificant to mention (c.f. `Bruce Schneier`_). Should the stored hash fall into the hands of an attacker, it is, by current standards, way too inconvenient (i.e., it'd take a lot of money and time) to find the plain-text password from the hash.
de: Um ein Klartext-Passwort während der Authentifizierung mit dem gespeicherten Hashwert zu vergleichen, wird die gleiche Prozedur noch einmal durchgeführt und der errechnete Hashwert mit dem gespeicherten Wert verglichen. Die Wahrscheinlichkeit, dass zwei Hashwerte kollidieren kann man vernachlässigen (vgl. auch Bruce Schneier). Sollte der gespeicherte Hashwert einem Angreifer in die Hände fallen, so ist es nach heutigem Stand der Technik zu aufwändig, das dazugehörige Klartext-Passwort zu finden (d.h. es ist zu teuer und es dauert zu lange).

source: But what's with the ``-hashed-`` prefix? When CouchDB starts up, it reads a set of `.ini` files with config settings. It loads these settings into an internal data store (not a database). The config API lets you read the current configuration as well as change it and create new entries. CouchDB is writing any changes back to the `.ini` files.
de: Doch was hat es mit dem ``-hashed-`` Präfix auf sich? Erinnern wir uns, wie das Configuration API funktioniert. Wenn CouchDB startet, werden eine Gruppe von `.ini` Dateien mit Konfigurationseinstellungen gelesen. Diese werden in eine interne Datenstruktur (keine Datenbank) geladen. Mit dem Configuration API kann man die aktuelle Konfiguration auslesen, ändern und neue Werte anlegen. CouchDB schreibt die Änderungen dann zurück in die `.ini` Dateien.

source: The `.ini` files can also be edited by hand when CouchDB is not running. Instead of creating the admin user as we showed previously, you could have stopped CouchDB, opened your `local.ini`, added ``anna = secret`` to the :config:section:`admins`, and restarted CouchDB. Upon reading the new line from `local.ini`, CouchDB would run the hashing algorithm and write back the hash to `local.ini`, replacing the plain-text password. To make sure CouchDB only hashes plain-text passwords and not an existing hash a second time, it prefixes the hash with ``-hashed-``, to distinguish between plain-text passwords and hashed passwords. This means your plain-text password can't start with the characters ``-hashed-``, but that's pretty unlikely to begin with.
de: Die `.ini` Dateien können auch von Hand geändert werden, wenn CouchDB nicht läuft. Um ein Administrator Konto anzulegen, können wir auch CouchDB stoppen, die `local.ini` Datei öffnen, einen Eintrag ``anna = secret`` unter :config:section:`admins` hinzufügen und CouchDB wieder starten. Nach dem Neustart liest CouchDB den neuen Eintrag der `local.ini` Datei, berechnet den Hashwert des Passworts und schreibt die Änderung zurück in die `local.ini` Datei. Dabei wird der ursprüngliche Eintrag ersetzt. Damit CouchDB Passwörter nur einmal hasht, bekommen bereits gehashete Passwörter den ``-hashed-`` Präfix. So kann CouchDB sie von Klartext-Passwörtern unterscheiden. Das bedeutet zwar, dass ein Passwort nicht mit ``-hashed-`` beginnen kann, doch das ist sowieso eher unwahrscheinlich.

source: Since :ref:`1.3.0 release <release/1.3.0>` CouchDB uses ``-pbkdf2-`` prefix by default to sign about using `PBKDF2`_ hashing algorithm instead of `SHA1`.
de: Seit dem :ref:`1.3.0 release <release/1.3.0>` benutzt CouchDB standardmäßig das ``-pbkdf2-`` Prefix um den `PBKDF2`_ Algorithmus zu signalisieren, anstatt `SHA1`.

source: Now that we have defined an admin, CouchDB will not allow us to create new databases unless we give the correct admin user credentials. Let's verify::
de: Nachdem wir einen Administrator angelegt haben, erlaubt es uns CouchDB nicht länger neue Datenbanken anzulegen ohne uns korrekt zu authentifizieren. Überprüfen wir das einmal::

source: That looks about right. Now we try again with the correct credentials::
de: Das sieht soweit gut aus. Jetzt noch einmal mit Benutzername und Passwort::

source: If you have ever accessed a website or FTP server that was password-protected, the ``username:password@`` URL variant should look familiar.
de: Falls du schon einmal auf einer passwortgeschützten Webseite oder FTP Server warst, sollte dir der ``username:password@`` Teil in der URL bekannt vorkommen.

source: If you are security conscious, the missing ``s`` in ``http://`` will make you nervous. We're sending our password to CouchDB in plain text. This is a bad thing, right? Yes, but consider our scenario: CouchDB listens on ``127.0.0.1`` on a development box that we're the sole user of. Who could possibly sniff our password?
de: Ist Sicherheit wichtig, sollte das Fehlen von HTTPS Nervosität erzeugen. Immerhin wird das Passwort im Klartext an CouchDB übertragen. Das ist in der Regel nicht so gut. Im aktuellen Fall ist es jedoch nicht ganz so schlimm, weil CouchDB auf ``127.0.0.1`` auf unserer eigenen Maschine lauscht. Wer sollte dort das Passwort mitlesen können?

source: If you are in a production environment, however, you need to reconsider. Will your CouchDB instance communicate over a public network? Even a LAN shared with other collocation customers is public. There are multiple ways to secure communication between you or your application and CouchDB that exceed the scope of this documentation. CouchDB as of version :ref:`1.1.0 <release/1.1.0>` comes with :ref:`SSL built in <config/ssl>`.
de: In einer Produktionsumgebung sieht das anders aus. Soll CouchDB über das öffentliche Internet oder über ein internes LAN erreichbar sein? Auch eine Instanz, die auf einem Server liegt, den man sich mit anderen teilt ist öffentlich. Es gibt mehrere Wege die Kommunikation zwischen ihrer Anwendung und CouchDB zu sichern, die jedoch dieser Dokumentation sprengen. CouchDB in Version :ref:`1.1.0 <release/1.1.0>` kommt mit :ref:`eingebautem SSL <config/ssl>`.

source: :ref:`Basic Authentication API Reference <api/auth/basic>`
de: :ref:`Basic Authentication API Referenz <api/auth/basic>`

source: Cookie Authentication
de: Cookie Authentifizierung

source: Basic authentication that uses plain-text passwords is nice and convenient, but not very secure if no extra measures are taken. It is also a very poor user experience. If you use basic authentication to identify admins, your application's users need to deal with an ugly, unstylable browser modal dialog that says non-professional at work more than anything else.
de: Basic Authentication mit Klartext-Passwörtern ist zwar einfach zu handhaben, ohne zusätzliche Sicherheitsmassnahmen jedoch nicht besonders sicher. Zudem ist die User Experience nicht besonders elegant, da der Browser ein einfaches Dialogfeld ohne jeden Schmuck einblendet auf das man als Entwickler keinen Einfluss hat. Damit zeigt man auch das hier nicht gerade Profis am Werk sind.

source: To remedy some of these concerns, CouchDB supports cookie authentication. With cookie authentication your application doesn't have to include the ugly login dialog that the users' browsers come with. You can use a regular HTML form to submit logins to CouchDB. Upon receipt, CouchDB will generate a one-time token that the client can use in its next request to CouchDB. When CouchDB sees the token in a subsequent request, it will authenticate the user based on the token without the need to see the password again. By default, a token is valid for 10 minutes.
de: Um die Situation zu verbessern unterstützt CouchDB Cookie Authentifizierung. Mit Cookie Authentifizierung muss ihre Anwendung nicht den hässlichen Login Dialog des Browsers nutzen, sondern man nutzt stattdessen ein normales HTML Formular um die Login Daten an CouchDB zu übertragen. Stimmen die Daten erzeugt CouchDB ein eindeutiges Token, welches der Client bei den nächsten Requests anstelle des Benutzernamens und Passwort nutzen kann. Das Token ist dann standardmäßig für 10 Minuten gültig.

source: To obtain the first token and thus authenticate a user for the first time, the username and password must be sent to the :ref:`_session <api/auth/session>` API. The API is smart enough to decode HTML form submissions, so you don't have to resort to any smarts in your application.
de: Um das erste Token zu erhalten und damit den Benutzer das erste Mal zu authentifizieren, schickt man den Benutzernamen und das Passwort an das :ref:`_session <api/auth/session>` API. Das API versteht Daten, die von einem HTML Form kommen automatisch, sodass man in der Anwendung nichts Besonderes machen muss.

source: If you are not using HTML forms to log in, you need to send an HTTP request that looks as if an HTML form generated it. Luckily, this is super simple::
de: Nutzt man keine HTML Formulare muss man lediglich einen HTTP Request schicken, der so aussieht als käme er von einem HTML Formular. Glücklicherweise ist das kein großer Aufwand::

source: CouchDB replies, and we'll give you some more detail::
de: CouchDB antwortet::

source: A :statuscode:`200` response code tells us all is well, a :header:`Set-Cookie` header includes the token we can use for the next request, and the standard JSON response tells us again that the request was successful.
de: Eine Antwort mit dem HTPP Statuscode :statuscode:`200` sagt uns, dass alles in Butter ist und ein :header:`Set-Cookie` Header enthält den Token, den wir im nächsten Request benutzen können. Auch die JSON Antwort zeigt, dass der Request erfolgreich war.

source: Now we can use this token to make another request as the same user without sending the username and password again::
de: Nun können wir mit diesem Token einen weiteren Request abschicken und müssen dabei nicht den Benutzernamen und das Passwort mitschicken::

source: You can keep using this token for 10 minutes by default. After 10 minutes you need to authenticate your user again. The token lifetime can be configured with the timeout (in seconds) setting in the :ref:`couch_httpd_auth <config/couch_httpd_auth>` configuration section.
de: Wir können dieses Token standardmäßig für 10 Minuten nutzen. Nach Ablauf der 10 Minuten muss sich der Benutzer erneut bei CouchDB authentifizieren. Die Gültigkeitsdauer des Tokens kann man im timeout Parameter des :ref:`couch_httpd_auth <config/couch_httpd_auth>` Bereichs ändern.

source: :ref:`Cookie Authentication API Reference <api/auth/cookie>`
de: :ref:`Cookie Authentication API Referenz <api/auth/cookie>`

source: Authentication Database
de: Authentifizierungsdatenbank

source: You may already note, that CouchDB administrators are defined within config file and you now wondering does regular users are also stored there. No, they don't. CouchDB has special `authentication database` -- ``_users`` by default -- that stores all registered users as JSON documents.
de: Wie wir bereits gesehen haben, werden CouchDB Administratoren in der Konfigurationsdatei definiert, nun stellt sich sicher die Frage, wo reguläre Benutzer definiert werden. CouchDB hat eine spezielle `Authentifizierungsdatenbank` (authentication database) -- sie hat standardmäßig den Namen ``_users`` und speichert alle registrierten Benutzer als JSON Dokumente.

source: CouchDB uses special database (called ``_users`` by default) to store information about registered users. This is a `system database` -- this means that while it shares common :ref:`database API <api/database>`, there are some special security-related constraints applied and used agreements on documents structure. So how `authentication database` is different from others?
de: Um Informationen über registrierte Benutzer zu speichern benutzt CouchDB eine spezielle Datenbank (Standardname: ``_users``). Dies ist eine `System Datenbank` -- das bedeutet zwar auch, dass es das :ref:`database API <api/database>` teilt, aber es gibt einige spezielle sicherheitsrelevante Einschränkungen bezüglich der Dokumentenstruktur. Wie unterscheidet sich jetzt die `Authentifizierungsdatenbank` von den anderen?

source: Only administrators may browse list of all documents (:get:`GET /_users/_all_docs </{db}/_all_docs>`)
de: Nur Adminstratoren dürfen die Liste aller Dokumente durchstöbern (:get:`GET /_users/_all_docs </{db}/_all_docs>`)

source: Only administrators may listen :ref:`changes feed <changes>` (:get:`GET /_users/_changes </{db}/_changes>`)
de: Nur Administratoren dürfen den :ref:`changes feed <changes>` (:get:`GET /_users/_changes </{db}/_changes>`) lesen

source: Only administrators may execute design functions like :ref:`views <viewfun>`, :ref:`shows <showfun>` and :ref:`others <ddocs>`
de: Nur Administratoren dürfen Design Functionen, wie :ref:`views <viewfun>`, :ref:`shows <showfun>` und :ref:`others <ddocs>` ausführen

source: Only administrators may :method:`GET`, :method:`PUT` or :method:`DELETE` any document (to be honest, that they always can do)
de: Nur Administratoren dürfen :method:`GET`, :method:`PUT` oder :method:`DELETE` Requests an jedes Dokuments stellen (um ehrlich zu sein, sie dürfen dies überall)

source: There is special design document ``_auth`` that cannot be modified
de: Das besondere Design Dokument ``_auth`` kann nicht modifiziert werden

source: Every document (of course, except `design documents`) represents registered CouchDB users and belong to him
de: Jedes Dokument (natürlich außer den `Design Dokumenten`) repräsentiert einen registrierten Benutzer und gehört dem Benutzer

source: Users may only access (:get:`GET /_users/org.couchdb.user:Jan </{db}/{docid}>`) or modify (:put:`PUT /_users/org.couchdb.user:Jan </{db}/{docid}>`) documents that they owns
de: Benutzer dürfen nur auf Dokumente zugreifen (:get:`GET /_users/org.couchdb.user:Jan </{db}/{docid}>`) oder sie modifizieren (:put:`PUT /_users/org.couchdb.user:Jan </{db}/{docid}>`) wenn sie ihnen gehören

source: These draconian rules are reasonable: CouchDB cares about user's personal information and doesn't discloses it for everyone. Often, users documents are contains not only system information like `login`, `password hash` and `roles`, but also sensitive personal information like: real name, email, phone, special internal identifications and more - this is not right information that you want to share with the World.
de: Für diese harten Regeln gibt es einen Grund: CouchDB gibt Acht auf persönliche Informationen der Benutzer und teilt sie nicht mit jedermann. Oft sind in Benutzerdokumenten mehr Informationen als `login`, `Passwort Hash` und `Rollen`, zum Beispiel persönliche Informationen wie realer Name, E-Mailadresse, Telefonnummer, besondere interne Identifikationsmerkmale und vieles mehr - Informationen die man nicht mit der ganzen Welt teilen möchte.

source: Users Documents
de: Benutzerdokumente

source: Each CouchDB user is stored in document format. These documents are contains several *mandatory* fields, that CouchDB handles for correct authentication process:
de: Jeder CouchDB-Benutzer wird als Dokument gespeichert. Diese Dokumente haben einige *Pflichtfelder*, sodass CouchDB den Benutzer korrekt authentifizieren kann:

source: **_id** (*string*): Document ID. Contains user's login with special prefix :ref:`org.couchdb.user`
de: **_id** (*string*): Dokument-ID. Enthält die Logindaten des Benutzers mit einem besonderem Prefix :ref:`org.couchdb.user`
