Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/intro/security.po
Languages: de

source: **derived_key** (*string*): `PBKDF2`_ key
de: **derived_key** (*string*): `PBKDF2`_ Schlüssel

source: **name** (*string*): User's name aka login. **Immutable** e.g. you cannot rename existed user - you have to create new one
de: **name** (*string*): Benutzername oder auch Loginname. **Immutable** also unveränderbar, d.h. man kann bestehende Benutzer nicht umbenennen, sondern muss einen neuen anlegen

source: **roles** (*array* of *string*): List of user roles. CouchDB doesn't provides any builtin roles, so you're free to define your own depending on your needs. However, you cannot set system roles like ``_admin`` there. Also, only administrators may assign roles to users - by default all users have no roles
de: **roles** (*array* of *string*): Liste der Benutzerrollen. CouchDB bietet keine vorinstallierten Rollen, man hat aber allen Freiraum um sich eigene Rollen zu definieren. Man kann aber trotzdem keine Systemrollen wir ``_admin`` hier definieren. Zusätzlich dürfen nur administrative Accounts dem Benutzer Rollen zuweisen - standardmäßig hat kein Benutzer eine Rolle

source: **password_sha** (*string*): Hashed password with salt. Used for ``simple`` `password_scheme`
de: **password_sha** (*string*): Gehashtes Passwort mit Salt. Wird für das ``simple`` `password_scheme` benutzt

source: **password_scheme** (*string*): Password hashing scheme. May be ``simple`` or ``pbkdf2``
de: **password_scheme** (*string*): Password Hashing Schema. Kann ``simple`` oder ``pbkdf2`` sein

source: **salt** (*string*): Hash salt. Used for ``simple`` `password_scheme`
de: **salt** (*string*): Hash Salt. Wird für ``simple`` `password_scheme` benutzt

source: **type** (*string*): Document type. Constantly have value ``user``
de: **type** (*string*): Typ des Dokuments. Hat stets den Wert ``user``

source: Additionally, you may specify any custom fields that are relates to the target user. This is good place to store user's private information because only he and CouchDB administrators may browse it.
de: Zusätzlich kann man andere, selbst definierte Felder für den Benutzer definieren. Es ist ein guter Platz um private Benutzerdaten zu speichern, da nur der Benutzer und die CouchDB Administratoren sie anzeigen dürfen.

source: Why ``org.couchdb.user:`` prefix?
de: Warum das ``org.couchdb.user:`` Prefix?

source: The reason to have special prefix before user's login name is to have namespaces which users are belongs to. This prefix is designed to prevent replication conflicts when you'll try to merge two `_user` databases or more.
de: Durch ein spezielles Prefix vor dem Benutzernamen werden Namespaces erstellt, durch die klar ist, wohin ein Benutzer gehört. Dadurch werden Replikationskonflikte vermieden wenn man versucht, zwei oder mehr `_user` Datenbanken zusammenzuführen.

source: For current CouchDB releases, all users are belongs to the same ``org.couchdb.user`` namespace and this cannot be changed, but we'd made such design decision for future releases.
de: Für derzeitige CouchDB Versionen gehören alle Benutzer zu dem selben Namespace ``org.couchdb.user``. Dies kann zur Zeit nicht verändert werden, aber wir haben die Vorbereitung schon für spätere Versionen getroffen.

source: Creating New User
de: Neue Benutzer anlegen

source: Creating new user is a very trivial operation. You need just to send single :method:`PUT` request with user's data to CouchDB. Let's create user with login `jan` and password `apple`::
de: Einen neuen Benutzer anzulegen ist leicht. Wir müssen nur einen :method:`PUT` Request mit den Benutzerdaten an CouchDB senden. Lass uns einen Benutzer mit dem Login `jan` und dem Passwort `apple` anlegen::

source: This `curl` command will produce next HTTP request:
de: Dieser `curl` Befehl erzeugt den folgenden HTTP request:

source: And CouchDB responds with:
de: Und CouchDB antwortet mit:

source: Document successfully created what also means that user `jan` have created too! Let's check is this true::
de: Dokument erfolgreich angelegt. Das heißt auch, der Benutzer `jan` wurde angelegt! Lass uns prüfen, ob das stimmt::

source: CouchDB should respond with:
de: CouchDB sollte damit antworten:

source: Which means that username was recognized and password's hash matches with stored one. If we specify wrong login and/or password, CouchDB will notify us with the next error message:
de: Was bedeutet dass der Benutzername gefunden wurde und dass der Passwort-Hash mit dem gespeicherten übereinstimmt. Wenn wir einen falschen Login und/oder Passwort angeben, wird CouchDB uns mit dieser Fehlermeldung davon in Kenntnis setzen:

source: Password Changing
de: Wechsel des Passworts

source: This is quite common situation: user had forgot his password, it was leaked somehow (via copy-paste, screenshot, or by typing in wrong chat window) or something else. Let's change password for our user `jan`.
de: Oft vergessen Benutzer ihr Passwort, oder es wird irgendwie bekannt (copy-paste, Screenshot oder durch versehentliches tippen in ein falsches Chatfenster), oder man möchte das Passwort aus anderen Gründen ändern. Wir werden das Passwort für unseren Benutzer `jan` ändern.

source: First of all, let's define what is the password changing from the point of CouchDB and the authentication database. Since "users" are "documents", this operation is nothing, but updating the document with special field ``password`` which contains the *plain text password*. Scared? No need to: the authentication database has special internal hook on document update which looks for this field and replaces it with the *secured hash*, depending on chosen ``password_scheme``.
de: Lass uns erst einmal überlegen, was der Wechsel des Passworts aus der Sicht der Authentifizierungsdatenbank und von CouchDB ist: da "Benutzer" auch nur "Dokumente" sind ist diese Operation nicht besonderes, außer dass wir das Dokument mit dem speziellen Feld ``password`` aktualisieren, welches das *Klartext-Passwort* enthält. Verunsichert? Keine Bange! Die Authentifizierungsdatenbank besitzt einen internen Mechanismus, der bei dem Aktualisieren des Dokuments nach diesem Feld sucht und es mit dem *sicheren Hashwert* ersetzt, abhängig davon was in ``password_scheme`` konfiguriert wurde.

source: Summarizing above, we need to get document content, add ``password`` field with new plain text password value and store JSON result to the authentication database.
de: Zusammenfassung: wir benötigen wir den Dokumenteninhalt, fügen ein Attribut ``password`` mit einem Klartext-Passwort hinzu und senden das Ergebnis an die Authentifizierungsdatenbank.

source: Here is our user's document. We may strip hashes from stored document to reduce amount of posted data::
de: Hier sehen wir unser Benutzerdokument. Wir können die Hashes vom gespeicherten Dokument entfernen um die Menge der gesendeten Daten zu reduzieren::

source: Updated! Now let's check that password was really changed::
de: Das Dokument wurde erfolgreich aktualisiert. Nun prüfen wir, ob das Passwort wirklich geändert wurde::

source: Looks like the password ``apple`` is wrong, what about ``orange``?
de: Das Passwort ``apple`` scheint falsch zu sein, wie steht es mit dem Passwort ``orange``?

source: Hooray! You may wonder why so complex: need to retrieve user's document, add special field to him, post it back - where is one big button that changes the password without worry about document's content? Actually, :ref:`Futon <intro/futon>` has such at the right bottom corner if you have logged in - all implementation details are hidden from your sight.
de: Juhu! Falls du dich fragst, ob das nicht auch einfacher geht, ohne Lesen des Benutzerdokuments, Feld hinzufügen und zurücksenden - vielleicht einfach nur mit einem großen Knopf, bei dem man sich keine Sorgen um den Inhalt des Dokuments machen muss: :ref:`Futon <intro/futon>` hat genau so einen Button in der rechten, unteren Ecke, wenn man sich eingeloggt hat - hinter dem Knopf sind alle Implementierungsdetails vor unseren Augen versteckt.

source: There is no password confirmation for API request: you should implement it on your application layer like Futon does.
de: Es gibt keine Bestätigung für das Passwort bei dem API Request: dieser sollte in der jeweiligen Applikation implementiert werden, wie bei Futon.

source: Users Public Information
de: Öffentliche Benutzerinformationen

source: Sometimes users *wants* to share some information with the World. For instance, their contact email to let other users get in touch with him. To solve this problem, but still keep sensitive and private information secured there is special :ref:`configuration <config>` option :config:option:`public_fields <couch_httpd_auth/public_fields>`. In this options you may define comma separated list of users document fields that will be publicity available.
de: Manchmal *möchte* der Benutzer einige Informationen mit der ganzen Welt teilen. Zum Beispiel die E-Mailadresse, damit andere Benutzer ihn kontaktieren können. Um dieses Problem zu lösen, aber trotzdem sensible und private Informationen zu schützen gibt es die :ref:`configuration <config>` Option :config:option:`public_fields <couch_httpd_auth/public_fields>`. Mit Hilfe dieser Option kann man Komma separiert Attribute des Benutzerdokuments definieren, die dann öffentlich zugänglich sind,

source: Normally, if you request any user's document and you're not administrator or this document owner, CouchDB will respond with :statuscode:`404`::
de: Wenn man ein Benutzerdokument anfordert und weder Administrator, noch Besitzer des Dokuments ist, antwortet CouchDB mit :statuscode:`404`::

source: This response is constant for both cases when user exists or not exists - by security reasons.
de: Dies gilt jeweils für die Fälle bei denen der Benutzer existiert oder nicht existiert - aus Sicherheitsgründen.

source: Now let's share field ``name``. First, setup the ``public_fields`` configuration option. Remember, that this action requires administrator's privileges and the next command will ask for password for user `admin`, assuming that he is the server administrator::
de: Lass uns das Feld ``name`` teilen. Wir konfigurieren die ``public_fields`` Option. Achtung, hierfür werden Administratorenrechte benötigt. Nehmen wir an, der Benutzer `admin` ist ein Serveradministrator, denn nächste Befehl wird nach dem Passwort für den Benutzer `admin` verlangen::

source: What have changed? Let's check Robert's document once again::
de: Was hat sich geändert? Lass uns Robert's Dokument noch einmal anschauen::

source: Good news! Now we may read field ``name`` from *every user's document without need to be an administrator*. That's important note: don't publish sensitive information, especially without user's acknowledge - they may not like such actions from your side.
de: Sieht gut aus! Nun dürfen wir das Feld ``name`` aus *jedem Benutzderdokument lesen, ohne Administrationsrechte zu haben*. Wichtige Info: publiziere keine sensitiven Informationen, besonders nicht ohne die Einwilligung deiner Benutzer - möglicherweise mögen sie es nicht.
