Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/intro/tour.po
Languages: de

source: Getting Started
de: Loslegen

source: In this document, we'll take a quick tour of CouchDB's features, familiarizing ourselves with Futon, the built-in administration interface. We'll create our first document and experiment with CouchDB views.
de: In diesem Dokument werfen wir einen kurzen Blick auf die Features von CouchDB und machen uns mit Futon vertraut, dem integrierten Administrationsinterface für CouchDB: wir werden unser erstes Dokument erzeugen und mit CouchDB Views experimentieren.

source: All Systems Are Go!
de: Lasst uns beginnen!

source: We'll have a very quick look at CouchDB's bare-bones Application Programming Interface (API) by using the command-line utility curl. Please note that this is not the only way of talking to CouchDB. We will show you plenty more throughout the rest of the documents. What's interesting about curl is that it gives you control over raw HTTP requests, and you can see exactly what is going on "underneath the hood" of your database.
de: Wir werden einen kurzen Blick auf die nackte Schnittstelle (API) von CouchDB mit dem Kommandozeilenprogramm curl. Bitte beachte dass dies nicht die einzige Möglichkeit ist, mit CouchDB zu kommunizieren. Wir zeigen dir weitere Möglichkeiten im Verlauf dieses Tutorials. Das Interessante an curl ist, dass es dir volle Kontrolle über die HTTP Requests gibt, sodass du genau sehen kannst, was "unter der Haube" in deiner Datenbank passiert.

source: Make sure CouchDB is still running, and then do::
de: Versichere dich, dass CouchDB noch läuft und gebe ein:

source: This issues a GET request to your newly installed CouchDB instance.
de: Dies löst einen GET Request zu deiner neu installierten CouchDB aus.

source: The reply should look something like:
de: Die Antwort sollte ungefähr so aussehen:

source: Not all that spectacular. CouchDB is saying "hello" with the running version number.
de: Nicht wirklich spektakulär. CouchDB sagt uns "Hallo" mit der zur Zeit laufenden Versionsnummer.

source: Next, we can get a list of databases::
de: Als nächstes können wir eine Liste aller Datenbanken anfordern::

source: All we added to the previous request is the _all_dbs string.
de: Zum vorherigen Request haben wir nur den _all_dbs String hinzugefügt.

source: The response should look like::
de: Die Antwort sollte so aussehen::

source: Oh, that's right, we didn't create any databases yet! All we see is an empty list.
de: Oh, okay: wir haben bis jetzt noch keine Datenbanken angelegt. Alles was wir sehen ist eine leere Liste.

source: The curl command issues GET requests by default. You can issue POST requests using ``curl -X POST``. To make it easy to work with our terminal history, we usually use the ``-X`` option even when issuing GET requests. If we want to send a POST next time, all we have to change is the method.
de: Der curl Befehl führt standardmäßig GET Requests aus. Du kannst POST Requests mit ``curl -X POST`` verschicken. Damit du einfacher mit deiner Terminal-History arbeiten kannst, benutzen wir normalerweise die ``-X`` Option, auch wenn wir nur GET Requests senden. Wenn wir das nächste mal einen POST abschicken wollen, müssen wir nur die HTTP-Method ändern.

source: HTTP does a bit more under the hood than you can see in the examples here. If you're interested in every last detail that goes over the wire, pass in the ``-v`` option (e.g., ``curl -vX GET``), which will show you the server curl tries to connect to, the request headers it sends, and response headers it receives back. Great for debugging!
de: HTTP macht unter der Haube ein wenig mehr als du hier in den Beispielen sehen kann. Wenn dich jedes Detail, das über die Leitung geht, interessiert, dann gebe einfach die ``-v``Option (z.B. ``curl -vX GET``) an. Mit Hilfe dieser Option wird der Server angezeigt, mit dem curl versucht in Verbindung zu treten, die Request-Header, die das Programm sendet und die Response Header, die empfangen werden. Dies ist vor allem für das Debugging nützlich.

source: Let's create a database::
de: Lass uns eine Datenbank anlegen::

source: CouchDB will reply with::
de: CouchDB wird antworten::

source: Retrieving the list of databases again shows some useful results this time::
de: Wenn wir nun die Liste der Datenbanken noch einmal anfordern, werden uns nützliche Ergebnisse angezeigt::

source: We should mention JavaScript Object Notation (JSON) here, the data format CouchDB speaks. JSON is a lightweight data interchange format based on JavaScript syntax. Because JSON is natively compatible with JavaScript, your web browser is an ideal client for CouchDB.
de: Wir sollten an dieser Stelle das Datenformat von CouchDB erwähnen: JavaScript Object Notation (JSON). JSON ist ein leichtgewichtiges Format für den Datenaustausch, welches auf der JavaScript Syntax basiert. Weil JSON nativ mit JavaScript kompatibel ist, ist dein Browser der ideale Client für CouchDB.

source: Brackets (``[]``) represent ordered lists, and curly braces (``{}``) represent key/value dictionaries. Keys must be strings, delimited by quotes (``"``), and values can be strings, numbers, booleans, lists, or key/value dictionaries. For a more detailed description of JSON, see Appendix E, JSON Primer.
de: Eckige Klammern (``[]``) repräsentieren Listen, und geschweifte Klammern (``{}``) repräsentieren Schlüssel/Wert-Paare (key/value dictionaries). Schlüssel müssen Strings sein, umschlossen von Anführungszeichen (``"``) und Werte können den Typ String, Number, Boolean, Listen, oder Schlüssel-/Wert-Paare haben. Für eine ausführlichere Beschreibung von JSON, siehe Anhang E, JSON Einstieg.

source: Let's create another database::
de: Lass uns eine neue Datenbank anlegen::

source: We already have a database with that name, so CouchDB will respond with an error. Let's try again with a different database name::
de: Da wir bereits eine Datenbank mit diesem Namen haben, wird CouchDB mit einer Fehlermeldung antworten. Lass es uns mit einem anderen Datenbanknamen versuchen::

source: Retrieving the list of databases yet again shows some useful results::
de: Ein nochmaliges Anfordern der Liste der Datenbanken zeigt wieder einige nützliche Ergebnisse::

source: CouchDB will respond with::
de: CouchDB wird folgendes zurückgeben::

source: To round things off, let's delete the second database::
de: Um das Ganze zu vervollständigen löschen wir nun die zweite Datenbank::

source: The list of databases is now the same as it was before::
de: Die Liste der Datenbanken ist nun die selbe wie vorher::

source: For brevity, we'll skip working with documents, as the next section covers a different and potentially easier way of working with CouchDB that should provide experience with this. As we work through the example, keep in mind that "under the hood" everything is being done by the application exactly as you have been doing here manually. Everything is done using GET, PUT, POST, and DELETE with a URI.
de: Um es kurz zu halten werden wir das Arbeiten mit Dokumenten überspringen, da der nächste Abschnitt einen wahrscheinlich leichteren Ansatz zur Arbeit und Vermittlung erster Erfahrungen mit CouchDB bietet. Während wir die folgenden Beispiele bearbeiten reicht es im Hinterkopf zu behalten, dass "unter der Haube" alles von der Applikation so ausgeführt wird, wie wir es eben manuell getan haben. Alles basiert auf der Benutzung von GET, PUT, POST und DELETE in Verbindung mit einer URI.

source: Welcome to Futon
de: Willkommen bei Futon

source: After having seen CouchDB's raw API, let's get our feet wet by playing with Futon, the built-in administration interface. Futon provides full access to all of CouchDB's features and makes it easy to work with some of the more complex ideas involved. With Futon we can create and destroy databases; view and edit documents; compose and run MapReduce views; and trigger replication between databases.
de: Nachdem wir uns die eigentliche Schnittstelle von CouchDB angeschaut haben, wollen wir uns nun mit Futon beschäftigen, dem integrierten Administrationsinterface. Futon bietet Vollzugriff auf alle CouchDB-Features und macht es einem leicht mit komplexeren Ansätzen von CouchDB zu arbeiten. Mit Futon können wir Datenbanken erstellen und löschen, Dokumente editieren und anzeigen, sowie MapReduce-Views erzeugen und betreiben als auch Replikationen zwischen Datenbanken starten.

source: To load Futon in your browser, visit::
de: Um Futon im Browser aufzurufen, besuche::

source: If you're running version 0.9 or later, you should see something similar to :ref:`intro/tour-01`. In later documents, we'll focus on using CouchDB from server-side languages such as Ruby and Python. As such, this document is a great opportunity to showcase an example of natively serving up a dynamic web application using nothing more than CouchDB's integrated web server, something you may wish to do with your own applications.
de: Wenn Du eine Version ab 0.9 betreibst, solltest du etwas in der Art von :ref:`intro/tour-01` sehen. Später werden wir den Fokus auf die Benutzung von CouchDB mit serverseitigen Sprachen wie Ruby oder Python legen. Daher ist dieses Dokument eine großartiges Beispiel eine dynamische Webanwendung zu zeigen, die nichts anderes als CouchDB's integrierten Webserver benutzt. Wahrscheinlich möchtest du das auch mit deinen eigenen Applikation machen.

source: The first thing we should do with a fresh installation of CouchDB is run the test suite to verify that everything is working properly. This assures us that any problems we may run into aren't due to bothersome issues with our setup. By the same token, failures in the Futon test suite are a red flag, telling us to double-check our installation before attempting to use a potentially broken database server, saving us the confusion when nothing seems to be working quite like we expect!
de: Das Erste, was man mit einer neuen CouchDB Installation machen sollte, ist die Test Suite auszuführen, um sicherzustellen, dass alles korrekt funktioniert. Liefern die Tests keine Fehler, kann ausgeschlossen werden, dass spätere Probleme an einem fehlerhaften Setup liegen. Zugleich ist ein Fehler in der Test Suite ein Warnzeichen, die Installation noch einmal genau zu überprüfen bevor man einen eventuell defekten Datenbankserver produktiv einsetzt. Das spart viele Kopfschmerzen, wenn die Dinge nicht so laufen, wie sie sollten.

source: Some common network configurations cause the replication test to fail when accessed via the localhost address. You can fix this by accessing CouchDB via 127.0.0.1, e.g. http://127.0.0.1:5984/_utils/.
de: Bei einigen Netzwerkkonfigurationen schlagen die Tests für die Replikation fehl, wenn man Futon über localhost aufruft. Man kann das umgehen, indem man stattdessen die IP Adresse benutzt (http://127.0.0.1:5984/_utils/).

source: Navigate to the test suite by clicking "Test Suite" on the Futon sidebar, then click "run all" at the top to kick things off. :ref:`intro/tour-02` shows the Futon test suite running some tests.
de: Um die Test Suite auszuführen, klickt man rechts in der Futon Seitenleiste auf „Test Suite“ und anschließend oben auf „Run all“ um die Tests zu starten. :ref:`intro/tour-02` zeigt ein paar Tests, die in der Futon Testsuite ausgeführt werden.

source: Because the test suite is run from the browser, not only does it test that CouchDB is functioning properly, it also verifies that your browser's connection to the database is properly configured, which can be very handy for diagnosing misbehaving proxies or other HTTP middleware.
de: Da die Test Suite vom Browser aus gestartet wird, testet sie nicht nur die Funktion von CouchDB, sondern auch die Kommunikation zwischen Browser und CouchDB. So erkennt man schlecht konfigurierte Proxies oder andere HTTP Middleware.

source: If the test suite has an inordinate number of failures, you'll need to see the troubleshooting section in Appendix D, Installing from Source for the next steps to fix your installation.
de: Falls die Test Suite eine ungewöhnlich hohe Anzahl von Fehlern produziert, solltest du im Abschnitt Troubleshooting in Anhang D Installation von Source nachschlagen, wie man die Installation repariert.

source: Now that the test suite is finished, you've verified that your CouchDB installation is successful and you're ready to see what else Futon has to offer.
de: Ist die Test Suite erfolgreich durchgelaufen, ist sichergestellt, das CouchDB korrekt arbeitet und wir können nun einen Blick darauf werfen, welche anderen Funktionen Futon noch bietet.

source: Your First Database and Document
de: Die erste Datenbank und das erste Dokument

source: Creating a database in Futon is simple. From the overview page, click "Create Database." When asked for a name, enter hello-world and click the Create button.
de: Eine Datenbank in Futon zu erstellen ist simpel. Auf der Übersichtsseite klickt man zunächst auf „Create Database“. Für die erste Datenbank wählen wir den Namen hello-world. Mit einem Klick auf den „Create“ Button wird die Datenbank angelegt.

source: After your database has been created, Futon will display a list of all its documents. This list will start out empty (:ref:`intro/tour-03`), so let's create our first document. Click the "New Document" link and then the Create button in the pop up. Make sure to leave the document ID blank, and CouchDB will generate a UUID for you.
de: Anschließend zeigt Futon eine Liste aller Dokumente, die bei einer neuen Datenbank jedoch leer ist (:ref:`intro/tour-03`). Mit einem Klick auf „New Document“ legen wir ein erstes Dokument an. Futon hat das _id Feld bereits mit einer UUID vorbelegt. Lässt man es frei, wird CouchDB eine UUID für das Dokument wählen.

source: For demoing purposes, having CouchDB assign a UUID is fine. When you write your first programs, we recommend assigning your own UUIDs. If your rely on the server to generate the UUID and you end up making two POST requests because the first POST request bombed out, you might generate two docs and never find out about the first one because only the second one will be reported back. Generating your own UUIDs makes sure that you'll never end up with duplicate documents.
de: In den Beispielen ist es in Ordnung, wenn CouchDB die UUIDs für die Dokumente bestimmt. Für eigene Anwendungen empfehlen wir jedoch grundsätzlich die UUIDs selber zu wählen. Wenn man sich auf darauf verlässt, dass der Server die UUIDs wählt, kann es vorkommen, dass man Dokumente doppelt anlegt. Das geschieht wenn man einen zweiten POST Request abschickt weil der erste aus irgendeinem Grund fehlgeschlagen ist. In dieser Situation kann es passieren, das man zwei Dokumente erzeugt hat, weil CouchDB das Dokument angelegt haben kann ohne das die Bestätigung beim Absender eintrifft. So geht das erste Dokument verloren. Wählt man die UUIDs selber, kann man Dokumente nicht doppelt anlegen.

source: Futon will display the newly created document, with its _id and _rev as the only fields. To create a new field, click the "Add Field" button. We'll call the new field hello. Click the green check icon (or hit the Enter key) to finalize creating the hello field. Double-click the hello field's value (default null) to edit it.
de: Futon zeigt anschließend das neue Dokument an, welches nur aus den beiden Attributen _id und _rev besteht. Um ein weiteres Feld hinzuzufügen, klickt man auf "Add Field" und gibt dem Feld einen Namen. Durch einen Doppelklick auf den Wert kann man ihn ändern.

source: You can experiment with other JSON values; e.g., ``[1, 2, "c"]`` or ``{"foo": "bar"}``. Once you've entered your values into the document, make a note of its ``_rev`` attribute and click "Save Document." The result should look like :ref:`intro/tour-04` document in Futon".
de: Du kannst gern mit anderen JSON Ausdrücken wie ``[1, 2, "c"]`` oder ``{"foo": "bar"}`` experimentieren. Achte vor dem Speichern auf den Wert des ``_rev`` Attributes und klicke dann auf „Save Document“. Das Ergebnis sollte so ähnlich aussehen, wie in :ref:`intro/tour-04`.

source: You'll notice that the document's _rev has changed. We'll go into more detail about this in later documents, but for now, the important thing to note is that _rev acts like a safety feature when saving a document. As long as you and CouchDB agree on the most recent _rev of a document, you can successfully save your changes.
de: Wenn du gut aufgepasst hast, ist dir aufgefallen, dass sich der Wert des _rev Attributs geändert hat. Wir werden auf die Bedeutung später noch genauer eingehen. Im Moment genügt es zu verstehen, dass das _rev Attribut ein Sicherheitsmechanismus beim Speichern von Dokumenten ist. So lange die Anwendung die gleiche Version des Dokuments speichern möchte, die CouchDB als die aktuelle Version betrachtet, kann man das Dokument speichern.

source: Futon also provides a way to display the underlying JSON data, which can be more compact and easier to read, depending on what sort of data you are dealing with. To see the JSON version of our "hello world" document, click the Source tab. The result should look like :ref:`intro/tour-05`.
de: Futon erlaubt auch das Dokument in JSON Notation auszugeben, was je nach Art der Daten kompakter und einfacher zu lesen sein kann. Um die JSON Repräsentation unseres „Hello World“ Dokuments zu sehen, klicke auf den „Source“ Reiter. Das Ergebnis sollte ungefähr so aussehen wie in :ref:`intro/tour-05`.

source: Running a Query Using MapReduce
de: Eine Abfrage mit MapReduce

source: Traditional relational databases allow you to run any queries you like as long as your data is structured correctly. In contrast, CouchDB uses predefined map and reduce functions in a style known as MapReduce. These functions provide great flexibility because they can adapt to variations in document structure, and indexes for each document can be computed independently and in parallel. The combination of a map and a reduce function is called a view in CouchDB terminology.
de: Relationale Datenbanken erlauben, dass man jederzeit Abfragen gegen die Datenbank ausführen kann, solange die Daten ordentlich strukturiert sind. Im Gegensatz dazu verwendet CouchDB vordefinierte map und reduce Funktionen in einer Form, die man unter dem Begriff MapReduce kennt. Diese Funktionen erlauben eine große Flexibilität, denn sie können mit Variationen in der Struktur der Dokumente umgehen. Sie erlauben es auch, die Indizes für verschiedene Dokumente unabhängig voneinander und parallel zu berechnen. Die Kombination einer map und einer reduce Funktion nennt man in CouchDB eine View.

source: For experienced relational database programmers, MapReduce can take some getting used to. Rather than declaring which rows from which tables to include in a result set and depending on the database to determine the most efficient way to run the query, reduce queries are based on simple range requests against the indexes generated by your map functions.
de: Für erfahrene Benutzer relationaler Datenbanken kann MapReduce gewöhnungsbedürftig sein. Bei relationen Datenbanken bestimmt eine Anfrage, welche Zeilen einer Tabelle Teil des Resultats sind und man verlässt sich auf die Datenbank die effizienteste Lösung für die Erfüllung der Anfrage zu finden. Abfragen mit einer reduce Funktion dagegen arbeiten mit einfachen Bereichsabfragen auf Indizes, die zuvor mit map Funktionen erstellt wurden.

source: Map functions are called once with each document as the argument. The function can choose to skip the document altogether or emit one or more view rows as key/value pairs. Map functions may not depend on any information outside of the document. This independence is what allows CouchDB views to be generated incrementally and in parallel.
de: Die map Funktionen werden genau einmal für jedes Dokument aufgerufen und das Dokument ist das einzige Argument. Die Funktion kann das Dokument ignorieren oder eine oder mehrere Zeilen als Key/Value Paare zurückliefern (emit). map Funktionen müssen in sich abgeschlossen sein und dürfen nur auf Daten innerhalb des Dokuments zugreifen. Diese Unabhängigkeit von anderen Dokumenten und globalen Variablen ermöglicht es CouchDB Views inkrementell und parallel zu erstellen.

source: CouchDB views are stored as rows that are kept sorted by key. This makes retrieving data from a range of keys efficient even when there are thousands or millions of rows. When writing CouchDB map functions, your primary goal is to build an index that stores related data under nearby keys.
de: Die Ergebnisse der Views von CouchDB werden als Zeilen gespeichert, die nach dem Schlüssel sortiert sind. Das ermöglicht einen sehr effizienten Zugriff, selbst wenn bei Tausenden oder Millionen von Zeilen. Schreibt man eine map Funktion in CouchDB, so ist das Ziel einen Index zu erzeugen, der alle relevanten Daten unter einem Schlüssel enthält.

source: Before we can run an example MapReduce view, we'll need some data to run it on. We'll create documents carrying the price of various supermarket items as found at different shops. Let's create documents for apples, oranges, and bananas. (Allow CouchDB to generate the _id and _rev fields.) Use Futon to create documents that have a final JSON structure that looks like this:
de: Bevor wir ein Beispiel mit einer MapReduce View erstellen können, benötigen wir einige Daten. Dazu erzeugen wir drei Dokumente mit Preisen von Früchten aus verschiedenen Geschäften. Wir benutzen Futon um die Dokumente für die Preise von Äpfeln, Orangen und Bananen anzulegen. (Das Setzen der _id und _rev Felder überlassen wir dabei CouchDB.) Die JSON Struktur sollte dabei wie folgt aussehen:

source: This document should look like :ref:`intro/tour-06` when entered into Futon.
de: Dieses Dokument sollte in Futon wie :ref:`intro/tour-06` aussehen.

source: OK, now that that's done, let's create the document for oranges:
de: Anschließend die Preise für Orangen:

source: And finally, the document for bananas:
de: Zum Schluss die Preise für Bananen:

source: Imagine we're catering a big luncheon, but the client is very price-sensitive. To find the lowest prices, we're going to create our first view, which shows each fruit sorted by price. Click "hello-world" to return to the hello-world overview, and then from the "select view" menu choose "Temporary view…" to create a new view.
de: Stellen wir uns nun vor, wir müssten ein Buffet für einen Kunden organisieren, der sehr auf den Preis achtet. Um den niedrigsten Preis zu finden erstellen wir eine erste View, welche die Früchte nach Preis sortiert. Dazu klicken wir zunächst oben auf „hello-world“, um wieder auf die Übersicht der Datenbank zu gelangen. Anschließend wählen wir aus der „View“ Drop-Downliste „Temporary View…“ aus, um eine neue View anzulegen.

source: Edit the map function, on the left, so that it looks like the following:
de: Die map Funktion sollte nach dem Editieren so aussehen:

source: This is a JavaScript function that CouchDB runs for each of our documents as it computes the view. We'll leave the reduce function blank for the time being.
de: Diese JavaScript Funktion führt CouchDB mit jedem der Dokumente aus, während es die View berechnet. Die reduce Funktion bleibt im Moment noch leer.
