Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/intro/tour.po
Languages: de

source: Click "Run" and you should see result rows like in :ref:`intro/tour-08`, with the various items sorted by price. This map function could be even more useful if it grouped the items by type so that all the prices for bananas were next to each other in the result set. CouchDB's key sorting system allows any valid JSON object as a key. In this case, we'll emit an array of [item, price] so that CouchDB groups by item type and price.
de: Wenn du auf „Run“ klickst sollte das Ergebnis wie in :ref:`intro/tour-08` aussehen. Die verschiedenen Früchte sind dabei nach Preis sortiert. Allerdings kann die Sortierung noch verbessert werden. Besser wäre es die Ergebnisse zuerst nach Typ und dann nach Preis zu sortieren. Dazu muß der Schlüssel jedoch mehr als einen Wert enthalten. Da in CouchDB jedes JSON Objekt ein Schlüssel sein kann, schreibt man die Map Funktion so um, dass sie ein Array [item, price] zurückliefert, sodass CouchDB die Daten entsprechend sortiert.

source: Let's modify the view function so that it looks like this:
de: Ändern wir die map Funktion wie folgt:

source: Here, we first check that the document has the fields we want to use. CouchDB recovers gracefully from a few isolated map function failures, but when a map function fails regularly (due to a missing required field or other JavaScript exception), CouchDB shuts off its indexing to prevent any further resource usage. For this reason, it's important to check for the existence of any fields before you use them. In this case, our map function will skip the first "hello world" document we created without emitting any rows or encountering any errors. The result of this query should look like :ref:`intro/tour-09`.
de: CouchDB verkraftet einige isolierte Fehler in einer map Funktion. Werden jedoch zuviele Fehler produziert - beispielsweise durch falsches JavaScript oder durch ein fehlendes Attribut - beendet CouchDB die Indizierung, um nicht noch mehr Rechenzeit zu verschwenden. Daher sollte die map Funktion prüfen, ob das Dokument alle benötigten Felder besitzt. In diesem Fall wird die map Funktion das erste „Hello World“ Dokument überspringen, weil es weder ein Attribut „item“ noch ein Attribut „price“ hat. Das Ergebnis sollte wie in :ref:`intro/tour-09` aussehen.

source: Once we know we've got a document with an item type and some prices, we iterate over the item's prices and emit key/values pairs. The key is an array of the item and the price, and forms the basis for CouchDB's sorted index. In this case, the value is the name of the shop where the item can be found for the listed price.
de: Hat das Dokument einen Typ und einen oder mehrere Preise, iteriert die map Funktion über die Preise und gibt für jeden einzelnen ein Key/Value Paar aus (emit). Der Schlüssel ist ein Array aus Typ und Preis und ist die Basis für den sortierten Index. In diesem Fall ist der Wert nur der Name des Geschäfts in dem die Früchte zu dem angegebenen Preis gekauft werden können.

source: View rows are sorted by their keys -- in this example, first by item, then by price. This method of complex sorting is at the heart of creating useful indexes with CouchDB.
de: Die Zeilen von Views werden immer nach ihrem Schlüssel sortiert. In diesem Beispiel zuerst nach Typ und dann nach Preis. Diese Sortierung ist das Kernstück um sinnvolle Indizes mit CouchDB zu erstellen.

source: MapReduce can be challenging, especially if you've spent years working with relational databases. The important things to keep in mind are that map functions give you an opportunity to sort your data using any key you choose, and that CouchDB's design is focused on providing fast, efficient access to data within a range of keys.
de: MapReduce kann eine Herausforderung darstellen, besonders wenn man jahrelange Erfahrung mit relationalen Datenbanken hat. Das Wichtigste an map Funktionen ist, dass sie es erlauben die Daten nach einem beliebigen Schlüssel zu sortieren kann und CouchDB darauf ausgerichtet ist, auf Schlüsselbereiche schnell und effizient zuzugreifen.

source: Triggering Replication
de: Replikation

source: Futon can trigger replication between two local databases, between a local and remote database, or even between two remote databases. We'll show you how to replicate data from one local database to another, which is a simple way of making backups of your databases as we're working through the examples.
de: Mit Futon kann man die Replikation von zwei lokalen Datenbanken, zwischen einer lokalen und einer Remote-Datenbank und sogar zwischen zwei Remote-Datenbanken anstoßen. Das folgende Beispiel repliziert eine lokale Datenbank in eine andere lokale Datenbank. Das ist zugleich ein einfacher Weg, ein Backup einer Datenbank zu erstellen.

source: First we'll need to create an empty database to be the target of replication. Return to the overview and create a database called hello-replication. Now click "Replicator" in the sidebar and choose hello-world as the source and hello-replication as the target. Click "Replicate" to replicate your database. The result should look something like :ref:`intro/tour-10`.
de: Zuerst wird eine leere Datenbank benötigt, welche das Ziel der Replikation sein wird. Dazu erzeugen wir in der Übersicht eine neue Datenbank hello-replication. Anschließend wählt man rechts den „Replicator“, wählt hello-world als Quelle und hello-replication als Ziel. Ein Klick auf „Replicate“ startet die Replikation und das Ergebnis sollte wie in :ref:`intro/tour-10` aussehen.

source: For larger databases, replication can take much longer. It is important to leave the browser window open while replication is taking place. As an alternative, you can trigger replication via curl or some other HTTP client that can handle long-running connections. If your client closes the connection before replication finishes, you'll have to retrigger it. Luckily, CouchDB's replication can take over from where it left off instead of starting from scratch.
de: Die Replikation von größeren Datenbanken kann natürlich viel länger dauern. Da wir die Replikation über den Browser angestoßen haben, darf das Fenster nicht geschlossen werden, bis die Replikation abgeschlossen ist. Alternativ kann die Replikation auch mit curl oder einem anderen HTTP Client gestartet werden, der lang laufenden Anfragen verarbeiten kann. Schließt der Client die Verbindung bevor die Replikation abgeschlossen ist, muss sie erneut gestartet werden. Allerdings fängt CouchDB nicht von vorne an sondern macht da weiter, wo es vorher aufgehört hat.

source: Wrapping Up
de: Zusammenfassung

source: Now that you've seen most of Futon's features, you'll be prepared to dive in and inspect your data as we build our example application in the next few documents. Futon's pure JavaScript approach to managing CouchDB shows how it's possible to build a fully featured web application using only CouchDB's HTTP API and integrated web server.
de: Nachdem wir die meisten der Features von Futon gesehen haben, sind wir für die kommenden Kapitel gerüstet, in denen wir die Daten genauer untersuchen und eine Beispiel Anwendung bauen werden. Futon ist vollständig in JavaScript geschrieben und dieser Ansatz zeigt uns, dass es möglich ist, nur mit der HTTP Schnittstelle (API) von CouchDB und dem integrierten Web Server eine vollständige Web Anwendung zu entwickeln.

source: But before we get there, we'll have another look at CouchDB's HTTP API -- now with a magnifying glass. Let's curl up on the couch and relax.
de: Doch als Nächstes werden wir die HTTP Schnittstelle (API) von CouchDB genauer unter die Lupe nehmen. Ab auf die Couch zum Entspannen.
