Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/intro/why.po
Languages: de

source: Why CouchDB?
de: Warum CouchDB?

source: Apache CouchDB is one of a new breed of database management systems. This topic explains why there's a need for new systems as well as the motivations behind building CouchDB.
de: Apache CouchDB ist eine neue Art von Datenbank System. Dieser Bereich beschreibt zunächst, warum es einen Bedarf für solche Systeme gibt. Anschließend wird auf die Motivation eingegangen, die hinter der Entwicklung von CouchDB steckt.

source: As CouchDB developers, we're naturally very excited to be using CouchDB. In this topic we'll share with you the reasons for our enthusiasm. We'll show you how CouchDB's schema-free document model is a better fit for common applications, how the built-in query engine is a powerful way to use and process your data, and how CouchDB's design lends itself to modularization and scalability.
de: Als CouchDB Entwickler haben wir selbstverständlicherweise ein starkes Interesse daran, CouchDB zu benutzen. Wir möchten erzählen, was uns an CouchDB begeistert. Wir werden zeigen, warum das schemafreie Dokumenten Modell von CouchDB besser für die heute üblichen Anwendungen geeignet ist, warum die eingebaute Query-Engine ein guter Weg ist, die gespeicherten Daten zu lesen und zu verarbeiten und wie das Design von CouchDB Modularisierung und Skalierbarkeit fördert.

source: If there's one word to describe CouchDB, it is *relax*. It is the byline to CouchDB's official logo and when you start CouchDB, you see::
de: Falls man CouchDB mit einem Begriff beschreiben müsste, so ist es *Relax*. Es ist die Byline von CouchDBs offiziellem Logo und wenn man CouchDB startet, steht dort:

source: Why is relaxation important? Developer productivity roughly doubled in the last five years. The chief reason for the boost is more powerful tools that are easier to use. Take Ruby on Rails as an example. It is an infinitely complex framework, but it's easy to get started with. Rails is a success story because of the core design focus on ease of use. This is one reason why CouchDB is relaxing: learning CouchDB and understanding its core concepts should feel natural to most everybody who has been doing any work on the Web. And it is still pretty easy to explain to non-technical people.
de: Warum ist Entspannung wichtig? Die Produktivität von Entwicklern hat sich in den letzten fünf Jahren verdoppelt. Für diesen Schub sind hauptsächlich bessere Tools, die gleichzeitig einfacher zu bedienen sind, verantwortlich. Wenn man Ruby on Rails als Beispiel nimmt, so sieht man ein unendlich komplexes Framework mit dem der Einstieg jedoch sehr leicht ist. Rails ist eine Erfolgsgeschichte weil das Hauptziel der Entwicklung auf der einfachen Bedienung lag. Das ist einer der Gründe, warum CouchDB entspannend ist. Das Verstehen der Grundkonzepte von CouchDB fühlt sich für jeden natürlich an, der in irgendeiner Form mit dem Web arbeitet. Selbst nicht-technischen Leuten ist es relativ einfach zu vermitteln.

source: Getting out of the way when creative people try to build specialized solutions is in itself a core feature and one thing that CouchDB aims to get right. We found existing tools too cumbersome to work with during development or in production, and decided to focus on making CouchDB easy, even a pleasure, to use.
de: Nicht im Weg zu stehen, wenn kreative Menschen versuchen ein Problem zu lösen, ist eine der wichtigsten Eigenschaften — eine, die CouchDB versucht gut erfüllen. Für uns waren die bestehenden Tools zu schwerfällig — sowohl während der Entwicklung als auch während des Betriebs. Deshalb haben wir uns darauf konzentriert, CouchDB so einfach wie möglich zu halten und es spielend leicht bedienen zu können.

source: Another area of relaxation for CouchDB users is the production setting. If you have a live running application, CouchDB again goes out of its way to avoid troubling you. Its internal architecture is fault-tolerant, and failures occur in a controlled environment and are dealt with gracefully. Single problems do not cascade through an entire server system but stay isolated in single requests.
de: Ein weiterer Bereich der Entspannung ist der Produktivbetrieb. Im Zusammenspiel mit einer Anwendung, die von echten Benutzern benutzt wird, versucht CouchDB sein Möglichstes, um den Administrator in Ruhe zu lassen. Die interne Architektur ist fehlertolerant, Ausnahmen finden in einer kontrollierten Umgebung statt und werden ordentlich bearbeitet. Einzelne Fehler rauschen nicht durch das ganze System nach oben durch sondern bleiben auf den einen Request beschränkt.

source: CouchDB's core concepts are simple (yet powerful) and well understood. Operations teams (if you have a team; otherwise, that's you) do not have to fear random behavior and untraceable errors. If anything should go wrong, you can easily find out what the problem is, but these situations are rare.
de: Die Konzepte von CouchDB sind einfach, aber dennoch mächtig und gut dokumentiert. Das Produktionsteam (falls es ein Team gibt, andernfalls bist das du) brauchen sich keine Sorgen vor unvorhersagbarem Verhalten und schwer nachvollziehbaren Fehlern zu machen. Falls etwas schief gehen sollte, kann man einfach herausfinden, wo das Problem liegt — doch diese Fälle sind selten.

source: CouchDB is also designed to handle varying traffic gracefully. For instance, if a website is experiencing a sudden spike in traffic, CouchDB will generally absorb a lot of concurrent requests without falling over. It may take a little more time for each request, but they all get answered. When the spike is over, CouchDB will work with regular speed again.
de: CouchDB ist von Anfang an darauf ausgelegt, mit wechselnder Last intelligent umzugehen. Sollte eine Webseite schlagartig viele Requests bekommen, wird CouchDB sie einfach weiter beantworten ohne einen zu vergessen. Es mag unter Last etwas länger dauern, aber alle bekommen eine Antwort. Sobald der Ansturm vorüber ist, antwortet CouchDB wieder mit gewohnter Geschwindigkeit.

source: The third area of relaxation is growing and shrinking the underlying hardware of your application. This is commonly referred to as scaling. CouchDB enforces a set of limits on the programmer. On first look, CouchDB might seem inflexible, but some features are left out by design for the simple reason that if CouchDB supported them, it would allow a programmer to create applications that couldn't deal with scaling up or down.
de: Der dritte Bereich der Entspannung sind wechselnde Hardware Anforderungen deiner Anwendung. Das wird üblicherweise als Skalierung bezeichnet. CouchDB setzt dem Programmierer Grenzen. Das mag auf den ersten Blick unflexibel erscheinen, doch manche Funktionen wurden ganz bewusst weggelassen, weil mit ihnen der Programmierer in der Lage gewesen wäre, Anwendungen zu schreiben, die nicht skalieren.

source: CouchDB doesn't let you do things that would get you in trouble later on. This sometimes means you'll have to unlearn best practices you might have picked up in your current or past work.
de: CouchDB erlaubt dir keine Dinge, die dich später in Schwierigkeiten bringen. Das kann bedeuten, dass man alte Gewohnheiten über Bord werfen muß.

source: A Different Way to Model Your Data
de: Ein anderer Weg Daten zu modellieren

source: We believe that CouchDB will drastically change the way you build document-based applications. CouchDB combines an intuitive document storage model with a powerful query engine in a way that's so simple you'll probably be tempted to ask, “Why has no one built something like this before?”
de: Wir glauben das CouchDB die Art, wie du dokumentenbasierte Anwendungen baust sich verändern wird. CouchDB verbindet ein intuitives Modell zum Speichern von Dokumenten kombiniert mit einer mächtigen Query-Engine, die so einfach ist, dass man sich fragt, "Warum hat das noch niemand vorher gebaut?".

source: Django may be built for the Web, but CouchDB is built of the Web. I've never seen software that so completely embraces the philosophies behind HTTP. CouchDB makes Django look old-school in the same way that Django makes ASP look outdated.
de: Django mag für das Web gebaut worden sein, doch CouchDB ist auf dem Web gebaut. Ich habe bisher noch keine Software gesehen, welche die Philosophien von HTTP so vollständig umgesetzt hat. CouchDB lässt Django alt aussehen — genauso wie Django ASP hat alt aussehen lassen.

source: Jacob Kaplan-Moss, Django developer
de: Jacob Kaplan-Moss, Django Entwickler

source: CouchDB's design borrows heavily from web architecture and the concepts of resources, methods, and representations. It augments this with powerful ways to query, map, combine, and filter your data. Add fault tolerance, extreme scalability, and incremental replication, and CouchDB defines a sweet spot for document databases.
de: Das Design von CouchDB ist stark an bestehende Web Architekturen und den Konzepten von Resourcen, Methoden und Darstellungen angelehnt. Es kombiniert sie in mächtiger Weise um Daten zu suchen, abzubilden, zu kombinieren und zu filtern. Hinzu kommen Fehlertoleranz, extreme Skalierbarkeit und inkrementelle Replikation. Damit definiert CouchDB genau den Sweet Spot für dokumentenbasierte Datenbanken.

source: A Better Fit for Common Applications
de: Ein besserer Ansatz für gängige Anwendungen

source: We write software to improve our lives and the lives of others. Usually this involves taking some mundane information such as contacts, invoices, or receipts and manipulating it using a computer application. CouchDB is a great fit for common applications like this because it embraces the natural idea of evolving, self-contained documents as the very core of its data model.
de: Wir schreiben Software, um unser Leben und das Leben anderer zu erleichtern. Dazu verwenden wir meistens einfache Informationen wie Kontakte, Rechnungen oder Quittungen und verarbeiten sie mithilfe von Computer Software. CouchDB ist ein guter Partner für solche Anwendungen, denn es arbeitet mit der natürlichen Idee von in sich abgeschlossenen Dokumenten, die alle notwendigen Informationen enthalten und mit der Zeit fortgeschrieben werden.

source: Self-Contained Data
de: In sich abgeschlossene Daten

source: An invoice contains all the pertinent information about a single transaction the seller, the buyer, the date, and a list of the items or services sold. As shown in :ref:`intro/why-01`, there's no abstract reference on this piece of paper that points to some other piece of paper with the seller's name and address. Accountants appreciate the simplicity of having everything in one place. And given the choice, programmers appreciate that, too.
de: Eine Rechnung enthält alle notwendigen Informationen über einen einzelnen Vorgang. Den Verkäufer, den Käufer, das Datum und eine Auflistung der Dinge oder Dienste, die verkauft wurden. Wie in Abbildung 1 „In sich abgeschlossene Dokumente“ zu sehen ist, gibt es keine abstrakten Referenzen auf dem Stück Papier, die zu einem anderen Stück Papier verweisen, zum Beispiel mit dem Namen und der Adresse des Verkäufers. Buchhalter wissen es zu schätzen, alle Informationen auf einen Blick zu haben. Falls sie die Möglichkeit haben, bevorzugen Programmierer das auch.

source: Yet using references is exactly how we model our data in a relational database! Each invoice is stored in a table as a row that refers to other rows in other tables one row for seller information, one for the buyer, one row for each item billed, and more rows still to describe the item details, manufacturer details, and so on and so forth.
de: Doch genau mit solchen Referenzen werden Daten in relationalen Datenbanken modelliert. Jede Rechnung wird als Zeile in einer Tabelle gespeichert. Diese Zeile verweist auf andere Zeilen in anderen Tabellen — eine für den Käufer, eine für den Verkäufer, eine für jedes Teil was verkauft wurde und noch mehr Zeilen, die wiederum die verkauften Teile genauer beschreiben.

source: This isn't meant as a detraction of the relational model, which is widely applicable and extremely useful for a number of reasons. Hopefully, though, it illustrates the point that sometimes your model may not “fit” your data in the way it occurs in the real world.
de: Damit soll der Wert von relationalen Modellen nicht geschmälert werden. Sie sind in vielen Anwendungen im Einsatz und haben sich aus verschiedenen Gründen als sehr nützlich erwiesen. Das vorangegange Beispiel soll zeigen, dass manche Modelle sich nicht so gut für die Daten der realen Welt eignen.

source: Let's take a look at the humble contact database to illustrate a different way of modeling data, one that more closely “fits” its real-world counterpart -- a pile of business cards. Much like our invoice example, a business card contains all the important information, right there on the cardstock. We call this “self-contained” data, and it's an important concept in understanding document databases like CouchDB.
de: Schauen wir auf eine einfache Adressdatenbank um einen anderen Ansatz zur Modellierung von Daten zu illustrieren. Dazu kann man sich einen Stapel Visitenkarten vorstellen. Genau wie das Beispiel mit der Rechnung enthält eine Visitenkarte alle wichtigen Informationen auf einen Blick. Wir nennen das „in sich abgeschlossene Daten“ und es ist ein wichtiges Konzept beim Verständnis von dokumentenbasierten Datenbanken wie CouchDB.

source: Syntax and Semantics
de: Syntax und Semantik

source: Most business cards contain roughly the same information -- someone's identity, an affiliation, and some contact information. While the exact form of this information can vary between business cards, the general information being conveyed remains the same, and we're easily able to recognize it as a business card. In this sense, we can describe a business card as a *real-world document*.
de: Die meisten Visitenkarten enthalten ungefähr die gleichen Informationen: den Namen, vielleicht ein Firmenname und Kontaktinformationen. Obwohl die Daten zwischen den einzelnen Karten differieren kann, ist doch das allgemeine Schema immer gleich und Menschen haben keine Schwierigkeiten damit Visitenkarten als solche zu erkennen. So gesehen kann man eine Visitenkarte als ein reales Dokument bezeichnen.

source: Jan's business card might contain a phone number but no fax number, whereas J. Chris's business card contains both a phone and a fax number. Jan does not have to make his lack of a fax machine explicit by writing something as ridiculous as “Fax: None” on the business card. Instead, simply omitting a fax number implies that he doesn't have one.
de: Jan hat vielleicht eine Telefonnummer aber keine FAX Nummer auf seiner Visitenkarte. Dagegen enthält die Karte von J. Chris beide Nummern. Jan muss das Fehlen einer FAX Nummer nicht umständlich und explizit durch “Fax: Nicht vorhanden” ausdrücken. Durch einfaches Weglassen der FAX Nummer gibt er zu verstehen, dass er keins hat.

source: We can see that real-world documents of the same type, such as business cards, tend to be very similar in *semantics* -- the sort of information they carry, but can vary hugely in *syntax*, or how that information is structured. As human beings, we're naturally comfortable dealing with this kind of variation.
de: Reale Dokumente des gleichen Typs, so wie Visitenkarten, neigen dazu in ihrer *Semantik* — die Art der Information — sehr ähnlich zu sein. Ihre *Syntax* oder wie die Information tatsächlich aufgebaut ist, kann jedoch zwischen den einzelnen Karten sehr unterschiedlich sein. Menschen haben damit kein Problem. Für uns sind diese Variationen normal.

source: While a traditional relational database requires you to model your data *up front*, CouchDB's schema-free design unburdens you with a powerful way to aggregate your data *after the fact*, just like we do with real-world documents. We'll look in depth at how to design applications with this underlying storage paradigm.
de: Während ein traditionelles relationales Datenbank System erfordert, dass man die Daten *im voraus* durch ein Schema strukturiert, erlaubt das schema-freie Design von CouchDB die Daten erst nach dem Eintrag in die Datenbank zu strukturieren. Genauso wie man es auch mit realen Dokumenten macht. Wie man mit diesem Ansatz Anwendungen zur Speicherung von Daten entwickelt betrachten wir noch tiefergehend.

source: Building Blocks for Larger Systems
de: Bausteine für größere Systeme

source: CouchDB is a storage system useful on its own. You can build many applications with the tools CouchDB gives you. But CouchDB is designed with a bigger picture in mind. Its components can be used as building blocks that solve storage problems in slightly different ways for larger and more complex systems.
de: CouchDB ist ein Speichersystem, das für sich allein genommen schon recht nützlich ist. Man kann viele Anwendungen mit den Werkzeugen bauen, die CouchDB bietet. Doch die Vision von CouchDB ist größer. Seine Bestandteile können als Bausteine für große Systeme benutzt werden, um Speicherprobleme für immer stärker wachsende Anwendungen zu lösen.

source: Whether you need a system that's crazy fast but isn't too concerned with reliability (think logging), or one that guarantees storage in two or more physically separated locations for reliability, but you're willing to take a performance hit, CouchDB lets you build these systems.
de: Ob ein System unglaublich schnell sein muss, Zuverlässigkeit aber nicht allzu wichtig ist (z.B. für Logging), oder ein System Schreiboperationen in zwei verschiedenen, geografisch getrennten Systemen garantieren muss und die damit verbundene höhere Antwortzeit akzeptabel ist — CouchDB erlaubt es solche Systeme zu bauen.

source: There are a multitude of knobs you could turn to make a system work better in one area, but you'll affect another area when doing so. One example would be the CAP theorem discussed in :ref:`intro/consistency`. To give you an idea of other things that affect storage systems, see :ref:`Figure 2 <intro/why-figure-02>` and :ref:`Figure 3 <intro/why-figure-03>`.
de: Meist gibt es viele Knöpfe an denen man drehen kann, um ein System zu optimieren. Doch hat der positive Effekt in der Regel auch unerwünschte Nebenwirkungen. Ein Beispiel ist das CAP Theorem, das im Dokument :ref:`intro/consistency` ausführlicher behandelt wird. Andere Parameter, die Datenspeichersysteme in der Regel beeinflussen, werden in :ref:`Abbildung 2 <intro/why-figure-02>` und :ref:`Abbildung 3 <intro/why-figure-03>` gezeigt.

source: By reducing latency for a given system (and that is true not only for storage systems), you affect concurrency and throughput capabilities.
de: Reduziert man die Latenz eines Systems, so hat das Auswirkungen auf die Parallelität und den Durchsatz. Das gilt im übrigen nicht nur für Speichersysteme.

source: When you want to scale out, there are three distinct issues to deal with: scaling read requests, write requests, and data. Orthogonal to all three and to the items shown in :ref:`Figure 2 <intro/why-figure-02>` and :ref:`Figure 3 <intro/why-figure-03>` are many more attributes like reliability or simplicity. You can draw many of these graphs that show how different features or attributes pull into different directions and thus shape the system they describe.
de: Wenn eine Anwendung nach oben skaliert werden soll, muss man drei Faktoren der Skalierung berücksichtigen: die der Leseoperationen, die der Schreiboperationen und die der Daten. Orthogonal zu allen dreien und zu den Parametern aus :ref:`Abbildung 2 <intro/why-figure-02>` und :ref:`Abbildung 3 <intro/why-figure-03>` sind viele weitere Parameter wie Zuverlässigkeit und Einfachheit. Man kann viele solcher Graphen zeichnen, die zeigen das verschiedene Funktionen und Eigenschaften das System in eine bestimmte Richtung ziehen oder schieben und damit das System neu formen.

source: CouchDB is very flexible and gives you enough building blocks to create a system shaped to suit your exact problem. That's not saying that CouchDB can be bent to solve any problem -- CouchDB is no silver bullet -- but in the area of data storage, it can get you a long way.
de: CouchDB ist sehr flexibel und bietet genügend Bausteine um ein System zu bauen, dass auf die aktuellen Anforderungen exakt zugeschnitten ist. Das bedeutet nicht, dass CouchDB eine Eierlegende Wollmilchsau ist, mit der man jedes Datenbank Problem lösen kann, aber man kommt schon sehr weit damit.

source: CouchDB Replication
de: CouchDB Replikation

source: CouchDB replication is one of these building blocks. Its fundamental function is to synchronize two or more CouchDB databases. This may sound simple, but the simplicity is key to allowing replication to solve a number of problems: reliably synchronize databases between multiple machines for redundant data storage; distribute data to a cluster of CouchDB instances that share a subset of the total number of requests that hit the cluster (load balancing); and distribute data between physically distant locations, such as one office in New York and another in Tokyo.
de: Die Replikation von CouchDB ist einer dieser Bausteine. Seine primäre Aufgabe ist die Synchronisation von zwei oder mehr CouchDB Datenbanken. Das mag einfach klingen, doch die Einfachheit ist der Schlüssel um mit der Replikation verschiedene Probleme zu lösen: — Zuverlässige Synchronisation von Datenbanken auf verschiedenen Maschinen um Daten redundant zu speichern — Verteilung der Daten über einen Cluster von CouchDB Instanzen, die jeweils einen Teil der Requests beantworten (Lastverteilung) und Spiegelung der Daten über geografisch weit verteilte Standort wie beispielsweise New York und Tokyo.

source: CouchDB replication uses the same REST API all clients use. HTTP is ubiquitous and well understood. Replication works incrementally; that is, if during replication anything goes wrong, like dropping your network connection, it will pick up where it left off the next time it runs. It also only transfers data that is needed to synchronize databases.
de: Die Replikation von CouchDB benutzt dabei das selbe REST API, das alle anderen Clients auch benutzen. HTTP ist allgegenwärtig und seine Nutzung gut verstanden. Die Replikation von CouchDB arbeitet inkrementell. Das bedeutet, das falls während der Replikation etwas schief geht — weil beispielsweise eine Netzwerkverbindung verschwindet — wird CouchDB genau dort wieder weiter machen, wo diese aufgehört hat. Es werden auch nur die Daten übertragen, die notwendig sind, um die Datenbanken zu synchronisieren.

source: A core assumption CouchDB makes is that things can go wrong, like network connection troubles, and it is designed for graceful error recovery instead of assuming all will be well. The replication system's incremental design shows that best. The ideas behind “things that can go wrong” are embodied in the `Fallacies of Distributed Computing`_:
de: Eine der Grundannahmen in CouchDB ist, das Fehler auftreten werden. CouchDB ist darauf ausgerichtet, Fehler vernünftig zu behandeln anstatt anzunehmen, es wird keine geben. Das inkrementelle Design der Replikation zeigt das am Besten. Die Ideen hinter “Fehler werden passieren” sind in `Fallacies of Distributed Computing`_ aufgelistet:

source: The network is reliable.
de: Das Netzwerk ist ausfallsicher

source: Latency is zero.
de: Die Latenz ist gleich Null

source: Bandwidth is infinite.
de: Der Datendurchsatz ist unendlich

source: The network is secure.
de: Das Netzwerk ist sicher

source: Topology doesn't change.
de: Die Netzwerktopologie wird sich nie ändern

source: There is one administrator.
de: Es gibt immer nur einen Netzwerkadministrator

source: Transport cost is zero.
de: Der Datentransport kostet nichts

source: The network is homogeneous.
de: Das Netzwerk ist homogen
