Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/intro/why.po
Languages: de

source: Existing tools often try to hide the fact that there is a network and that any or all of the previous conditions don't exist for a particular system. This usually results in fatal error scenarios when something finally goes wrong. In contrast, CouchDB doesn't try to hide the network; it just handles errors gracefully and lets you know when actions on your end are required.
de: Bestehende Werkzeuge versuchen oft zu verstecken, dass es ein Netzwerk gibt und das eine oder alle der oben genannten Dinge für das aktuelle System nicht zutreffen. Das Ergebnis ist oft genug eine fatale Situation wenn Dinge letzendlich doch schief gehen. CouchDB versucht im Gegenteil gar nicht erst das Netzwerk zu abstrahieren, sondern Fehler vernünftig zu behandeln und den Administrator zu benachrichtigen, wenn das nicht möglich ist.

source: Local Data Is King
de: Hauptsache Lokal

source: CouchDB takes quite a few lessons learned from the Web, but there is one thing that could be improved about the Web: latency. Whenever you have to wait for an application to respond or a website to render, you almost always wait for a network connection that isn't as fast as you want it at that point. Waiting a few seconds instead of milliseconds greatly affects user experience and thus user satisfaction.
de: CouchDB hat viele Lehren aus dem Web gezogen, doch eine Sache wäre gut für das Web: weniger Latenz. Wenn auch immer man auf eine Anwendung oder auf eine Webseite warten muss, so ist die Netzwerkverbindung meist nicht so schnell, wie es gerade erforderlich wäre. Antwortzeiten von ein paar Sekunden anstelle von Millisekunden haben einen großen Effekt auf die User Experience (UX) und die Zufriedenheit der Anwender mit dem System als Ganzem.

source: What do you do when you are offline? This happens all the time -- your DSL or cable provider has issues, or your iPhone, G1, or Blackberry has no bars, and no connectivity means no way to get to your data.
de: Was macht man, wenn man offline ist? Das passiert ständig trotz DSL und Kabel Anschluss. Was ist mit dem iPhone, dem G1 oder dem Blackberry, wenn kein Empfang vorhanden ist? Keine Verbindung bedeutet nicht an die Daten zu kommen.

source: CouchDB can solve this scenario as well, and this is where scaling is important again. This time it is scaling down. Imagine CouchDB installed on phones and other mobile devices that can synchronize data with centrally hosted CouchDBs when they are on a network. The synchronization is not bound by user interface constraints like subsecond response times. It is easier to tune for high bandwidth and higher latency than for low bandwidth and very low latency. Mobile applications can then use the local CouchDB to fetch data, and since no remote networking is required for that, latency is low by default.
de: CouchDB kann in solchen Fällen helfen und in dieser Situation ist Skalierung auch wichtig. Diesmal allerdings in die andere Richtung — nämlich nach unten. Warum nicht eine CouchDB Instanz auf einem Smartphone, die sich mit anderen CouchDB Instanzen synchronisiert, wenn eine Verbindung besteht? Die Synchronisation ist nicht nur sinnvoll für schnelle Benutzerschnittstellen. Es ist einfacher ein System auf hohe Bandbreite und hohe Latenz zu optimieren, als für geringe Bandbreite und geringe Latenz. Mobile Anwendung können anschließend die Daten in der lokalen CouchDB Instanz benutzen und weil die Daten lokal sind, ist die Latenz per Definition gering.

source: Can you really use CouchDB on a phone? Erlang, CouchDB's implementation language has been designed to run on embedded devices magnitudes smaller and less powerful than today's phones.
de: Kann man CouchDB wirklich auf einem Smartphone einsetzen? Erlang, die Sprache in der CouchDB geschrieben ist, wurde für viel kleinere und viel schwächere Geräte als die heute verfügbaren entwickelt und auch eingesetzt.

source: Wrapping Up
de: Fassen wir zusammen

source: The next document :ref:`intro/consistency` further explores the distributed nature of CouchDB. We should have given you enough bites to whet your interest. Let's go!
de: Das nächste Dokument :ref:`intro/consistency` zeigt die verteilte Natur von CouchDB. Dieses Dokument sollte genug Interessantes enthalten haben, um weiterzulesen. Auf geht's!
