Repository: demsking/couch-doc-test
Catalog: locale/*/LC_MESSAGES/replication/intro.po
Languages: de

source: Introduction Into Replications
de: Replikation - eine Einführung

source: One of CouchDB's strengths is the ability to synchronize two copies of the same database. This enables users to distribute data across several nodes or datacenters, but also to move data more closely to clients.
de: Eine der Stärken von CouchDB ist die Fähigkeit zwei Kopien der gleichen Datenbank zu synchronisieren. Dies ermöglicht es Nutzern Daten über mehrere Knoten (Nodes) oder Datenzentren zu verteilen. Ausserdem ermöglicht es Daten räumlich näher zum Nutzer zu bringen.

source: Replication involves a source and a destination database, which can be one the same or on different CouchDB instances. The aim of the replication is that at the end of the process, all active documents on the source database are also in the destination database and all documents that were deleted in the source databases are also deleted on the destination database (if they even existed).
de: Replikation beinhaltet eine Ausgangs- und eine Ziel-Datenbank, die auf der gleichen oder unterschiedlichen CouchDB-Instanzen liegen können. Das Ziel der Replikation ist es am Ende des Prozesses alle aktiven Dokumente in der Ausgangs-Datenbank auch in der Ziel-Datenbank vorzufinden und alle gelöschten Dokumente der Ausgangs-Datenbank auch in der Ziel-Datenbank (sofern vorhanden) gelöscht zu haben.

source: Triggering Replication
de: Die Replikation anstoßen

source: Replication is controlled through documents in the :ref:`replicator`, where each document describes one replication process (see :ref:`replication-settings`).
de: Eine Replikation wird über Dokumente in der :ref:`_replicator <replicator>` Datenbank gesteuert, wobei ein Dokument einen Replikations-Prozess definiert (siehe :ref:`replication-settings`).

source: A replication is triggered by storing a replication document in the replicator database. Its status can be inspected through the active tasks API (see :ref:`api/server/active_tasks` and :ref:`replication-status`). A replication can be stopped by deleting the document, or by updating it with its `cancel` property set to `true`.
de: Eine Replikation wird ausgelöst, indem ein Dokument in der Replikator Datenbank gespeichert wird. Der Status kann über die active-tasks-API eingesehen werden (siehe :ref:`api/server/active_tasks` und :ref:`replication-status`). Eine Replikation kann angehalten werden, indem das entsprechende Dokument gelöscht wird oder indem dieses aktualisiert wird mit der Eigenschaft `cancel` auf `true`.

source: Replication Procedure
de: Der Replikations-Vorgang

source: During replication, CouchDB will compare the source and the destination database to determine which documents differ between the source and the destination database. It does so by following the :ref:`changes` on the source and comparing the documents to the destination. Changes are submitted to the destination in batches where they can introduce conflicts. Documents that already exist on the destination in the same revision are not transferred. As the deletion of documents is represented by a new revision, a document deleted on the source will also be deleted on the target.
de: Während der Replikation wird CouchDB die Ausgangs- und Ziel-Datenbank vergleichen um heraus zu finden, welche Dokumente sich unterscheiden. Dies wird über den :ref:`changes` feed auf der Ausgangs- und Ziel-Datenbank getan. Änderungen werden in Stapeln (batches) zur Ziel-Datenbank übertragen wobei dort Konflikte entstehen können. Dokumente die in der Ziel-Datenbank mit der selben Revision bereits existieren, werden nicht übertragen. Da das Löschen eines Dokumentes durch eine neue Revision dargestellt wird, wird das Dokument auf der Ausgangs- und auch auf der Ziel-Datenbank gelöscht.

source: A replication task will finish once it reaches the end of the changes feed. If its `continuous` property is set to true, it will wait for new changes to appear until the task is cancelled. Replication tasks also create checkpoint documents on the destination to ensure that a restarted task can continue from where it stopped, for example after it has crashed.
de: Ein gestarteter Replikations-Job wird enden, wenn das Ende des "changes feed" erreicht ist. Wenn die `continuous` Eigenschaft auf true gesetzt ist, wird auf neue "changes" gewartet und die Repliaktion fortgeführt, bis der Job manuell beendet wird. Während einer Replikation werden "checkpoint"-Dokumente auf dem Ziel erstellt um sicher zu stellen, dass ein erneutes Starten der Replikation genau dort fortgeführt wird, wo die vorherige beendet wurde - z.B. durch einen "Crash".

source: When a replication task is initiated on the sending node, it is called *push* replication, if it is initiated by the receiving node, it is called *pull* replication.
de: Wenn ein Replikations-Job auf dem sendenden Knoten gestartet wird, handelt es sich um eine *push* Replikation. Wenn sie auf dem empfangenden Knoten gestartet wurde, handelt es sich um einen *pull* Replikation.

source: Master - Master replication
de: Master - Master Replikation

source: One replication task will only transfer changes in one direction. To achieve master-master replication it is possible to set up two replication tasks in different directions. When a change is replication from database A to B by the first task, the second will discover that the new change on B already exists in A and will wait for further changes.
de: Ein Replikations-Job überträgt Änderungen immer nur in eine Richtung. Um eine Master-Master Replikation zu verwirklichen, können zwei Replikations-Jobs in entgegen gesetzter Richtung eingerichtet werden. Wird eine Änderung von Datenbank A zu B durch den ersten Job repliziert, wird der zweite Job von B nach A feststellen, dass die Änderung von B bereits auf A existiert und warten bis weitere Änderungen eintreffen.

source: Controlling which Documents to Replicate
de: Festlegen, welche Dokumente repliziert werden sollen

source: There are two ways for controlling which documents are replicated, and which are skipped. *Local* documents are never replicated (see :ref:`api/local`).
de: Es gibt zwei Weg festzulegen, welche Dokumente repliziert werden sollen und welche ausgelassen werden. *Lokale* Dokumente werden niemals repliziert (siehe ref:`api/local`).

source: Additionally, :ref:`filterfun` can be used in a replication documents (see :ref:`replication-settings`). The replication task will then evaluate the filter function for each document in the changes feed. The document will only be replicated if the filter returns `true`.
de: Ausserdem kann :ref:`filterfun` in einer Replikation genutzt werden (siehe :ref:`replication-settings`). Der Replikations-Job wird die Filter-Funktion auf jedes Dokument im changes feed anwenden. Das Dokument wird nur repliziert, wenn das Ergebnis der Filter Funktion `true` ist.

source: Migrating Data to Clients
de: Daten zu Nutzern migrieren

source: Replication can be especially useful for bringing data closer to clients. `PouchDB <http://pouchdb.com/>`_ implements the replication algorithm of CouchDB in JavaScript, making it possible to make data from a CouchDB database available in an offline browser application, and synchronize changes back to CouchDB.
de: Replikation kann besonders nützlich sein. um Daten näher zu Nutzern zu bringen. `PouchDB <http://pouchdb.com/>`_ hat den CouchDB Replikations-Algorithmus implementiert um Daten aus einer CouchDB Datenbank in einer Browser-Applikation offline zur Verfügung zu stellen und Änderungen zurück zu CouchDB zu synchronisieren.
